using System;
using System.Collections.Generic;
using System.Text;
using System.Windows.Forms;
using System.IO;
using Spire.Doc;
using System.Text.RegularExpressions;
using Spire.Doc.Fields;
using Spire.Doc.Documents;
using System.Diagnostics;
using System.Linq;
using Aspose.Words;
using Aspose.Words.Tables;

namespace SecurityFunctions
{
    public partial class Form1 : Form
    {
        //sample file path
        string samplePath = Application.StartupPath + Path.DirectorySeparatorChar + "Template.docx";
        //result docs paths
        string docxPath = Application.StartupPath + Path.DirectorySeparatorChar + "Result.docx";
        string docxPath1 = Application.StartupPath + Path.DirectorySeparatorChar;

        //word document object
        Spire.Doc.Document document = null;

        string items = "";

        string FAU_ARP_1 = "FAU_ARP.1 Сигналы нарушения безопасности";
        string FAU_ARP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_ARP_1_dependence = "Зависимости: FAU_SAA.1 Анализ потенциального нарушения.";
        string FAU_ARP_1_1 = "FAU_ARP.1.1";
        string FAU_ARP_1_1_description = "ФБО должны предпринять [назначение: список наименее разрушительных действий]. При обнаружении возможного нарушения безопасности.";


        string FAU_GEN_1 = "FAU_GEN.1 Генерация данных аудита";
        string FAU_GEN_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_GEN_1_dependence = "Зависимости: FPT_STM.1 Надежные метки времени.";
        string FAU_GEN_1_1 = "FAU_GEN.1.1";
        string FAU_GEN_1_1_description = "ФБО должны способны генерировать запись аудита для следующих событий, потенциально подвергаемых аудиту: а) запуск и завершение выполнения функции аудита;b) все события, потенциально подвергаемые аудиту, на [выбор (выбрать одно из): минимальный, базовый, детализированный, неопределенный] уровне аудита; c) [назначение: другие специально определенные события, потенциально подвергаемые аудиту].";

        string FAU_GEN_1_2 = "FAU_GEN.1.2";
        string FAU_GEN_1_2_description = "ФБО должны регистрировать в каждой записи аудита, следующую информацию: a) дата и время события, тип события, идентификатор субъекта и результат события (успешный или неуспешный); b) для каждого типа событий, потенциально подвергаемых аудиту, из числа определенных в функциональных компонентах, которые включены в ПЗ/ЗБ [назначение: другая относящаяся к аудиту информация].";

        string FAU_GEN_2 = "FAU_GEN.2 Ассоциация идентификатора пользователя";
        string FAU_GEN_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_GEN_2_dependence = "Зависимости: FAU_GEN.1 Генерация данных аудита.";
        string FAU_GEN_2_1 = "FAU_GEN.2.1";
        string FAU_GEN_2_1_description = "ФБО должны быть способны ассоциировать каждое событие, потенциально подвергаемое аудиту, с идентификатором пользователя, который был инициатором этого события.";

        string FAU_SAA_1 = "FAU_SAA.1 Анализ потенциального нарушения";
        string FAU_SAA_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAA_1_dependence = "Зависимости: FAU_GEN.1 Генерация данных аудита.";
        string FAU_SAA_1_1 = "FAU_SAA.1.1";
        string FAU_SAA_1_1_description = "ФБО должны быть способны применять набор правил мониторинга событий, подвергающихся аудиту, и указывать на возможное нарушение ПБО, основываясь на этих правилах.";

        string FAU_SAA_1_2 = "FAU_SAA.1.2";
        string FAU_SAA_1_2_description = "ФБО должны осуществлять следующие правила при мониторинге событий, подвергающихся аудиту: a) накопление или объединение известных [назначение: подмножество определенных событий, потенциально подвергаемых аудиту], указывающих на возможное нарушение безопасности; b) [назначение: другие правила].";

        string FAU_SAA_2 = "FAU_SAA.2 Выявление аномалии, основанное на профиле";
        string FAU_SAA_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAA_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FAU_SAA_2_1 = "FAU_SAA.2.1";
        string FAU_SAA_2_1_description = "ФБО должны быть способны сопровождать профили использования системы, где каждый отдельный профиль представляет известные шаблоны предыстории использования, выполнявшиеся участниками [назначение: спецификация целевой группы профиля].";

        string FAU_SAA_2_2 = "FAU_SAA.2.2";
        string FAU_SAA_2_2_description = "ФБО должны быть способны сопровождать рейтинг подозрительной активности для каждого пользователя, чьи действия отражены в профиле, где рейтинг подозрительной активности показывает степень несогласованности действий, выполняемых пользователем, с установленными шаблонами использования, представленными в профиле.";

        string FAU_SAA_2_3 = "FAU_SAA.2.3";
        string FAU_SAA_2_3_description = "ФБО должны быть способны указывать на ожидаемое нарушение ПБО, когда рейтинг подозрительной активности пользователя превышает следующие пороговые условия [назначение: условия, при которых ФБО сообщают об аномальных действиях].";

        string FAU_SAA_3 = "FAU_SAA.3 Эвристика атаки";
        string FAU_SAA_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAA_3_dependence = "Зависимости: нет зависимостей.";
        string FAU_SAA_3_1 = "FAU_SAA.3.1";
        string FAU_SAA_3_1_description = "ФБО должны быть способны сопровождать внутреннее представление следующих характерных событий [назначение: подмножество событий системы], которые могут указывать на нарушение ПБО.";

        string FAU_SAA_3_2 = "FAU_SAA.3.2";
        string FAU_SAA_3_2_description = "ФБО должны быть способны сравнивать характерные события с записью показателей функционирования системы, полученных при обработке [назначение: информация, используемая для определения показателей функционирования системы].";

        string FAU_SAA_3_3 = "FAU_SAA.3.3";
        string FAU_SAA_3_3_description = "ФБО должны быть способны указывать на ожидаемое нарушение ПБО, когда событие системы соответствует характерному событию, указывающему на возможное нарушение ПБО.";

        string FAU_SAA_4 = "FAU_SAA.4 Сложная эвристика атаки";
        string FAU_SAA_4_hierarchy = "Иерархический для: FAU_SAA.3 Эвристика атаки";
        string FAU_SAA_4_dependence = "Зависимости: нет зависимостей";
        string FAU_SAA_4_1 = "FAU_SAA.4.1";
        string FAU_SAA_4_1_description = "ФБО должны быть способны сопровождать внутреннее представление следующих последовательностей событий известных сценариев проникновения [назначение: список последовательностей событий системы, совпадение которых характерно для известных сценариев проникновения] и следующих характерных событий [назначение: подмножество событий системы], которые могут указывать на возможное нарушение ПБО.";

        string FAU_SAA_4_2 = "FAU_SAA.4.2";
        string FAU_SAA_4_2_description = "ФБО должны быть способны сравнивать характерные события и последовательности событий с записью показателей функционирования системы, полученных при обработке [назначение: информация, используемая для определения показателей функционирования системы].";

        string FAU_SAA_4_3 = "FAU_SAA.4.3";
        string FAU_SAA_4_3_description = "ФБО должны быть способны указывать на ожидаемое нарушение ПБО, когда показатели функционирования системы соответствуют характерному событию или последовательности событий, указывающим на возможное нарушение ПБО.";

        string FAU_SAR_1 = "FAU_SAR.1 Просмотр аудита";
        string FAU_SAR_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAR_1_dependence = "Зависимости: FAU GEN.1 Генерация данных аудита";
        string FAU_SAR_1_1 = "FAU_SAR_1.1";
        string FAU_SAR_1_1_description = "ФБО должны предоставлять [назначение: уполномоченные пользователи] возможность читать [назначение: список информации аудита] из записей аудита.";

        string FAU_SAR_1_2 = "FAU_SAR_1.2";
        string FAU_SAR_1_2_description = "ФБО должны предоставлять записи аудита в виде, позволяющем пользователю воспринимать содержащуюся в них информацию.";

        string FAU_SAR_2 = "FAU_SAR.2 Ограниченный просмотр аудита";
        string FAU_SAR_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAR_2_dependence = "Зависимости: FAU_SAR.1 Просмотр аудита";
        string FAU_SAR_2_1 = "FAU_SAR.2.1";
        string FAU_SAR_2_1_description = "ФБО должны запрещать всем пользователям доступ к чтению записей аудита, за исключением пользователей, которым явно предоставлен доступ для чтения.";

        string FAU_SAR_3 = "FAU_SAR.3 Выборочный просмотр аудита";
        string FAU_SAR_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SAR_3_dependence = "Зависимости: FAU_SAR.1 Просмотр аудита";
        string FAU_SAR_3_1 = "FAU_SAR.3.1";
        string FAU_SAR_3_1_description = "ФБО должны предоставлять возможность выполнять [выбор: поиск, сортировка, упорядочение] данных аудита, основанный на [назначение: критерии с логическими отношениями].";

        string FAU_SEL_1 = "FAU_SEL.1 Избирательный аудит";
        string FAU_SEL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_SEL_1_dependence = "Зависимости: FAU_GEN.1 Генерация данных аудита FMT_MTD.1 Управление данными ФБО";
        string FAU_SEL_1_1 = "FAU_SEL.1.1";
        string FAU_SEL_1_1_description = "ФБО должны быть способны к включению событий, потенциально подвергаемых аудиту, в совокупность событий, подвергающихся аудиту, или к их исключению из этой совокупности по следующим атрибутам: a) [выбор: идентификатор объекта, идентификатор пользователя, идентификатор субъекта, идентификатор узла сети, тип события]', b) [назначение: список дополнительных атрибутов, на которых основана избирательность аудита].";

        string FAU_STG_1 = "FAU_STG.1 Защищенное хранение журнала аудита";
        string FAU_STG_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_STG_1_dependence = "Зависимости: FAU_GEN.1 Генерация данных аудита";
        string FAU_STG_1_1 = "FAU_STG.1.1";
        string FAU_STG_1_1_description = "ФБО должны защищать хранимые записи аудита от несанкционированного удаления.";

        string FAU_STG_1_2 = "FAU_STG.1.2";
        string FAU_STG_1_2_description = "ФБО должны быть способны [выбор (выбрать одно из): предотвращать, выявлять] несанкционированную модификацию хранимых записей аудита в журнале аудита.";

        string FAU_STG_2 = "FAU_STG.2 Гарантии доступности данных аудита";
        string FAU_STG_2_hierarchy = "Иерархический для: FAU_STG.1 Защищенное хранение журнала аудита.";
        string FAU_STG_2_dependence = "Зависимости: FAU_GEN.1 Генерация данных аудита";
        string FAU_STG_2_1 = "FAU_STG.2.1";
        string FAU_STG_2_1_description = "ФБО должны защищать хранимые записи аудита от несанкционированного удаления.";

        string FAU_STG_2_2 = "FAU_STG.2.2";
        string FAU_STG_2_2_description = "ФБО должны быть способны [выбор (выбрать одно из): предотвращать, выявлять] несанкционированную модификацию хранимых записей аудита в журнале аудита.";

        string FAU_STG_2_3 = "FAU_STG.2.3";
        string FAU_STG_2_3_description = "ФБО должны обеспечивать поддержку [назначение: показатель сохранности записей аудита] при наступлении следующих событий: [выбор: переполнение журнала аудита, сбой, атака].";

        string FAU_STG_3 = "FAU_STG.3 Действия в случае возможной потери данных аудита";
        string FAU_STG_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FAU_STG_3_dependence = "Зависимости: FAU_STG.1 Защищенное хранение журнала аудита";
        string FAU_STG_3_1 = "FAU_STG.3.1";
        string FAU_STG_3_1_description = "ФБО должны выполнять [назначение: действия, которые нужно предпринимать в случае возможного сбоя хранения журнала аудита], если журнал аудита превышает [назначение: принятое ограничение].";

        string FAU_STG_4 = "FAU_STG.4 Предотвращение потери данных аудита";
        string FAU_STG_4_hierarchy = "Иерархический для: FAU_STG.3 Действия в случае возможной потери данных аудита.";
        string FAU_STG_4_dependence = "Зависимости: FAU_STG.1 Защищенное хранение журнала аудита";
        string FAU_STG_4_1 = "FAU_STG.4.1";
        string FAU_STG_4_1_description = "ФБО должны [выбор (выбрать одно из): «игнорировать события, подвергающиеся аудиту», «предотвращать события, подвергающиеся аудиту, исключая предпринимаемые уполномоченным пользователем со специальными правами», «записывать поверх самых старых хранимых записей аудита» и [назначение: другие действия, которые нужно предпринимать в случае возможного сбоя хранения журнала аудита] при переполнении журнала аудита.";

        string FCO_NRO_1 = "FCO_NRO.1 Избирательное доказательство отправления";
        string FCO_NRO_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCO_NRO_1_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FCO_NRO_1_1 = "FCO_NRO.1.1";
        string FCO_NRO_1_1_description = "ФБО должны быть способны генерировать свидетельство отправления передаваемой [назначение: список типов информации] при запросе [выбор: отправитель, получатель [назначение: список третьих лиц]].";

        string FCO_NRO_1_2 = "FCO_NRO.1.2";
        string FCO_NRO_1_2_description = "ФБО должны быть способны связывать [назначение: список атрибутов] отправителя информации и [назначение: список информационных полей] информации, к которой прилагается свидетельство.";

        string FCO_NRO_1_3 = "FCO_NRO.1.3";
        string FCO_NRO_1_3_description = "ФБО должны предоставлять возможность верифицировать свидетельство отправления информации [выбор: отправитель, получатель [назначение: список третьих лиц]] при установленных [назначение: ограничения на свидетельство отправления].";

        string FCO_NRO_2 = "FCO_NRO.2 Принудительное доказательство отправления";
        string FCO_NRO_2_hierarchy = "Иерархический для: FCO_NRO.1 Избирательное доказательство отправления.";
        string FCO_NRO_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FCO_NRO_2_1 = "FCO_NRO.2.1";
        string FCO_NRO_2_1_description = "ФБО должны всегда осуществлять генерацию свидетельства отправления передаваемой [назначение: список типов информации].";

        string FCO_NRO_2_2 = "FCO_NRO.2.2";
        string FCO_NRO_2_2_description = "ФБО должны быть способны связывать [назначение: список атрибутов] отправителя информации и [назначение: список информационных полей] информации, к которой прилагается свидетельство.";

        string FCO_NRO_2_3 = "FCO_NRO.2.3";
        string FCO_NRO_2_3_description = "ФБО должны предоставлять возможность верифицировать свидетельство отправления информации [выбор: отправитель, получатель [назначение: список третьих лиц]] при установленных [назначение: ограничения на свидетельство отправления].";

        string FCO_NRR_1 = "FCO_NRR.1 Избирательное доказательство получения";
        string FCO_NRR_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCO_NRR_1_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FCO_NRR_1_1 = "FCO_NRR.1.1";
        string FCO_NRR_1_1_description = "ФБО должны быть способны генерировать свидетельство получения принятой [назначение: список типов информации] при запросе [выбор: отправитель, получатель [назначение: список третьих лиц]].";

        string FCO_NRR_1_2 = "FCO_NRR.1.2";
        string FCO_NRR_1_2_description = "ФБО должны быть способны связывать [назначение: список атрибутов] получателя информации и [назначение: список информационных полей] информации, к которой прилагается свидетельство.";

        string FCO_NRR_1_3 = "FCO_NRR.1.3";
        string FCO_NRR_1_3_description = "ФБО должны предоставлять возможность верифицировать свидетельство получения информации [выбор: отправитель, получатель [назначение: список третьих лиц]] при установленных [назначение: ограничения на свидетельство отправления].";

        string FCO_NRR_2 = "FCO_NRR.2 Принудительное доказательство получения";
        string FCO_NRR_2_hierarchy = "Иерархический для: FCO_NRR.1 Избирательное доказательство отправления.";
        string FCO_NRR_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FCO_NRR_2_1 = "FCO_NRR.2.1";
        string FCO_NRR_2_1_description = "ФБО должны осуществлять генерацию свидетельства получения принятой [назначение: список типов информации].";

        string FCO_NRR_2_2 = "FCO_NRR.2.2";
        string FCO_NRR_2_2_description = "ФБО должны быть способны связывать [назначение: список атрибутов] получателя информации и [назначение: список информационных полей] информации, к которой прилагается свидетельство.";

        string FCO_NRR_2_3 = "FCO_NRR.2.3";
        string FCO_NRR_2_3_description = "ФБО должны предоставлять возможность верифицировать свидетельство получения информации [выбор: отправитель, получатель [назначение: список третьих лиц]] при установленных [назначение: ограничения на свидетельство отправления].";

        string FCS_CKM_1 = "FCS_CKM.1 Генерация криптографических ключей";
        string FCS_CKM_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCS_CKM_1_dependence = "Зависимости: FCS_CKM.2 Распределение криптографических ключей FCS COP.1 Криптографические операции FCS_CKM.4 Уничтожение криптографических ключей";
        string FCS_CKM_1_1 = "FCS_CKM.1.1";
        string FCS_CKM_1_1_description = "ФБО должны генерировать криптографические ключи в соответствии с определенным алгоритмом [назначение: алгоритм генерации криптографических ключей] и длиной [назначение: длины криптографических ключей], которые отвечают следующему: [назначение: список стандартов].";

        string FCS_CKM_2 = "FCS_CKM.2 Распределение криптографических ключей";
        string FCS_CKM_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCS_CKM_2_dependence = "Зависимости: FDP_ITC.1 Импорт данных пользователя без атрибутов безопасности FDP_ITC.2 Импорт данных пользователя с атрибутами безопасности FCS_CKM.1 Генерация криптографических ключей FCS_CKM.4 Уничтожение криптографических ключей";
        string FCS_CKM_2_1 = "FCS_CKM.2.1";
        string FCS_CKM_2_1_description = "ФБО должны распределять криптографические ключи в соответствии с определенным методом [назначение: метод распределения криптографических ключей], который отвечает следующему: [назначение: список стандартов].";

        string FCS_CKM_3 = "FCS_CKM.3 Доступ к криптографическим ключам";
        string FCS_CKM_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCS_CKM_3_dependence = "Зависимости: FDP_ITC.1 Импорт данных пользователя без атрибутов безопасности FDP_ITC.2 Импорт данных пользователя с атрибутами безопасности FCS_CKM.1 Генерация криптографических ключей FCS_CKM.4 Уничтожение криптографических ключей";
        string FCS_CKM_3_1 = "FCS_CKM.3.1";
        string FCS_CKM_3_1_description = "ФБО должны выполнять [назначение: тип доступа к криптографическим ключам] в соответствии с определенным методом доступа [назначение: метод доступа к криптографическим ключам], который отвечает следующему: [назначение: список стандартов].";

        string FCS_CKM_4 = "FCS_CKM.4 Уничтожение криптографических ключей";
        string FCS_CKM_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCS_CKM_4_dependence = "Зависимости: FDP_ITC.1 Импорт данных пользователя без атрибутов безопасности FDP_ITC.2 Импорт данных пользователя с атрибутами безопасности FCS_CKM.1 Генерация криптографических ключей";
        string FCS_CKM_4_1 = "FCS_CKM.4.1";
        string FCS_CKM_4_1_description = "ФБО должны уничтожать криптографические ключи в соответствии с определенным методом [назначение: метод уничтожения криптографических ключей], который отвечает следующему: [назначение: список стандартов].";

        string FCS_COP_1 = "FCS_COP.1 Криптографические операции";
        string FCS_COP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FCS_COP_1_dependence = "Зависимости: FDP_ITC.1 Импорт данных пользователя без атрибутов безопасности FDP_ITC.2 Импорт данных пользователя с атрибутами безопасности FCS_CKM.1 Генерация криптографических ключей FCS_CKM.4 Уничтожение криптографических ключей";
        string FCS_COP_1_1 = "FCS_COP.1.1";
        string FCS_COP_1_1_description = "ФБО должны выполнять [назначение: список криптографических операций] в соответствии с определенными алгоритмами [назначение: криптографические алгоритмы] и длиной [назначение: длины криптографических ключей], которые отвечают следующему: [назначение: список стандартов].";

        string FDP_ACC_1 = "FDP_ACC.1 Ограниченное управление доступом";
        string FDP_ACC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ACC_1_dependence = "Зависимости: FDP_ACF.1 Управление доступом, основанное на атрибутах безопасности";
        string FDP_ACC_1_1 = "FDP_ACC.1.1";
        string FDP_ACC_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом] для [назначение: список субъектов, объектов и операций субъектов на объектах, на которые распространяется ПФБ].";

        string FDP_ACC_2 = "FDP_ACC.2 Полное управление доступом";
        string FDP_ACC_2_hierarchy = "Иерархический для: FDP_ACC.1 Ограниченное управление доступом";
        string FDP_ACC_2_dependence = "Зависимости: FDP_ACF.1 Управление доступом, основанное на атрибутах безопасности";
        string FDP_ACC_2_1 = "FDP_ACC.2.1";
        string FDP_ACC_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом] для [назначение: список субъектов и объектов] и всех операций субъектов на объектах, на которые распространяется ПФБ.";

        string FDP_ACC_2_2 = "FDP_ACC.2.2";
        string FDP_ACC_2_2_description = "ФБО должны обеспечивать, чтобы на операции любого субъекта из ОДФ на любом объекте из ОДФ распространялась какая-либо ПФБ управления доступом.";

        string FDP_ACF_1 = "FDP_ACF.1 Управление доступом, основанное на атрибутах безопасности";
        string FDP_ACF_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ACF_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом";
        string FDP_ACF_1_1 = "FDP_ACF.1.1";
        string FDP_ACF_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом] к объектам, основываясь на [назначение: список субъектов и объектов, находящихся под управлением указанной ПФБ, и для каждого из них - относящиеся к данной ПФБ атрибуты безопасности или именованные группы атрибутов безопасности].";

        string FDP_ACF_1_2 = "FDP_ACF.1.2";
        string FDP_ACF_1_2_description = "ФБО должны осуществлять следующие правила определения того, разрешена ли операция управляемого субъекта на управляемом объекте: [назначение: правила управления доступом управляемых субъектов к управляемым объектам с использованием управляемых операций на них].";

        string FDP_ACF_1_3 = "FDP_ACF.1.3";
        string FDP_ACF_1_3_description = "ФБО должны явно разрешать доступ субъектов к объектам, основываясь на следующих дополнительных правилах: [назначение: правила, основанные на атрибутах безопасности, которые явно разрешают доступ субъектов к объектам].";

        string FDP_ACF_1_4 = "FDP_ACF.1.4";
        string FDP_ACF_1_4_description = "ФБО должны явно отказывать в доступе субъектов к объектам, основываясь на следующих дополнительных правилах: [назначение: правила, основанные на атрибутах безопасности, которые явно запрещают доступ субъектов к объектам].";

        string FDP_DAU_1 = "FDP_DAU.1 Базовая аутентификация данных";
        string FDP_DAU_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_DAU_1_dependence = "Зависимости: нет зависимостей.";
        string FDP_DAU_1_1 = "FDP_DAU.1.1";
        string FDP_DAU_1_1_description = "ФБО должны предоставлять возможность генерировать свидетельство, которое может быть использовано как гарантия правильности [назначение: список объектов или типов информации].";

        string FDP_DAU_1_2 = "FDP_DAU.1.2";
        string FDP_DAU_1_2_description = "ФБО должны предоставлять [назначение: список субъектов] возможность верифицировать свидетельство правильности указанной информации.";

        string FDP_DAU_2 = "FDP_DAU.2 Аутентификация данных с идентификацией гаранта";
        string FDP_DAU_2_hierarchy = "Иерархический для: FDP_DAU.1 Базовая аутентификация данных";
        string FDP_DAU_2_dependence = "Зависимости: FIA_UID. 1 Выбор момента идентификации";
        string FDP_DAU_2_1 = "FDP_DAU.2.1";
        string FDP_DAU_2_1_description = "ФБО должны предоставлять возможность генерировать свидетельство, которое может быть использовано как гарантия правильности [назначение: список объектов или типов информации].";

        string FDP_DAU_2_2 = "FDP_DAU.2.2";
        string FDP_DAU_2_2_description = "ФБО должны предоставлять [назначение: список субъектов] возможность верифицировать свидетельство правильности указанной информации и идентификатор пользователя, который создал свидетельство.";

        string FDP_ETC_1 = "FDP_ETC.1 Экспорт данных пользователя без атрибутов безопасности";
        string FDP_ETC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ETC_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP IFC.1 Ограниченное управление информационными потоками";
        string FDP_ETC_1_1 = "FDP_ETC.1.1";
        string FDP_ETC_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками] при экспорте данных пользователя, контролируемом ПФБ, за пределы ОДФ.";

        string FDP_ETC_1_2 = "FDP_ETC.1.2";
        string FDP_ETC_1_2_description = "ФБО должны экспортировать данные пользователя без атрибутов безопасности, ассоциированных с данными пользователя.";

        string FDP_ETC_2 = "FDP_ETC.2 Экспорт данных пользователя с атрибутами безопасности";
        string FDP_ETC_2_hierarchy = "Иерархический для: FDP_DAU.1 Базовая аутентификация данных";
        string FDP_ETC_2_dependence = "Зависимости: FIA_UID. 1 Выбор момента идентификации";
        string FDP_ETC_2_1 = "FDP_ETC.2.1";
        string FDP_ETC_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками] при экспорте данных пользователя, контролируемом ПФБ, за пределы ОДФ.";

        string FDP_ETC_2_2 = "FDP_ETC.2.2";
        string FDP_ETC_2_2_description = "ФБО должны экспортировать данные пользователя с атрибутами безопасности, ассоциированными с данными пользователя.";

        string FDP_ETC_2_3 = "FDP_ETC.2.3";
        string FDP_ETC_2_3_description = "ФБО должны обеспечивать, чтобы при экспорте за пределы ОДФ атрибуты безопасности однозначно ассоциировались с экспортируемыми данными пользователя.";

        string FDP_ETC_2_4 = "FDP_ETC.2.4";
        string FDP_ETC_2_4_description = "ФБО должны осуществлять следующие правила при экспорте данных пользователя из ОДФ: [назначение: дополнительные правила управления экспортом информации].";

        string FDP_IFC_1 = "FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_IFC_1_dependence = "Зависимости: FDP_IFF.1 Атрибуты безопасности";
        string FDP_IFC_1_1 = "FDP_IFC.1.1";
        string FDP_IFC_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками] для [назначение: список субъектов, информации и операций перемещения управляемой информации к управляемым субъектам и от них, на которые распространяется ПФБ].";

        string FDP_IFC_2 = "FDP_IFC.2 Полное управление информационными потоками";
        string FDP_IFC_2_hierarchy = "Иерархический для: FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFC_2_dependence = "Зависимости: FDP_IFF.1 Атрибуты безопасности";
        string FDP_IFC_2_1 = "FDP_IFC.2.1";
        string FDP_IFC_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками] для [назначение: список субъектов и информации] и всех операций перемещения управляемой информации к управляемым субъектам и от них, на которые распространяется ПФБ.";

        string FDP_IFC_2_2 = "FDP_IFC.2.2";
        string FDP_IFC_2_2_description = "ФБО должны обеспечивать, чтобы в пределах ОДФ на все операции перемещения управляемой информации к управляемым субъектам и от них распространялась какая-либо ПФБ управления информационными потоками.";

        string FDP_IFF_1 = "FDP_IFF.1 Атрибуты безопасности";
        string FDP_IFF_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_IFF_1_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками FMT_MSA.3 Инициализация статических атрибутов";
        string FDP_IFF_1_1 = "FDP_IFF.1.1";
        string FDP_IFF_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками], основанную на следующих типах атрибутов безопасности субъекта и информации: [назначение: список субъектов и типов информации, находящихся под управлением указанной ПФБ, и для каждого из них - атрибуты безопасности].";

        string FDP_IFF_1_2 = "FDP_IFF.1.2";
        string FDP_IFF_1_2_description = "ФБО должны разрешать информационный поток между управляемым субъектом и управляемой информацией посредством управляемой операции, если выполняются следующие правила: [назначение: основанные на атрибутах безопасности отношения, которые необходимо поддерживать между атрибутами безопасности субъектов и информации (для каждой операции)].";

        string FDP_IFF_1_3 = "FDP_IFF.1.3";
        string FDP_IFF_1_3_description = "ФБО должны осуществлять [назначение: дополнительные правила ПФБ управления информационными потоками].";

        string FDP_IFF_1_4 = "FDP_IFF.1.4";
        string FDP_IFF_1_4_description = "ФБО должны предоставлять следующее [назначение: список дополнительных возможностей ПФБ].";

        string FDP_IFF_1_5 = "FDP_IFF.1.5";
        string FDP_IFF_1_5_description = "ФБО должны явно разрешать информационный поток, основываясь на следующих правилах: [назначение: основанные на атрибутах безопасности правила, которые явно разрешают информационные потоки].";

        string FDP_IFF_1_6 = "FDP_IFF.1.6";
        string FDP_IFF_1_6_description = "ФБО должны явно запрещать информационный поток, основываясь на следующих правилах: [назначение: основанные на атрибутах безопасности правила, которые явно запрещают информационные потоки].";

        string FDP_IFF_2 = "FDP_IFF.2 Иерархические атрибуты безопасности";
        string FDP_IFF_2_hierarchy = "Иерархический для: FDP_IFF.1 Атрибуты безопасности";
        string FDP_IFF_2_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками FMT_MSA.3 Инициализация статических атрибутов";
        string FDP_IFF_2_1 = "FDP_IFF.2.1";
        string FDP_IFF_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками], основанную на следующих типах атрибутов безопасности субъекта и информации: [назначение: список субъектов и типов информации, находящихся под управлением указанной ПФБ, и для каждого из них - атрибуты безопасности].";

        string FDP_IFF_2_2 = "FDP_IFF.2.2";
        string FDP_IFF_2_2_description = "ФБО должны разрешать информационный поток между управляемым субъектом и управляемой информацией посредством управляемой операции, если выполняются следующие правила, основанные на упорядоченных связях между атрибутами безопасности: [назначение: основанные на атрибутах безопасности отношения, которые необходимо поддерживать между атрибутами безопасности субъектов и информации (для каждой операции)].";

        string FDP_IFF_2_3 = "FDP_IFF.2.3";
        string FDP_IFF_2_3_description = "ФБО должны осуществлять [назначение: дополнительные правила ПФБ управления информационными потоками].";

        string FDP_IFF_2_4 = "FDP_IFF.2.4";
        string FDP_IFF_2_4_description = "ФБО должны предоставлять следующее [назначение: список дополнительных возможностей ПФБ].";

        string FDP_IFF_2_5 = "FDP_IFF.2.5";
        string FDP_IFF_2_5_description = "ФБО должны явно разрешать информационный поток, основываясь на следующих правилах: [назначение: основанные на атрибутах безопасности правила, которые явно разрешают информационные потоки].";

        string FDP_IFF_2_6 = "FDP_IFF.2.6";
        string FDP_IFF_2_6_description = "ФБО должны осуществлять следующие отношения для любых двух допустимых атрибутов безопасности управления информационными потоками: a) существует функция упорядочения, которая определяет для двух допустимых атрибутов безопасности, являются ли они равными, или один из них больше другого, или они несравнимы; b) существует такая «наименьшая верхняя грань» в совокупности атрибутов безопасности, что для любых двух допустимых атрибутов безопасности найдется такой допустимый атрибут безопасности, который больше или равен двум допустимым атрибутам безопасности; c) существует такая «наибольшая нижняя грань» в совокупности атрибутов безопасности, что для любых двух допустимых атрибутов безопасности найдется такой допустимый атрибут безопасности, который не больше этих двух допустимых атрибутов безопасности.";

        string FDP_IFF_3 = "FDP_IFF.3 Ограничение неразрешенных информационных потоков";
        string FDP_IFF_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_IFF_3_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFF_3_1 = "FDP_IFF.3.1";
        string FDP_IFF_3_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками], чтобы ограничить интенсивность [назначение: типы неразрешенных информационных потоков] до [назначение: максимальная интенсивность]";

        string FDP_IFF_4 = "FDP_IFF.4 Частичное устранение неразрешенных информационных потоков";
        string FDP_IFF_4_hierarchy = "Иерархический для: FDP_IFF.3 Ограничение неразрешенных информационных потоков";
        string FDP_IFF_4_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFF_4_1 = "FDP_IFF.4.1";
        string FDP_IFF_4_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками], чтобы ограничить интенсивность [назначение: типы неразрешенных информационных потоков] до [назначение: максимальная интенсивность].";

        string FDP_IFF_4_2 = "FDP_IFF.4.2";
        string FDP_IFF_4_2_description = "ФБО должны предотвращать [назначение: типы неразрешенных информационных потоков].";

        string FDP_IFF_5 = "FDP_IFF.5 Отсутствие неразрешенных информационных потоков";
        string FDP_IFF_5_hierarchy = "Иерархический для: FDP_IFF.4 Частичное устранение неразрешенных информационных потоков";
        string FDP_IFF_5_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFF_5_1 = "FDP_IFF.5.1";
        string FDP_IFF_5_1_description = "ФБО должны обеспечивать, чтобы не существовало неразрешенных информационных потоков, способных нарушить [назначение: имя ПФБ управления информационными потоками].";

        string FDP_IFF_6 = "FDP_IFF.6 Мониторинг неразрешенных информационных потоков";
        string FDP_IFF_6_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_IFF_6_dependence = "Зависимости: FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_IFF_6_1 = "FDP_IFF.6.1";
        string FDP_IFF_6_1_description = "ФБО должны осуществлять [назначение: ПФБ управления информационными потоками], чтобы отследить [назначение: типы неразрешенных информационных потоков], когда они превышают [назначение: максимальная интенсивность].";

        string FDP_ITC_1 = "FDP_ITC.1 Импорт данных пользователя без атрибутов безопасности";
        string FDP_ITC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ITC_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FMT_MSA.3 Инициализация статических атрибутов";
        string FDP_ITC_1_1 = "FDP_ITC.1.1";
        string FDP_ITC_1_1_description = "ФБО должны осуществлять [назначение: политики ФБ управления доступом и/или политики ФБ управления информационными потоками] при импорте данных пользователя, контролируемом ПФБ, из-за пределов ОДФ.";

        string FDP_ITC_1_2 = "FDP_ITC.1.2";
        string FDP_ITC_1_2_description = "ФБО должны игнорировать любые атрибуты безопасности, ассоциированные с данными пользователя, при импорте из-за пределов ОДФ.";

        string FDP_ITC_1_3 = "FDP_ITC.1.3";
        string FDP_ITC_1_3_description = "ФБО должны осуществлять следующие правила при импорте данных пользователя, контролируемом ПФБ, из-за пределов ОДФ: [назначение: дополнительные правила управления импортом].";

        string FDP_ITC_2 = "FDP_ITC.2 Импорт данных пользователя с атрибутами безопасности";
        string FDP_ITC_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ITC_2_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FTP_ITC.1 Доверенный канал передачи между ФБО FTP_TRP.1 Доверенный маршрут FPT_TDC.1 Базовая согласованность данных ФБО между ФБО";
        string FDP_ITC_2_1 = "FDP_ITC.2.1";
        string FDP_ITC_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками] при импорте данных пользователя, контролируемом ПФБ, из-за пределов ОДФ.";

        string FDP_ITC_2_2 = "FDP_ITC.2.2";
        string FDP_ITC_2_2_description = "ФБО должны использовать атрибуты безопасности, ассоциированные с импортируемыми данными пользователя.";

        string FDP_ITC_2_3 = "FDP_ITC.2.3";
        string FDP_ITC_2_3_description = "ФБО должны обеспечивать, чтобы используемый протокол предусматривал однозначную ассоциацию между атрибутами безопасности и полученными данными пользователя.";

        string FDP_ITC_2_4 = "FDP_ITC.2.4";
        string FDP_ITC_2_4_description = "ФБО должны обеспечивать, чтобы интерпретация атрибутов безопасности импортируемых данных пользователя была такой, как предусмотрено источником данных пользователя.";

        string FDP_ITC_2_5 = "FDP_ITC.2.5";
        string FDP_ITC_2_5_description = "ФБО должны осуществлять следующие правила при импорте данных пользователя, контролируемом ПФБ, из-за пределов ОДФ: [назначение: дополнительные правила управления импортом].";

        string FDP_ITT_1 = "FDP_ITT.1 Базовая защита внутренней передачи";
        string FDP_ITT_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ITT_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_ITT_1_1 = "FDP_ITT.1.1";
        string FDP_ITT_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потопами], чтобы предотвращать [выбор: раскрытие, модификация, недоступность] данных пользователя при их передаче между физически разделенными частями ОО.";

        string FDP_ITT_2 = "FDP_ITT.2 Разделение передачи по атрибутам";
        string FDP_ITT_2_hierarchy = "Иерархический для: FDP_ITT.1 Базовая защита внутренней передачи";
        string FDP_ITT_2_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_ITT_2_1 = "FDP_ITT.2.1";
        string FDP_ITT_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], чтобы предотвращать [выбор: раскрытие, модификация, недоступность] данных пользователя при их передаче между физически разделенными частями ОО.";

        string FDP_ITT_2_2 = "FDP_ITT.2.2";
        string FDP_ITT_2_2_description = "ФБО должны разделять данные, контролируемые ПФБ, при их передаче между физически разделенными частями ОО, основываясь на значениях следующих атрибутов: [назначение: атрибуты безопасности, которые требуют разделения данных].";

        string FDP_ITT_3 = "FDP_ITT.3 Мониторинг целостности";
        string FDP_ITT_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ITT_3_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FDP_ITT.1 Базовая защита внутренней передачи";
        string FDP_ITT_3_1 = "FDP_ITT.3.1";
        string FDP_ITT_3_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], чтобы контролировать данные пользователя, передаваемые между физически разделенными частями ОО, на наличие следующих ошибок: [назначение: ошибки целостности].";

        string FDP_ITT_3_2 = "FDP_ITT.3.2";
        string FDP_ITT_3_2_description = "При обнаружении ошибки целостности данных ФБО должны [назначение: действия при ошибке целостности].";

        string FDP_ITT_4 = "FDP_ITT.4 Мониторинг целостности по атрибутам";
        string FDP_ITT_4_hierarchy = "Иерархический для: FDP_ITT.3 Мониторинг целостности";
        string FDP_ITT_4_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FDP_ITT.2 Разделение передачи по атрибутам";
        string FDP_ITT_4_1 = "FDP_ITT.4.1";
        string FDP_ITT_4_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], чтобы контролировать данные пользователя, передаваемые между физически разделенными частями ОО, на наличие следующих ошибок: [назначение: ошибки целостности], основываясь на следующих атрибутах: [назначение: атрибуты безопасности, которые требуют разделения каналов передачи].";

        string FDP_ITT_4_2 = "FDP_ITT.4.2";
        string FDP_ITT_4_2_description = "При обнаружении ошибки целостности данных ФБО должны [назначение: действия при ошибке целостности].";

        string FDP_RIP_1 = "FDP_RIP.1 Ограниченная защита остаточной информации";
        string FDP_RIP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_RIP_1_dependence = "Зависимости: нет зависимостей.";
        string FDP_RIP_1_1 = "FDP_RIP.1.1";
        string FDP_RIP_1_1_description = "ФБО должны обеспечивать недоступность любого предыдущего информационного содержания ресурсов при [выбор: распределение ресурса, освобождение ресурса] для следующих объектов: [назначение: список объектов].";

        string FDP_RIP_2 = "FDP_RIP.2 Полная защита остаточной информации";
        string FDP_RIP_2_hierarchy = "Иерархический для: FDP_RIP.1 Ограниченная защита остаточной информации";
        string FDP_RIP_2_dependence = "Зависимости: нет зависимостей.";
        string FDP_RIP_2_1 = "FDP_RIP.2.1";
        string FDP_RIP_2_1_description = "ФБО должны обеспечивать недоступность любого предыдущего информационного содержания ресурсов при [выбор: распределение ресурса, освобождение ресурса] для всех объектов.";

        string FDP_ROL_1 = "FDP_ROL.1 Базовый откат";
        string FDP_ROL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_ROL_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_ROL_1_1 = "FDP_ROL.1.1";
        string FDP_ROL_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], чтобы разрешать откат [назначение: список операций] на [назначение: список объектов].";

        string FDP_ROL_1_2 = "FDP_ROL.1.2";
        string FDP_ROL_1_2_description = "ФБО должны разрешать откат в пределах [назначеиие: ограничение выполнения отката].";

        string FDP_ROL_2 = "FDP_ROL.2 Расширенный откат";
        string FDP_ROL_2_hierarchy = "Иерархический для: FDP_ROL.1 Базовый откат";
        string FDP_ROL_2_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_ROL_2_1 = "FDP_ROL.2.1";
        string FDP_ROL_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], чтобы разрешать откат всех операций на [назначение: список объектов].";

        string FDP_ROL_2_2 = "FDP_ROL.2.2";
        string FDP_ROL_2_2_description = "ФБО должны разрешать откат в пределах [назначение: ограничение выполнения отката].";

        string FDP_SDI_1 = "FDP_SDI.1 Мониторинг целостности хранимых данных";
        string FDP_SDI_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_SDI_1_dependence = "Зависимости: нет зависимостей.";
        string FDP_SDI_1_1 = "FDP_SDI.1.1";
        string FDP_SDI_1_1_description = "ФБО должны контролировать данные пользователя, хранимые в пределах ОДФ, на наличие [назначение: ошибки целостности] для всех объектов, основываясь на следующих атрибутах: [назначение: атрибуты данных пользователя].";

        string FDP_SDI_2 = "FDP_SDI.2 Мониторинг целостности хранимых данных и предпринимаемые действия";
        string FDP_SDI_2_hierarchy = "Иерархический для: FDP_SDI.1 Мониторинг целостности хранимых данных";
        string FDP_SDI_2_dependence = "Зависимости: нет зависимостей.";
        string FDP_SDI_2_1 = "FDP_SDI.2.1";
        string FDP_SDI_2_1_description = "ФБО должны контролировать данные пользователя, хранимые в пределах ОДФ, на наличие [назначение: ошибки целостности] для всех объектов, основываясь на следующих атрибутах: [назначение: атрибуты данных пользователя].";

        string FDP_SDI_2_2 = "FDP_SDI.2.2";
        string FDP_SDI_2_2_description = "При обнаружении ошибки целостности данных ФБО должны [назначение: предпринимаемые действия].";

        string FDP_UCT_1 = "FDP_UCT.1 Базовая конфиденциальность обмена данными";
        string FDP_UCT_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_UCT_1_dependence = "Зависимости: FTP_ITC.1 Доверенный канал передачи между ФБО FTP_TRP.1 Доверенный маршрут FDP ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FDP_UCT_1_1 = "FDP_UCT.1.1";
        string FDP_UCT_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], предоставляющую возможность [выбор: отправление, получение] данных пользователя способом, защищенным от  несанкционированного раскрытия.";

        string FDP_UIT_1 = "FDP_UIT.1 Целостность передаваемых данных";
        string FDP_UIT_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_UIT_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FTP_ITC.1 Доверенный канал передачи между ФБО FTP_TRP.1 Доверенный маршрут";
        string FDP_UIT_1_1 = "FDP_UIT.1.1";
        string FDP_UIT_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], предоставляющую возможность [выбор: отправление, получение] данных пользователя способом, защищенным от следующих ошибок: [выбор: модификация, удаление, вставка, повторение].";

        string FDP_UIT_1_2 = "FDP_UIT.1.2";
        string FDP_UIT_1_2_description = "ФБО должны быть способны определять после получения данных пользователя, произошли ли следующие ошибки: [выбор: модификация, удаление, вставка, повторение].";

        string FDP_UIT_2 = "FDP_UIT.2 Восстановление переданных данных источником";
        string FDP_UIT_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FDP_UIT_2_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FTP_ITC.1 Доверенный канал передачи между ФБО FDP_UIT.1 Целостность передаваемых данных";
        string FDP_UIT_2_1 = "FDP_UIT.2.1";
        string FDP_UIT_2_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], предоставляющую возможность восстановления после [назначение: список потенциально исправляемых ошибок] с помощью источника - доверенного продукта IT.";

        string FDP_UIT_3 = "FDP_UIT.3 Восстановление переданных данных получателем";
        string FDP_UIT_3_hierarchy = "Иерархический для: FDP_UIT.2 Восстановление переданных данных источником";
        string FDP_UIT_3_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FTP_ITC.1 Доверенный канал передачи между ФБО FDP_UIT.1 Целостность передаваемых данных";
        string FDP_UIT_3_1 = "FDP_UIT.3.1";
        string FDP_UIT_3_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом и/или ПФБ управления информационными потоками], предоставляющую возможность восстановления после [назначение: список потенциально исправляемых ошибок] без какой-либо помощи источника - доверенного продукта IT.";

        string FIA_AFL_1 = "FIA_AFL.1 Обработка отказов аутентификации";
        string FIA_AFL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_AFL_1_dependence = "Зависимости: FIA_UAU.1 Выбор момента аутентификации";
        string FIA_AFL_1_1 = "FIA_AFL.1.1";
        string FIA_AFL_1_1_description = "ФБО должны обнаруживать, когда произойдет [выбор: [назначение: положительное целое число], устанавливаемое администратором положительное целое число в пределах [назначение: диапазон допустимых значений]] неуспешных попыток аутентификации, относящихся к [назначение: список событий аутентификации].";

        string FIA_AFL_1_2 = "FIA_AFL.1.2";
        string FIA_AFL_1_2_description = "При достижении или превышении определенного числа неуспешных попыток аутентификации ФБО должны выполнить [назначение: список действий].";

        string FIA_ATD_1 = "FIA_ATD.1 Определение атрибутов пользователя";
        string FIA_ATD_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_ATD_1_dependence = "Зависимости: нет зависимостей.";
        string FIA_ATD_1_1 = "FIA_ATD.1.1";
        string FIA_ATD_1_1_description = "ФБО должны поддерживать для каждого пользователя следующий список атрибутов безопасности: [назначение: список атрибутов безопасности].";

        string FIA_SOS_1 = "FIA_SOS.1 Верификация секретов";
        string FIA_SOS_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_SOS_1_dependence = "Зависимости: нет зависимостей.";
        string FIA_SOS_1_1 = "FIA_SOS.1.1";
        string FIA_SOS_1_1_description = "ФБО должны предоставлять механизм для верификации того, что секреты соответствуют [назначение: определенная метрика качества].";

        string FIA_SOS_2 = "FIA_SOS.2 Генерация секретов ФБО";
        string FIA_SOS_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_SOS_2_dependence = "Зависимости: нет зависимостей.";
        string FIA_SOS_2_1 = "FIA_SOS.2.1";
        string FIA_SOS_2_1_description = "ФБО должны предоставлять механизм генерации секретов, соответствующих [назначение: определенная метрика качества].";

        string FIA_SOS_2_2 = "FIA_SOS.2.2";
        string FIA_SOS_2_2_description = "ФБО должны быть способны использовать генерируемые ими секреты для [назначение: список функций ФБО].";

        string FIA_UAU_1 = "FIA_UAU.1 Выбор момента аутентификации";
        string FIA_UAU_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_1_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FIA_UAU_1_1 = "FIA_UAU.1.1";
        string FIA_UAU_1_1_description = "ФБО должны допускать выполнение [назначение: список действий, выполняемых при посредничестве ФБО] от имени пользователя, прежде чем пользователь аутентифицирован.";

        string FIA_UAU_1_2 = "FIA_UAU.1.2";
        string FIA_UAU_1_2_description = "ФБО должны требовать, чтобы каждый пользователь был успешно аутентифицирован до разрешения любого другого действия, выполняемого при посредничестве ФБО от имени этого пользователя.";

        string FIA_UAU_2 = "FIA_UAU.2 Аутентификация до любых действий пользователя";
        string FIA_UAU_2_hierarchy = "Иерархический для: FIA_UAU.1 Выбор момента аутентификации";
        string FIA_UAU_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FIA_UAU_2_1 = "FIA_UAU.2.1";
        string FIA_UAU_2_1_description = "ФБО должны требовать, чтобы каждый пользователь был успешно аутентифицирован до разрешения любого действия, выполняемого при посредничестве ФБО от имени этого пользователя.";

        string FIA_UAU_3 = "FIA_UAU.3 Аутентификация, защищенная от подделок";
        string FIA_UAU_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_3_dependence = "Зависимости: нет зависимостей.";
        string FIA_UAU_3_1 = "FIA_UAU.3.1";
        string FIA_UAU_3_1_description = "ФБО должны [выбор: обнаруживать, предотвращать] применение любым пользователем ФБО аутентификационных данных, которые были подделаны.";

        string FIA_UAU_3_2 = "FIA_UAU.3.2";
        string FIA_UAU_3_2_description = "ФБО должны [выбор: обнаруживать, предотвращать] применение любым пользователем ФБО аутентификационных данных, которые были скопированы у любого другого пользователя ФБО.";

        string FIA_UAU_4 = "FIA_UAU.4 Механизмы одноразовой аутентификации";
        string FIA_UAU_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_4_dependence = "Зависимости: нет зависимостей.";
        string FIA_UAU_4_1 = "FIA_UAU.4.1";
        string FIA_UAU_4_1_description = "ФБО должны предотвращать повторное применение аутентификационных данных, связанных с [назначение: идентифицированный механизм (механизмы) аутентификации].";

        string FIA_UAU_5 = "FIA_UAU.5 Сочетание механизмов аутентификации";
        string FIA_UAU_5_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_5_dependence = "Зависимости: нет зависимостей.";
        string FIA_UAU_5_1 = "FIA_UAU.5.1";
        string FIA_UAU_5_1_description = "ФБО должны предоставлять [назначение: список сочетаемых механизмов аутентификации] для поддержки аутентификации пользователя.";

        string FIA_UAU_5_2 = "FIA_UAU.5.2";
        string FIA_UAU_5_2_description = "ФБО должны аутентифицировать любой представленный идентификатор пользователя согласно [назначение: правила, описывающие, как сочетание механизмов аутентификации обеспечивает аутентификацию].";

        string FIA_UAU_6 = "FIA_UAU.6 Повторная аутентификация";
        string FIA_UAU_6_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_6_dependence = "Зависимости: нет зависимостей.";
        string FIA_UAU_6_1 = "FIA_UAU.6.1";
        string FIA_UAU_6_1_description = "ФБО должны повторно аутентифицировать пользователя при [назначение: список условий, при которых требуется повторная аутентификация].";

        string FIA_UAU_7 = "FIA_UAU.7 Аутентификация с защищенной обратной связью";
        string FIA_UAU_7_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UAU_7_dependence = "Зависимости: FIA_UAU.1 Выбор момента аутентификации";
        string FIA_UAU_7_1 = "FIA_UAU.7.1";
        string FIA_UAU_7_1_description = "ФБО должны предоставлять пользователю только [назначение: список допустимой информации обратной связи] во время выполнения аутентификации.";

        string FIA_UID_1 = "FIA_UID.1 Выбор момента идентификации";
        string FIA_UID_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_UID_1_dependence = "Зависимости: нет зависимостей.";
        string FIA_UID_1_1 = "FIA_UID.1.1";
        string FIA_UID_1_1_description = "ФБО должны допускать [назначение: список действий, выполняемых при посредничестве ФБО] от имени пользователя прежде, чем он идентифицирован.";

        string FIA_UID_1_2 = "FIA_UID.1.2";
        string FIA_UID_1_2_description = "ФБО должны требовать, чтобы каждый пользователь был успешно идентифицирован до разрешения любого другого действия, выполняемого при посредничестве ФБО от имени этого пользователя.";

        string FIA_UID_2 = "FIA_UID.2 Идентификация до любых действий пользователя";
        string FIA_UID_2_hierarchy = "Иерархический для: FIA_UID.1 Выбор момента идентификации";
        string FIA_UID_2_dependence = "Зависимости: нет зависимостей.";
        string FIA_UID_2_1 = "FIA_UID.2.1";
        string FIA_UID_2_1_description = "ФБО должны требовать, чтобы каждый пользователь был успешно идентифицирован до разрешения любого действия, выполняемого при посредничестве ФБО от имени этого пользователя.";

        string FIA_USB_1 = "FIA_USB.1 Связывание пользователь-субъект";
        string FIA_USB_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FIA_USB_1_dependence = "Зависимости: FIA_ATD. 1 Определение атрибутов пользователя";
        string FIA_USB_1_1 = "FIA_USB.1.1";
        string FIA_USB_1_1_description = "ФБО должны ассоциировать соответствующие атрибуты безопасности пользователя с субъектами, действующими от имени этого пользователя: [назначение: список атрибутов безопасности пользователя].";

        string FIA_USB_1_2 = "FIA_USB.1.2";
        string FIA_USB_1_2_description = "ФБО должны осуществлять следующие правила исходной ассоциации атрибутов безопасности пользователей с субъектами, действующими от имени пользователей: [назначение: правила исходной ассоциации атрибутов].";

        string FIA_USB_1_3 = "FIA_USB.1.3";
        string FIA_USB_1_3_description = "ФБО должны осуществлять следующие правила управления изменениями атрибутов безопасности пользователей, ассоциированными с субъектами, действующими от имени пользователей: [назначение: правила изменения атрибутов].";

        string FMT_MOF_1 = "FMT_MOF.1 Управление режимом выполнения функций безопасности";
        string FMT_MOF_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MOF_1_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности FMT_SMF.1 Спецификация функций управления";
        string FMT_MOF_1_1 = "FMT_MOF.1.1";
        string FMT_MOF_1_1_description = "ФБО должны предоставлять возможность [выбор: определять режим выполнения, отключать, подключатъ, модифицировать режим выполнения] функций [назначение: список функций] только [назначение: уполномоченные идентифицированные роли].";

        string FMT_MSA_1 = "FMT_MSA.1 Управление атрибутами безопасности";
        string FMT_MSA_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MSA_1_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FMT_SMR.1 Роли 6eзопасности FMT_SMF.1 Спецификация функций управления";
        string FMT_MSA_1_1 = "FMT_MSA.1.1";
        string FMT_MSA_1_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом, ПФБ управления информационными потоками], предоставляющую возможность [выбор: изменять значения по умолчанию, запрашивать, модифицировать, удалять [назначение: другие операции] атрибуты безопасности [назначение: список атрибутов безопасности] только [назначение: уполномоченные идентифицированные роли].";

        string FMT_MSA_2 = "FMT_MSA.2 Безопасные значения атрибутов безопасности";
        string FMT_MSA_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MSA_2_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками FMT_SMR.1 Роли 6eзопасности FMT_MSA.1 Управление атрибутами безопасности";
        string FMT_MSA_2_1 = "FMT_MSA.2.1";
        string FMT_MSA_2_1_description = "ФБО должны обеспечивать присвоение атрибутам безопасности только безопасных значений.";

        string FMT_MSA_3 = "FMT_MSA.3 Инициализация статических атрибутов";
        string FMT_MSA_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MSA_3_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности FMT_MSA.1 Управление атрибутами безопасности";
        string FMT_MSA_3_1 = "FMT_MSA.3.1";
        string FMT_MSA_3_1_description = "ФБО должны осуществлять [назначение: ПФБ управления доступом, ПФБ управления информационными потоками], предусматривающую [выбор (выбрать одно из): ограничительные, разрешающие, другие свойства] значений по умолчанию для атрибутов безопасности, которые используются для осуществления ПФБ.";

        string FMT_MSA_3_2 = "FMT_MSA.3.2";
        string FMT_MSA_3_2_description = "ФБО должны позволять [назначение: уполномоченные идентифицированные роли] определять альтернативные начальные значения для отмены значений по умолчанию при создании объекта или информации.";

        string FMT_MSA_4 = "FMT_MSA.4 Наследование значений атрибутов безопасности";
        string FMT_MSA_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MSA_4_dependence = "Зависимости: FDP_ACC.1 Ограниченное управление доступом FDP_IFC.1 Ограниченное управление информационными потоками";
        string FMT_MSA_4_1 = "FMT_MSA.4.1";
        string FMT_MSA_4_1_description = "ФБО должны использовать следующие правила для настройки значения атрибута безопасности: [назначение: правила для настройки значений атрибутов безопасности].";

        string FMT_MTD_1 = "FMT_MTD.1 Управление данными ФБО";
        string FMT_MTD_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MTD_1_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности FMT_SMF.1 Спецификация функций управления";
        string FMT_MTD_1_1 = "FMT_MTD.1.1";
        string FMT_MTD_1_1_description = "ФБО должны предоставлять возможность [выбор: изменение значений по умолчанию, запрос, модификация, удаление, очистка [назначение: другие операции]] следующих данных [назначение: список данных ФБО] только [назначение: уполномоченные идентифицированные роли].";

        string FMT_MTD_2 = "FMT_MTD.2 Управление ограничениями данных ФБО";
        string FMT_MTD_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MTD_2_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности FMT_MTD.1 Управление данными ФБО";
        string FMT_MTD_2_1 = "FMT_MTD.2.1";
        string FMT_MTD_2_1_description = "ФБО должны предоставлять возможность определения ограничений для [назначение: список данных ФБО] только [назначение: уполномоченные идентифицированные роли].";

        string FMT_MTD_2_2 = "FMT_MTD.2.2";
        string FMT_MTD_2_2_description = "ФБО должны предпринимать следующие действия при достижении или превышении данными ФБО установленных выше ограничений: [назначение: предпринимаемые действия].";

        string FMT_MTD_3 = "FMT_MTD.3 Безопасные данные ФБО";
        string FMT_MTD_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_MTD_3_dependence = "Зависимости: FMT_MTD.1 Управление данными ФБО";
        string FMT_MTD_3_1 = "FMT_MTD.3.1";
        string FMT_MTD_3_1_description = "ФБО должны обеспечивать присвоение данным ФБО только безопасных значений [предписание: перечень данных ФБО].";

        string FMT_REV_1 = "FMT_REV.1 Отмена";
        string FMT_REV_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_REV_1_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности";
        string FMT_REV_1_1 = "FMT_REV.1.1";
        string FMT_REV_1_1_description = "ФБО должны предоставлять возможность отмены атрибутов безопасности, ассоциированных с [выбор: пользователи, субъекты, объекты [назначение: другие дополнительные ресурсы]], в пределах ОДФ только [назначение: уполномоченные идентифицированные роли].";

        string FMT_REV_1_2 = "FMT_REV.1.2";
        string FMT_REV_1_2_description = "ФБО должны осуществлять правила [назначение: правила отмены].";

        string FMT_SAE_1 = "FMT_SAE.1 Ограниченная по времени авторизация";
        string FMT_SAE_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_SAE_1_dependence = "Зависимости: FMT_SMR.1 Роли 6eзопасности FPT_STM.1 Надежные метки времени";
        string FMT_SAE_1_1 = "FMT_SAE.1.1";
        string FMT_SAE_1_1_description = "ФБО должны предоставлять возможность назначать срок действия для [назначение: список атрибутов безопасности, для которых предусмотрено установление срока действия] только [назначение: идентифицированные уполномоченные роли].";

        string FMT_SAE_1_2 = "FMT_SAE.1.2";
        string FMT_SAE_1_2_description = "Для каждого из этих атрибутов безопасности ФБО должны быть способны к [назначение: список действий, предпринимаемых для каждого атрибута безопасности] по истечении его срока действия.";

        string FMT_SMF_1 = "FMT_SMF.1 Спецификация функций управления";
        string FMT_SMF_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_SMF_1_dependence = "Зависимости: нет зависимостей.";
        string FMT_SMF_1_1 = "FMT_SMF.1.1";
        string FMT_SMF_1_1_description = "ФБО должны быть способны к выполнению следующих функций управления безопасностью: [назначение: список функций управления безопасностью, предоставляемых ФБО].";

        string FMT_SMR_1 = "FMT_SMR.1 Роли безопасности";
        string FMT_SMR_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_SMR_1_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FMT_SMR_1_1 = "FMT_SMR.1.1";
        string FMT_SMR_1_1_description = "ФБО должны поддерживать следующие роли [назначение: уполномоченные идентифицированные роли].";

        string FMT_SMR_1_2 = "FMT_SMR.1.2";
        string FMT_SMR_1_2_description = "ФБО должны быть способны ассоциировать пользователей с ролями.";

        string FMT_SMR_2 = "FMT_SMR.2 Ограничения на роли безопасности";
        string FMT_SMR_2_hierarchy = "Иерархический для: FMT_SMR.1 Роли безопасности";
        string FMT_SMR_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FMT_SMR_2_1 = "FMT_SMR.2.1";
        string FMT_SMR_2_1_description = "ФБО должны поддерживать следующие роли [назначение: уполномоченные идентифицированные роли].";

        string FMT_SMR_2_2 = "FMT_SMR.2.2";
        string FMT_SMR_2_2_description = "ФБО должны быть способны ассоциировать пользователей с ролями.";

        string FMT_SMR_2_3 = "FMT_SMR.2.3";
        string FMT_SMR_2_3_description = "ФБО должны обеспечивать, чтобы условия [назначение: условия для различных ролей] удовлетворялись.";

        string FMT_SMR_3 = "FMT_SMR.3 Принятие ролей";
        string FMT_SMR_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FMT_SMR_3_dependence = "Зависимости: FMT_SMR.1 Роли безопасности";
        string FMT_SMR_3_1 = "FMT_SMR.3.1";
        string FMT_SMR_3_1_description = "ФБО должны требовать явный запрос для принятия следующих ролей [назначение: список ролей].";

        string FPR_ANO_1 = "FPR_ANO.1 Анонимность";
        string FPR_ANO_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_ANO_1_dependence = "Зависимости: нет зависимостей.";
        string FPR_ANO_1_1 = "FPR_ANO.1.1";
        string FPR_ANO_1_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определить подлинное имя пользователя, связанного с [назначение: список субъектов и/или операций, и/или объектов].";

        string FPR_ANO_2 = "FPR_ANO.2 Анонимность без запроса информации";
        string FPR_ANO_2_hierarchy = "Иерархический для: FPR_ANO.1 Анонимность";
        string FPR_ANO_2_dependence = "Зависимости: нет зависимостей.";
        string FPR_ANO_2_1 = "FPR_ANO.2.1";
        string FPR_ANO_2_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определить подлинное имя пользователя, связанного с [назначение: список субъектов и/или операций, и/или объектов].";

        string FPR_ANO_2_2 = "FPR_ANO.2.2";
        string FPR_ANO_2_2_description = "ФБО должны предоставлять [назначение: список услуг] для [назначение: список субъектов] без запроса какой-либо ссылки на подлинное имя пользователя.";

        string FPR_PSE_1 = "FPR_PSE.1 Псевдонимность";
        string FPR_PSE_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_PSE_1_dependence = "Зависимости: нет зависимостей.";
        string FPR_PSE_1_1 = "FPR_PSE.1.1";
        string FPR_PSE_1_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определять подлинное имя пользователя, связанного с [назначение: список субъектов и/или операций, и/или объектов].";

        string FPR_PSE_1_2 = "FPR_PSE.1.2";
        string FPR_PSE_1_2_description = "ФБО должны быть способны предоставлять [назначение: число псевдонимов] псевдонимов подлинного имени пользователя для [назначение: список субъектов].";

        string FPR_PSE_1_3 = "FPR_PSE.1.3";
        string FPR_PSE_1_3_description = "ФБО должны быть способны [выбор (выбрать одно из): определять псевдоним пользователя, принимать псевдоним от пользователя] и верифицировать его соответствие [назначение: метрика псевдонимов].";

        string FPR_PSE_2 = "FPR_PSE.2 Обратимая псевдонимность";
        string FPR_PSE_2_hierarchy = "Иерархический для: FPR_PSE.1 Псевдонимность";
        string FPR_PSE_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FPR_PSE_2_1 = "FPR_PSE.2.1";
        string FPR_PSE_2_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определять подлинное имя пользователя, связанное с [назначение: список субъектов и/или операций, и/или объектов].";

        string FPR_PSE_2_2 = "FPR_PSE.2.2";
        string FPR_PSE_2_2_description = "ФБО должны быть способны предоставлять [назначение: число псевдонимов] псевдонимов подлинного имени пользователя для [назначение: список субъектов].";

        string FPR_PSE_2_3 = "FPR_PSE.2.3";
        string FPR_PSE_2_3_description = "ФБО должны быть способны [выбор (выбрать одно из): определять псевдоним пользователя, принимать псеедоним от пользователя] и верифицировать его соответствие [назначение: метрика псевдонимов].";

        string FPR_PSE_2_4 = "FPR_PSE.2.4";
        string FPR_PSE_2_4_description = "ФБО должны предоставлять [выбор: уполномоченный пользователь [назначение: список доверенных субъектов]] возможность определять идентификатор пользователя по представленному псевдониму только при выполнении [назначение: список условий].";

        string FPR_PSE_3 = "FPR_PSE.3 Альтернативная псевдонимность";
        string FPR_PSE_3_hierarchy = "Иерархический для: FPR_PSE.1 Псевдонимность";
        string FPR_PSE_3_dependence = "Зависимости: нет зависимостей.";
        string FPR_PSE_3_1 = "FPR_PSE.3.1";
        string FPR_PSE_3_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определять подлинное имя пользователя, связанное с [назначение: список субъектов и/или операций, и/или объектов].";

        string FPR_PSE_3_2 = "FPR_PSE.3.2";
        string FPR_PSE_3_2_description = "ФБО должны быть способны предоставлять [назначение: число псевдонимов] псевдонимов подлинного имени пользователя для [назначение: список субъектов].";

        string FPR_PSE_3_3 = "FPR_PSE.3.3";
        string FPR_PSE_3_3_description = "ФБО должны быть способны [выбор (выбрать одно из): определять псевдоним пользователя, принимать псевдоним от пользователя] и верифицировать его соответствие [назначение: метрика псевдонимов].";

        string FPR_PSE_3_4 = "FPR_PSE.3.4";
        string FPR_PSE_3_4_description = "ФБО должны предоставлять псевдоним для подлинного имени пользователя, который должен быть идентичен псевдониму, предоставленному ранее, при следующих условиях [назначение: список условий]-, в противном случае предоставляемый псевдоним должен быть не связан с предоставленными ранее псевдонимами.";

        string FPR_UNL_1 = "FPR_UNL.1 Невозможность ассоциации";
        string FPR_UNL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_UNL_1_dependence = "Зависимости: нет зависимостей.";
        string FPR_UNL_1_1 = "FPR_UNL.1.1";
        string FPR_UNL_1_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна определять, что [назначение: список операций] [выбор: были инициированы одним и тем же пользователем, связаны следующим образом [назначение: список соотногиений]].";

        string FPR_UNO_1 = "FPR_UNO.1 Скрытность";
        string FPR_UNO_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_UNO_1_dependence = "Зависимости: нет зависимостей.";
        string FPR_UNO_1_1 = "FPR_UNO.1.1";
        string FPR_UNO_1_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна наблюдать следующие операции [назначение: список операций] на [назначение: список объектов], выполняемые [назначение: совокупность защищаемых пользователей и/или субъектов].";

        string FPR_UNO_2 = "FPR_UNO.2 Распределение информации, влияющее на скрытность";
        string FPR_UNO_2_hierarchy = "Иерархический для: FPR_UNO.1 Скрытность";
        string FPR_UNO_2_dependence = "Зависимости: нет зависимостей.";
        string FPR_UNO_2_1 = "FPR_UNO.2.1";
        string FPR_UNO_2_1_description = "ФБО должны обеспечивать, чтобы [назначение: совокупность пользователей и/или субъектов] была не способна наблюдать следующие операции [назначение: список операций] на [назначение: список объектов], выполняемые [назначение: совокупность защищаемых пользователей и/или субъектов].";

        string FPR_UNO_2_2 = "FPR_UNO.2.2";
        string FPR_UNO_2_2_description = "ФБО должны распределять [назначение: информация, связанная со скрытностью] среди различных частей ОО так, чтобы во время существования информации выполнялись следующие условия: [назначение: список условий].";

        string FPR_UNO_3 = "FPR_UNO.3 Скрытность без запроса информации";
        string FPR_UNO_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_UNO_3_dependence = "Зависимости: FPR_UNO.1 Скрытность";
        string FPR_UNO_3_1 = "FPR_UNO.3.1";
        string FPR_UNO_3_1_description = "ФБО должны предоставлять [назначение: список услуг] для [назначение: список субъектов] без запроса каких-либо ссылок на [назначение: информация, связанная с приватностью].";

        string FPR_UNO_4 = "FPR_UNO.4 Открытость для уполномоченного пользователя";
        string FPR_UNO_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPR_UNO_4_dependence = "Зависимости: нет зависимостей.";
        string FPR_UNO_4_1 = "FPR_UNO.4.1";
        string FPR_UNO_4_1_description = "ФБО должны предоставлять [назначение: совокупность уполномоченных пользователей] возможность наблюдать за использованием [назначение: список ресурсов и/или услуг].";

        string FPT_FLS_1 = "FPT_FLS.1 Сбой с сохранением безопасного состояния";
        string FPT_FLS_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_FLS_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_FLS_1_1 = "FPT_FLS.1.1";
        string FPT_FLS_1_1_description = "ФБО должны сохранять безопасное состояние при следующих типах сбоев: [назначение: список типов сбоев ФБО].";

        string FPT_ITA_1 = "FPT_ITA.1 Доступность экспортируемых данных ФБО в пределах заданной метрики";
        string FPT_ITA_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITA_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_ITA_1_1 = "FPT_ITA.1.1";
        string FPT_ITA_1_1_description = "ФБО должны обеспечивать доступность [назначение: список типов данных ФБО] для удаленного доверенного продукта IT в пределах [назначение: заданная метрика доступности] при выполнении следующих условий [назначение: условия обеспечения доступности].";

        string FPT_ITC_1 = "FPT_ITC.1 Конфиденциальность экспортируемых данных ФБО при передаче";
        string FPT_ITC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITC_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_ITC_1_1 = "FPT_ITC.1.1";
        string FPT_ITC_1_1_description = "ФБО должны защищать все данные ФБО, передаваемые от ФБО к удаленному доверенному продукту IT, от несанкционированного раскрытия при передаче.";

        string FPT_ITI_1 = "FPT_ITI.1 Обнаружение модификации экспортируемых данных ФБО";
        string FPT_ITI_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITI_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_ITI_1_1 = "FPT_ITI.1.1";
        string FPT_ITI_1_1_description = "ФБО должны предоставлять возможность обнаруживать модификацию любых данных ФБО при передаче между ФБО и удаленным доверенным продуктом IT в пределах следующей метрики: [назначение: метрика модификации].";

        string FPT_ITI_1_2 = "FPT_ITI.1.2";
        string FPT_ITI_1_2_description = "ФБО должны предоставлять возможность верифицировать целостность всех данных ФБО при их передаче между ФБО и удаленным доверенным продуктом IT и выполнять [назначение: предпринимаемые действия], если модификация обнаружена.";

        string FPT_ITI_2 = "FPT_ITI.2 Обнаружение и исправление модификации экспортируемых данных ФБО";
        string FPT_ITI_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITI_2_dependence = "Зависимости: FPT_ITI.1 Обнаружение модификации экспортируемых данных ФБО";
        string FPT_ITI_2_1 = "FPT_ITI.2.1";
        string FPT_ITI_2_1_description = "ФБО должны предоставлять возможность обнаруживать модификацию любых данных ФБО при передаче между ФБО и удаленным доверенным продуктом IT в пределах следующей метрики: [назначение: метрика модификации].";

        string FPT_ITI_2_2 = "FPT_ITI.2.2";
        string FPT_ITI_2_2_description = "ФБО должны предоставлять возможность верифицировать целостность всех данных ФБО при их передаче между ФБО и удаленным доверенным продуктом IT и выполнять [назначение: предпринимаемые действия], если модификация обнаружена.";

        string FPT_ITI_2_3 = "FPT_ITI.2.3";
        string FPT_ITI_2_3_description = "ФБО должны предоставлять возможность исправлять [назначение: тип модификации] все данные ФБО, передаваемые между ФБО и удаленным доверенным продуктом IT.";

        string FPT_ITT_1 = "FPT_ITT.1 Базовая защита внутренней передачи данных ФБО";
        string FPT_ITT_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITT_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_ITT_1_1 = "FPT_ITT.1.1";
        string FPT_ITT_1_1_description = "ФБО должны защищать свои данные от [выбор: раскрытие, модификация] при их передаче между разделенными частями ОО.";

        string FPT_ITT_2 = "FPT_ITT.2 Разделение данных ФБО при передаче";
        string FPT_ITT_2_hierarchy = "Иерархический для: FPT_ITT.1 Базовая защита внутренней передачи данных ФБО";
        string FPT_ITT_2_dependence = "Зависимости: нет зависимостей.";
        string FPT_ITT_2_1 = "FPT_ITT.2.1";
        string FPT_ITT_2_1_description = "ФБО должны защищать свои данные от [выбор: раскрытие, модификация] при их передаче между разделенными частями ОО.";

        string FPT_ITT_2_2 = "FPT_ITT.2.2";
        string FPT_ITT_2_2_description = "ФБО должны отделять данные пользователя от данных ФБО при их передаче между разделенными частями ОО.";

        string FPT_ITT_3 = "FPT_ITT.3 Мониторинг целостности данных ФБО";
        string FPT_ITT_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_ITT_3_dependence = "Зависимости: FPT_ITT.1 Базовая защита внутренней передачи данных ФБО";
        string FPT_ITT_3_1 = "FPT_ITT.3.1";
        string FPT_ITT_3_1_description = "ФБО должны быть способны обнаруживать [выбор: модификация данных, подмена данных, перестановка данных, удаление данных [назначение: другие ошибки целостности] в данных ФБО, передаваемых между разделенными частями ОО.";

        string FPT_ITT_3_2 = "FPT_ITT.3.2";
        string FPT_ITT_3_2_description = "При обнаружении ошибки целостности данных ФБО должны предпринимать следующие действия: [назначение: выполняемые действия].";

        string FPT_PHP_1 = "FPT_PHP.1 Пассивное обнаружение физического нападения";
        string FPT_PHP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_PHP_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_PHP_1_1 = "FPT_PHP.1.1";
        string FPT_PHP_1_1_description = "ФБО должны обеспечивать однозначное обнаружение физического воздействия, которое может угрожать выполнению ФБО.";

        string FPT_PHP_1_2 = "FPT_PHP.1.2";
        string FPT_PHP_1_2_description = "ФБО должны предоставлять возможность определять, произошло ли физическое воздействие на устройства или элементы, реализующие ФБО.";

        string FPT_PHP_2 = "FPT_PHP.2 Оповещение о физическом нападении";
        string FPT_PHP_2_hierarchy = "Иерархический для: FPT_PHP.1 Пассивное обнаружение физического нападения";
        string FPT_PHP_2_dependence = "Зависимости: FMT_MOF.1 Управление режимом выполнения функций безопасности";
        string FPT_PHP_2_1 = "FPT_PHP.2.1";
        string FPT_PHP_2_1_description = "ФБО должны обеспечивать однозначное обнаружение физического воздействия, которое может угрожать выполнению ФБО.";

        string FPT_PHP_2_2 = "FPT_PHP.2.2";
        string FPT_PHP_2_2_description = "ФБО должны предоставлять возможность определять, произошло ли физическое воздействие на устройства или элементы, реализующие ФБО.";

        string FPT_PHP_2_3 = "FPT_PHP.2.3";
        string FPT_PHP_2_3_description = "Для [назначение: список устройств/элементов, реализующих ФБО, для которых требуется активное обнаружение] ФБО должны постоянно контролировать устройства, элементы и оповещать [назначение: назначенный пользователь или роль], что произошло физическое воздействие на устройства или элементы, реализующие ФБО.";

        string FPT_PHP_3 = "FPT_PHP.3 Противодействие физическому нападению";
        string FPT_PHP_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_PHP_3_dependence = "Зависимости: нет зависимостей.";
        string FPT_PHP_3_1 = "FPT_PHP.3.1";
        string FPT_PHP_3_1_description = "ФБО должны противодействовать [назначение: сценарии физического воздействия] на [назначение: список устройств/элементов, реализующих ФБО], реагируя автоматически так, чтобы предотвращать нарушение ПБО.";

        string FPT_RCV_1 = "FPT_RCV.1 Ручное восстановление";
        string FPT_RCV_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_RCV_1_dependence = "Зависимости: AGD_ADM.1 Руководство администратора";
        string FPT_RCV_1_1 = "FPT_RCV.1.1";
        string FPT_RCV_1_1_description = "После [назначение: список сбоев/прерываний обслуживания] ФБО должны переходить в режим аварийной поддержки, который предоставляет возможность возврата ОО к безопасному состоянию.";

        string FPT_RCV_2 = "FPT_RCV.2 Автоматическое восстановление";
        string FPT_RCV_2_hierarchy = "Иерархический для: FPT_RCV.1 Ручное восстановление";
        string FPT_RCV_2_dependence = "Зависимости: AGD_OPE.1 Руководство администратора";
        string FPT_RCV_2_1 = "FPT_RCV.2.1";
        string FPT_RCV_2_1_description = "Если автоматическое восстановление после [назначение: список сбоев/прерываний обслуживания] невозможно, ФБО должны переходить в режим аварийной поддержки, который предоставляет возможность возврата ОО к безопасному состоянию.";

        string FPT_RCV_2_2 = "FPT_RCV.2.2";
        string FPT_RCV_2_2_description = "Для [назначение: список сбоев/прерываний обслуживания] ФБО должны обеспечивать возврат к безопасному состоянию с использованием автоматических процедур.";

        string FPT_RCV_3 = "FPT_RCV.3 Автоматическое восстановление без недопустимой потери";
        string FPT_RCV_3_hierarchy = "Иерархический для: FPT_RCV.2 Автоматическое восстановление";
        string FPT_RCV_3_dependence = "Зависимости: AGD_OPE.1 Руководство администратора";
        string FPT_RCV_3_1 = "FPT_RCV.3.1";
        string FPT_RCV_3_1_description = "Если автоматическое восстановление после [назначение: список сбоев/прерываний обслуживания] невозможно, ФБО должны переходить в режим аварийной поддержки, который предоставляет возможность возврата ОО к безопасному состоянию.";

        string FPT_RCV_3_2 = "FPT_RCV.3.2";
        string FPT_RCV_3_2_description = "Для [назначение: список сбоев/прерываний обслуживания] ФБО должны обеспечивать возврат ОО безопасному состоянию с использованием автоматических процедур.";

        string FPT_RCV_3_3 = "FPT_RCV.3.3";
        string FPT_RCV_3_3_description = "Функции из числа ФБО, предназначенные для преодоления последствий сбоя или прерывания обслуживания, должны обеспечивать восстановление безопасного начального состояния без превышения [назначение: количественная мера] потери данных ФБО илиобъектов в пределах ОДФ.";

        string FPT_RCV_3_4 = "FPT_RCV.3.4";
        string FPT_RCV_3_4_description = "ФБО должны обеспечивать способность определения, какие объекты могут, а какие не могут быть восстановлены.";

        string FPT_RCV_4 = "FPT_RCV.4 Восстановление функции";
        string FPT_RCV_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_RCV_4_dependence = "Зависимости: нет зависимостей.";
        string FPT_RCV_4_1 = "FPT_RCV.4.1";
        string FPT_RCV_4_1_description = "ФБО должны обеспечивать следующее свойство для [назначение: список ФБ и сценариев сбоев]: ФБ нормально заканчивает работу или, для предусмотренных сценариев сбоев, восстанавливается ее устойчивое и безопасное состояние.";

        string FPT_RPL_1 = "FPT_RPL.1 Обнаружение повторного использования";
        string FPT_RPL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_RPL_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_RPL_1_1 = "FPT_RPL.1.1";
        string FPT_RPL_1_1_description = "ФБО должны обнаруживать повторное использование для следующих сущностей: [назначение: список идентифицированных сущностей].";

        string FPT_RPL_1_2 = "FPT_RPL.1.2";
        string FPT_RPL_1_2_description = "ФБО должны выполнять [назначение: список специальных действий] при обнаружении повторного использования.";

        string FPT_SSP_1 = "FPT_SSP.1 Одностороннее надежное подтверждение";
        string FPT_SSP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_SSP_1_dependence = "Зависимости: FPT_ITT.1 Базовая защита внутренней передачи данных ФБО";
        string FPT_SSP_1_1 = "FPT_SSP.1.1";
        string FPT_SSP_1_1_description = "ФБО должны подтверждать после запроса другой части ФБО получение немодифицированных данных ФБО при передаче.";

        string FPT_SSP_2 = "FPT_SSP.2 Взаимное надежное подтверждение";
        string FPT_SSP_2_hierarchy = "Иерархический для: FPT_SSP.1 Одностороннее надежное подтверждение";
        string FPT_SSP_2_dependence = "Зависимости: FPT_ITT.1 Базовая защита внутренней передачи данных ФБО";
        string FPT_SSP_2_1 = "FPT_SSP.2.1";
        string FPT_SSP_2_1_description = "ФБО должны подтверждать после запроса другой части ФБО получение немодифицированных данных ФБО при передаче.";

        string FPT_SSP_2_2 = "FPT_SSP.2.2";
        string FPT_SSP_2_2_description = "ФБО должны обеспечивать, чтобы соответствующие части ФБО извещались, используя подтверждения о правильном состоянии данных, передаваемых между различными частями ФБО.";

        string FPT_STM_1 = "FPT_STM.1 Надежные метки времени";
        string FPT_STM_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_STM_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_STM_1_1 = "FPT_STM.1.1";
        string FPT_STM_1_1_description = "ФБО должны быть способны предоставлять надежные метки времени для собственного использования.";

        string FPT_TDC_1 = "FPT_TDC.1 Базовая согласованность данных ФБО между ФБО";
        string FPT_TDC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_TDC_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_TDC_1_1 = "FPT_TDC.1.1";
        string FPT_TDC_1_1_description = "ФБО должны обеспечивать способность согласованно интерпретировать [назначение: список типов данных ФБО], совместно используемые ФБО и другим доверенным продуктом ІТ.";

        string FPT_TDC_1_2 = "FPT_TDC.1.2";
        string FPT_TDC_1_2_description = "ФБО должны использовать [назначение: список правил интерпретации, применяемых ФБО] при интерпретации данных ФБО, полученных от другого доверенного продукта ІТ.";

        string FPT_TRC_1 = "FPT_TRC.1 Согласованность дублируемых данных ФБО";
        string FPT_TRC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_TRC_1_dependence = "Зависимости: FPT_ITT.1 Базовая защита внутренней передачи данных ФБО.";
        string FPT_TRC_1_1 = "FPT_TRC.1.1";
        string FPT_TRC_1_1_description = "ФБО должны обеспечивать согласованность данных ФБО при дублировании их в различных частях ОО.";

        string FPT_TRC_1_2 = "FPT_TRC.1.2";
        string FPT_TRC_1_2_description = "Когда части ОО, содержащие дублируемые данные ФБО, разъединены, ФБО должны обеспечивать согласованность дублируемых данных ФБО после восстановления соединения перед обработкой любых запросов к [назначение: список ФБ, зависящих от согласованности дублируемых данных ФБО].";

        string FPT_TST_1 = "FPT_TST.1 Тестирование ФБО";
        string FPT_TST_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FPT_TST_1_dependence = "Зависимости: нет зависимостей.";
        string FPT_TST_1_1 = "FPT_TST.1.1";
        string FPT_TST_1_1_description = "ФБО должны выполнять пакет программ самотестирования [выбор: при запуске, периодически в npotfecce нормального функционирования, по запросу уполномоченного пользователя, при условиях [назначение: условия, при которых следует предусмотреть самотестирование]] для демонстрации правильного выполнения [выбор: [назначение: части ФБО], ФБО].";

        string FPT_TST_1_2 = "FPT_TST.1.2";
        string FPT_TST_1_2_description = "ФБО должны предоставлять уполномоченным пользователям возможность верифицировать целостность [выбор: [назначение: данных частей ФБО], данных ФБО].";

        string FPT_TST_1_3 = "FPT_TST.1.3";
        string FPT_TST_1_3_description = "ФБО должны предоставлять уполномоченным пользователям возможность верифицировать целостность хранимого выполняемого кода ФБО [выбор: [назначение: части ФБО], ФБО].";

        string FRU_FLT_1 = "FRU_FLT.1 Пониженная отказоустойчивость";
        string FRU_FLT_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FRU_FLT_1_dependence = "Зависимости: FPT_FLS.1 Сбой с сохранением безопасного состояния";
        string FRU_FLT_1_1 = "FRU_FLT.1.1";
        string FRU_FLT_1_1_description = "ФБО должны обеспечивать выполнение [назначение: список возможностей ОО], когда происходят следующие сбои: [назначение: список типов сбоев].";

        string FRU_FLT_2 = "FRU_FLT.2 Ограниченная отказоустойчивость";
        string FRU_FLT_2_hierarchy = "Иерархический для: FRU_FLT.1 Пониженная отказоустойчивость";
        string FRU_FLT_2_dependence = "Зависимости: FPT_FLS.1 Сбой с сохранением безопасного состояния";
        string FRU_FLT_2_1 = "FRU_FLT.2.1";
        string FRU_FLT_2_1_description = "ФБО должны обеспечивать выполнение всех возможностей ОО, когда происходят следующие сбои: [назначение: список типов сбоев].";

        string FRU_PRS_1 = "FRU_PRS.1 Ограниченный приоритет обслуживания";
        string FRU_PRS_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FRU_PRS_1_dependence = "Зависимости: нет зависимостей.";
        string FRU_PRS_1_1 = "FRU_PRS.1.1";
        string FRU_PRS_1_1_description = "ФБО должны устанавливать приоритет каждому субъекту в ФБО.";

        string FRU_PRS_1_2 = "FRU_PRS.1.2";
        string FRU_PRS_1_2_description = "ФБО должны обеспечивать доступ к [назначение: управляемые ресурсы] на основе приоритетов, назначенных субъектам.";

        string FRU_PRS_2 = "FRU_PRS.2 Полный приоритет обслуживания";
        string FRU_PRS_2_hierarchy = "Иерархический для: FRU_PRS.1 Ограниченный приоритет обслуживания";
        string FRU_PRS_2_dependence = "Зависимости: нет зависимостей.";
        string FRU_PRS_2_1 = "FRU_PRS.2.1";
        string FRU_PRS_2_1_description = "ФБО должны устанавливать приоритет каждому субъекту в ФБО.";

        string FRU_PRS_2_2 = "FRU_PRS.2.2";
        string FRU_PRS_2_2_description = "ФБО должны обеспечивать доступ ко всем совместно используемым ресурсам на основе приоритетов, назначенных субъектам.";

        string FRU_RSA_1 = "FRU_RSA.1 Максимальные квоты";
        string FRU_RSA_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FRU_RSA_1_dependence = "Зависимости: нет зависимостей.";
        string FRU_RSA_1_1 = "FRU_RSA.1.1";
        string FRU_RSA_1_1_description = "ФБО должны реализовывать максимальные квоты следующих ресурсов: [назначение: управляемые ресурсы], которые [выбор: отдельные пользователи, определенные группы пользователей, субъекты] могут использовать [выбор: одновременно, в течение определенного периода времени].";

        string FRU_RSA_2 = "FRU_RSA.2 Минимальные и максимальные квоты";
        string FRU_RSA_2_hierarchy = "Иерархический для: FRU_RSA.1 Максимальные квоты";
        string FRU_RSA_2_dependence = "Зависимости: нет зависимостей.";
        string FRU_RSA_2_1 = "FRU_RSA.2.1";
        string FRU_RSA_2_1_description = "ФБО должны реализовывать максимальные квоты следующих ресурсов: [назначение: управляемые ресурсы], которые [выбор: отдельные пользователи, определенные группы пользователей, субъекты] могут использовать [выбор: одновременно, в течение определенного периода времени].";

        string FRU_RSA_2_2 = "FRU_RSA.2.2";
        string FRU_RSA_2_2_description = "ФБО должны обеспечивать выделение минимального числа каждого из [назначение: управляемые ресурсы], которые являются доступными для [выбор: отдельный пользователь, определенная группа пользователей, субъекты], чтобы использовать [выбор: одновременно, в течение определенного периода времени].";

        string FTA_LSA_1 = "FTA_LSA.1 Ограничение области выбираемых атрибутов";
        string FTA_LSA_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_LSA_1_dependence = "Зависимости: нет зависимостей.";
        string FTA_LSA_1_1 = "FTA_LSA.1.1";
        string FTA_LSA_1_1_description = "ФБО должны ограничивать область атрибутов безопасности сеанса [назначение: атрибуты безопасности сеанса], основываясь на [назначение: атрибуты].";

        string FTA_MCS_1 = "FTA_MCS.1 Базовое ограничение на параллельные сеансы";
        string FTA_MCS_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_MCS_1_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FTA_MCS_1_1 = "FTA_MCS.1.1";
        string FTA_MCS_1_1_description = "ФБО должны ограничивать максимальное число параллельных сеансов, предоставляемых одному и тому же пользователю.";

        string FTA_MCS_1_2 = "FTA_MCS.1.2";
        string FTA_MCS_1_2_description = "ФБО должны задавать по умолчанию ограничение [назначение: задаваемое по умолчанию число] сеансов пользователя.";

        string FTA_MCS_2 = "FTA_MCS.2 Ограничение на параллельные сеансы по атрибутам пользователя";
        string FTA_MCS_2_hierarchy = "Иерархический для: FTA_MCS.1 Базовое ограничение на параллельные сеансы";
        string FTA_MCS_2_dependence = "Зависимости: FIA_UID.1 Выбор момента идентификации";
        string FTA_MCS_2_1 = "FTA_MCS.2.1";
        string FTA_MCS_2_1_description = "ФБО должны ограничивать максимальное число параллельных сеансов, предоставляемых одному и тому же пользователю, согласно правилам [назначение: правила определения максимального числа параллельных сеансов].";

        string FTA_MCS_2_2 = "FTA_MCS.2.2";
        string FTA_MCS_2_2_description = "ФБО должны задавать по умолчанию ограничение [назначение: задаваемое по умолчанию число] сеансов пользователя.";

        string FTA_SSL_1 = "FTA_SSL.1 Блокирование сеанса, инициируемое ФБО";
        string FTA_SSL_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_SSL_1_dependence = "Зависимости: FIA_UAU.1 Выбор момента аутентификации";
        string FTA_SSL_1_1 = "FTA_SSL.1.1";
        string FTA_SSL_1_1_description = "ФБО должны блокировать интерактивный сеанс после [назначение: интервал времени бездействия пользователя], для чего предпринимаются следующие действия: a) очистка или перезапись устройств отображения, придание их текущему содержанию нечитаемого вида; b) блокирование любых действий по доступу к данным пользователя/устройствам отображения, кроме необходимых для разблокирования сеанса.";

        string FTA_SSL_1_2 = "FTA_SSL.1.2";
        string FTA_SSL_1_2_description = "ФБО должны требовать, чтобы до разблокирования сеанса произошли следующие события: [назначение: события, которые будут происходить].";

        string FTA_SSL_2 = "FTA_SSL.2 Блокирование, инициированное пользователем";
        string FTA_SSL_2_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_SSL_2_dependence = "Зависимости: FIA_UAU.1 Выбор момента аутентификации";
        string FTA_SSL_2_1 = "FTA_SSL.2.1";
        string FTA_SSL_2_1_description = "ФБО должны допускать инициированное пользователем блокирование своего собственного интерактивного сеанса, для чего предпринимаются следующие действия: a) очистка или перезапись устройств отображения, придание их текущему содержанию нечитаемого вида; b) блокирование любых действий по доступу к данным пользователя/устройствам отображения, кроме необходимых для разблокирования сеанса.";

        string FTA_SSL_2_2 = "FTA_SSL.2.2";
        string FTA_SSL_2_2_description = "ФБО должны требовать, чтобы до разблокирования сеанса произошли следующие события; [назначение: события, которые будут происходить].";

        string FTA_SSL_3 = "FTA_SSL.3 Завершение, инициированное ФБО";
        string FTA_SSL_3_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_SSL_3_dependence = "Зависимости: нет зависимостей.";
        string FTA_SSL_3_1 = "FTA_SSL.3.1";
        string FTA_SSL_3_1_description = "ФБО должны завершать интерактивный сеанс после [назначение: интервал времени бездействия пользователя].";

        string FTA_SSL_4 = "FTA_SSL.4 Завершение, инициируемое пользователем";
        string FTA_SSL_4_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_SSL_4_dependence = "Зависимости: нет зависимостей.";
        string FTA_SSL_4_1 = "FTA_SSL.4.1";
        string FTA_SSL_4_1_description = "ФБО должно позволять завершение, инициируемое пользователем, интерактивного сеанса пользователя.";

        string FTA_TAB_1 = "FTA_TAB.1 Предупреждения по умолчанию перед предоставлением доступа к ОО";
        string FTA_TAB_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_TAB_1_dependence = "Зависимости: нет зависимостей.";
        string FTA_TAB_1_1 = "FTA_TAB.1.1";
        string FTA_TAB_1_1_description = "Перед открытием сеанса пользователя ФБО должны отображать предупреждающее сообщение о несанкционированном использовании ОО.";

        string FTA_TAH_1 = "FTA_TAH.1 История доступа к ОО";
        string FTA_TAH_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_TAH_1_dependence = "Зависимости: нет зависимостей.";
        string FTA_TAH_1_1 = "FTA_TAH.1.1";
        string FTA_TAH_1_1_description = "При успешном открытии сеанса ФБО должны отображать [выбор: дата, время, метод, расположение] последнего успешного открытия сеанса от имени этого пользователя.";

        string FTA_TAH_1_2 = "FTA_TAH.1.2";
        string FTA_TAH_1_2_description = "При успешном открытии сеанса ФБО должны отображать [выбор: дата, время, метод, расположение] последней неуспешной попытки открытия сеанса и число неуспешных попыток со времени последнего успешного открытия сеанса.";

        string FTA_TAH_1_3 = "FTA_TAH.1.3";
        string FTA_TAH_1_3_description = "ФБО не должны удалять информацию об истории доступа из интерфейса пользователя без предоставления пользователю возможности просмотреть ее.";

        string FTA_TSE_1 = "FTA_TSE.1 Открытие сеанса с ОО";
        string FTA_TSE_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTA_TSE_1_dependence = "Зависимости: нет зависимостей.";
        string FTA_TSE_1_1 = "FTA_TSE.1.1";
        string FTA_TSE_1_1_description = "ФБО должны быть способны отказывать в открытии сеанса, основываясь на [назначение: атрибуты].";

        string FTP_ITC_1 = "FTP_ITC.1 Доверенный канал передачи между ФБО";
        string FTP_ITC_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTP_ITC_1_dependence = "Зависимости: нет зависимостей.";
        string FTP_ITC_1_1 = "FTP_ITC.1.1";
        string FTP_ITC_1_1_description = "ФБО должны предоставлять канал связи между ними и удаленным доверенным продуктом IT, который логически отличим от других каналов связи и обеспечивает уверенную идентификацию его конечных сторон, а также защиту данных канала от модификации или раскрытия.";

        string FTP_ITC_1_2 = "FTP_ITC.1.2";
        string FTP_ITC_1_2_description = "ФБО должны позволять [выбор: ФБО, удаленный доверенный продукт IT] инициировать связь через доверенный канал.";

        string FTP_ITC_1_3 = "FTP_ITC.1.3";
        string FTP_ITC_1_3_description = "ФБО должны инициировать связь через доверенный канал для выполнения [назначение: список функций, для которых требуется доверенный канал].";

        string FTP_TRP_1 = "FTP_TRP.1 Доверенный маршрут";
        string FTP_TRP_1_hierarchy = "Иерархический для: нет подчиненных компонентов.";
        string FTP_TRP_1_dependence = "Зависимости: нет зависимостей.";
        string FTP_TRP_1_1 = "FTP_TRP.1.1";
        string FTP_TRP_1_1_description = "ФБО должны предоставлять маршрут связи между собой и [выбор: удаленный, локальный] пользователем, который логически отличим от других маршрутов связи и обеспечивает уверенную идентификацию его начала и конца, а также защиту передаваемых данных от модификации или раскрытия.";

        string FTP_TRP_1_2 = "FTP_TRP.1.2";
        string FTP_TRP_1_2_description = "ФБО должны позволить [выбор: ФБО, локальные пользователи, удаленные пользователи] инициировать связь через доверенный маршрут.";

        string FTP_TRP_1_3 = "FTP_TRP.1.3";
        string FTP_TRP_1_3_description = "ФБО должны требовать использования доверенного маршрута для [выбор: начальная аутентификация пользователя [назначение: другие услуги, для которых требуется доверенный маршрут]].";



        public Form1()
        {
            InitializeComponent();
            treeViewControl.AfterSelect += treeView1_AfterSelect;
            checkedListBox1.SelectedIndexChanged += checkedListBox1_SelectedIndexChanged;
            Form1_Load();
        }

        private void button1_Click(object sender, EventArgs e)
        {
            //initialize word object
            document = new Spire.Doc.Document();
            document.LoadFromFile(samplePath);
            //get strings to replace
            Dictionary<string, string> dictReplace_1 = GetReplaceDictionary_1();
            //Replace text
            foreach (KeyValuePair<string, string> kvp in dictReplace_1)
            {
                document.Replace(kvp.Key, kvp.Value, true, true);
            }

            /*  Dictionary<string, string> dictReplace_2 = GetReplaceDictionary_2();
              //Replace text
              foreach (KeyValuePair<string, string> kvp in dictReplace_2)
              {
                  document.Replace(kvp.Key, kvp.Value, true, true);
              }*/

            /*string s1 = "#F";
            string s2 = "#";
            //Regex regEx = new Regex("(?<=(" + s1 +"))[.\\s\\S]*?(?=(" + s2 + "))");
            Regex regEx = new Regex(@"(?<=#F)[.\s\S]*(?=#)");
            //Get the selections between "begin" and "end"
            TextSelection[] selections = document.FindAllPattern(regEx);
            if (selections != null)
            {
                TextRange range = selections[0].GetAsOneRange();
                //Replace with new text
                range.Text = "this is replace content";
            }*/
            document.FindAllString("#FAU_ARP_1#", false, true);
            document.FindAllString("#FAU_ARP_1_1#", false, true);
            document.FindAllString("#FAU_GEN_1#", false, true);
            document.FindAllString("#FAU_GEN_1_1#", false, true);
            document.FindAllString("#FAU_GEN_1_2#", false, true);
            document.FindAllString("#FAU_GEN_2#", false, true);
            document.FindAllString("#FAU_GEN_2_1#", false, true);
            document.FindAllString("#FAU_SAA_1#", false, true);
            document.FindAllString("#FAU_SAA_1_1#", false, true);
            document.FindAllString("#FAU_SAA_1_2#", false, true);
            document.FindAllString("#FAU_SAA_2#", false, true);
            document.FindAllString("#FAU_SAA_2_1#", false, true);
            document.FindAllString("#FAU_SAA_2_2#", false, true);
            document.FindAllString("#FAU_SAA_2_3#", false, true);
            document.FindAllString("#FAU_SAA_3#", false, true);
            document.FindAllString("#FAU_SAA_3_1#", false, true);
            document.FindAllString("#FAU_SAA_3_2#", false, true);
            document.FindAllString("#FAU_SAA_3_3#", false, true);
            document.FindAllString("#FAU_SAA_4#", false, true);
            document.FindAllString("#FAU_SAA_4_1#", false, true);
            document.FindAllString("#FAU_SAA_4_2#", false, true);
            document.FindAllString("#FAU_SAA_4_3#", false, true);
            document.FindAllString("#FAU_SAR_1#", false, true);
            document.FindAllString("#FAU_SAR_1_1#", false, true);
            document.FindAllString("#FAU_SAR_1_2#", false, true);
            document.FindAllString("#FAU_SAR_2#", false, true);
            document.FindAllString("#FAU_SAR_2_1#", false, true);
            document.FindAllString("#FAU_SAR_3#", false, true);
            document.FindAllString("#FAU_SAR_3_1#", false, true);
            document.FindAllString("#FAU_SEL_1#", false, true);
            document.FindAllString("#FAU_SEL_1_1#", false, true);
            document.FindAllString("#FAU_STG_1#", false, true);
            document.FindAllString("#FAU_STG_1_1#", false, true);
            document.FindAllString("#FAU_STG_1_2#", false, true);
            document.FindAllString("#FAU_STG_2#", false, true);
            document.FindAllString("#FAU_STG_2_1#", false, true);
            document.FindAllString("#FAU_STG_2_2#", false, true);
            document.FindAllString("#FAU_STG_2_3#", false, true);
            document.FindAllString("#FAU_STG_3#", false, true);
            document.FindAllString("#FAU_STG_3_1#", false, true);
            document.FindAllString("#FAU_STG_4#", false, true);
            document.FindAllString("#FAU_STG_4_1#", false, true);
            document.FindAllString("#FCO_NRO_1#", false, true);
            document.FindAllString("#FCO_NRO_1_1#", false, true);
            document.FindAllString("#FCO_NRO_1_2#", false, true);
            document.FindAllString("#FCO_NRO_1_3#", false, true);
            document.FindAllString("#FCO_NRO_2#", false, true);
            document.FindAllString("#FCO_NRO_2_1#", false, true);
            document.FindAllString("#FCO_NRO_2_2#", false, true);
            document.FindAllString("#FCO_NRO_2_3#", false, true);
            document.FindAllString("#FCO_NRR_1#", false, true);
            document.FindAllString("#FCO_NRR_1_1#", false, true);
            document.FindAllString("#FCO_NRR_1_2#", false, true);
            document.FindAllString("#FCO_NRR_1_3#", false, true);
            document.FindAllString("#FCO_NRR_2#", false, true);
            document.FindAllString("#FCO_NRR_2_1#", false, true);
            document.FindAllString("#FCO_NRR_2_2#", false, true);
            document.FindAllString("#FCO_NRR_2_3#", false, true);
            document.FindAllString("#FCS_CKM_1#", false, true);
            document.FindAllString("#FCS_CKM_1_1#", false, true);
            document.FindAllString("#FCS_CKM_2#", false, true);
            document.FindAllString("#FCS_CKM_2_1#", false, true);
            document.FindAllString("#FCS_CKM_3#", false, true);
            document.FindAllString("#FCS_CKM_3_1#", false, true);
            document.FindAllString("#FCS_CKM_4#", false, true);
            document.FindAllString("#FCS_CKM_4_1#", false, true);
            document.FindAllString("#FCS_COP_1#", false, true);
            document.FindAllString("#FCS_COP_1_1#", false, true);
            document.FindAllString("#FDP_ACC_1#", false, true);
            document.FindAllString("#FDP_ACC_1_1#", false, true);
            document.FindAllString("#FDP_ACC_2#", false, true);
            document.FindAllString("#FDP_ACC_2_1#", false, true);
            document.FindAllString("#FDP_ACC_2_2#", false, true);
            document.FindAllString("#FDP_ACF_1#", false, true);
            document.FindAllString("#FDP_ACF_1_1#", false, true);
            document.FindAllString("#FDP_ACF_1_2#", false, true);
            document.FindAllString("#FDP_ACF_1_3#", false, true);
            document.FindAllString("#FDP_ACF_1_4#", false, true);
            document.FindAllString("#FDP_DAU_1#", false, true);
            document.FindAllString("#FDP_DAU_1_1#", false, true);
            document.FindAllString("#FDP_DAU_1_2#", false, true);
            document.FindAllString("#FDP_DAU_2#", false, true);
            document.FindAllString("#FDP_DAU_2_1#", false, true);
            document.FindAllString("#FDP_DAU_2_2#", false, true);
            document.FindAllString("#FDP_ETC_1#", false, true);
            document.FindAllString("#FDP_ETC_1_1#", false, true);
            document.FindAllString("#FDP_ETC_1_2#", false, true);
            document.FindAllString("#FDP_ETC_2#", false, true);
            document.FindAllString("#FDP_ETC_2_1#", false, true);
            document.FindAllString("#FDP_ETC_2_2#", false, true);
            document.FindAllString("#FDP_ETC_2_3#", false, true);
            document.FindAllString("#FDP_ETC_2_4#", false, true);
            document.FindAllString("#FDP_IFC_1#", false, true);
            document.FindAllString("#FDP_IFC_1_1#", false, true);
            document.FindAllString("#FDP_IFC_2#", false, true);
            document.FindAllString("#FDP_IFC_2_1#", false, true);
            document.FindAllString("#FDP_IFC_2_2#", false, true);
            document.FindAllString("#FDP_IFF_1#", false, true);
            document.FindAllString("#FDP_IFF_1_1#", false, true);
            document.FindAllString("#FDP_IFF_1_2#", false, true);
            document.FindAllString("#FDP_IFF_1_3#", false, true);
            document.FindAllString("#FDP_IFF_1_4#", false, true);
            document.FindAllString("#FDP_IFF_1_5#", false, true);
            document.FindAllString("#FDP_IFF_1_6#", false, true);
            document.FindAllString("#FDP_IFF_2#", false, true);
            document.FindAllString("#FDP_IFF_2_1#", false, true);
            document.FindAllString("#FDP_IFF_2_2#", false, true);
            document.FindAllString("#FDP_IFF_2_3#", false, true);
            document.FindAllString("#FDP_IFF_2_4#", false, true);
            document.FindAllString("#FDP_IFF_2_5#", false, true);
            document.FindAllString("#FDP_IFF_2_6#", false, true);
            document.FindAllString("#FDP_IFF_3#", false, true);
            document.FindAllString("#FDP_IFF_3_1#", false, true);
            document.FindAllString("#FDP_IFF_4#", false, true);
            document.FindAllString("#FDP_IFF_4_1#", false, true);
            document.FindAllString("#FDP_IFF_4_2#", false, true);
            document.FindAllString("#FDP_IFF_5#", false, true);
            document.FindAllString("#FDP_IFF_5_1#", false, true);
            document.FindAllString("#FDP_IFF_6#", false, true);
            document.FindAllString("#FDP_IFF_6_1#", false, true);
            document.FindAllString("#FDP_ITC_1#", false, true);
            document.FindAllString("#FDP_ITC_1_1#", false, true);
            document.FindAllString("#FDP_ITC_1_2#", false, true);
            document.FindAllString("#FDP_ITC_1_3#", false, true);
            document.FindAllString("#FDP_ITC_2#", false, true);
            document.FindAllString("#FDP_ITC_2_1#", false, true);
            document.FindAllString("#FDP_ITC_2_2#", false, true);
            document.FindAllString("#FDP_ITC_2_3#", false, true);
            document.FindAllString("#FDP_ITC_2_4#", false, true);
            document.FindAllString("#FDP_ITC_2_5#", false, true);
            document.FindAllString("#FDP_ITT_1#", false, true);
            document.FindAllString("#FDP_ITT_1_1#", false, true);
            document.FindAllString("#FDP_ITT_2#", false, true);
            document.FindAllString("#FDP_ITT_2_1#", false, true);
            document.FindAllString("#FDP_ITT_2_2#", false, true);
            document.FindAllString("#FDP_ITT_3#", false, true);
            document.FindAllString("#FDP_ITT_3_1#", false, true);
            document.FindAllString("#FDP_ITT_3_2#", false, true);
            document.FindAllString("#FDP_ITT_4#", false, true);
            document.FindAllString("#FDP_ITT_4_1#", false, true);
            document.FindAllString("#FDP_ITT_4_2#", false, true);
            document.FindAllString("#FDP_RIP_1#", false, true);
            document.FindAllString("#FDP_RIP_1_1#", false, true);
            document.FindAllString("#FDP_RIP_2#", false, true);
            document.FindAllString("#FDP_RIP_2_1#", false, true);
            document.FindAllString("#FDP_ROL_1#", false, true);
            document.FindAllString("#FDP_ROL_1_1#", false, true);
            document.FindAllString("#FDP_ROL_2#", false, true);
            document.FindAllString("#FDP_ROL_2_1#", false, true);
            document.FindAllString("#FDP_SDI_1#", false, true);
            document.FindAllString("#FDP_SDI_1_1#", false, true);
            document.FindAllString("#FDP_SDI_2#", false, true);
            document.FindAllString("#FDP_SDI_2_1#", false, true);
            document.FindAllString("#FDP_SDI_2_2#", false, true);
            document.FindAllString("#FDP_UCT_1#", false, true);
            document.FindAllString("#FDP_UCT_1_1#", false, true);
            document.FindAllString("#FDP_UIT_1#", false, true);
            document.FindAllString("#FDP_UIT_1_1#", false, true);
            document.FindAllString("#FDP_UIT_1_2#", false, true);
            document.FindAllString("#FDP_UIT_2#", false, true);
            document.FindAllString("#FDP_UIT_2_1#", false, true);
            document.FindAllString("#FDP_UIT_3#", false, true);
            document.FindAllString("#FDP_UIT_3_1#", false, true);
            document.FindAllString("#FIA_AFL_1#", false, true);
            document.FindAllString("#FIA_AFL_1_1#", false, true);
            document.FindAllString("#FIA_AFL_1_2#", false, true);
            document.FindAllString("#FIA_ATD_1#", false, true);
            document.FindAllString("#FIA_ATD_1_1#", false, true);
            document.FindAllString("#FIA_SOS_1#", false, true);
            document.FindAllString("#FIA_SOS_1_1#", false, true);
            document.FindAllString("#FIA_SOS_2#", false, true);
            document.FindAllString("#FIA_SOS_2_1#", false, true);
            document.FindAllString("#FIA_SOS_2_2#", false, true);
            document.FindAllString("#FIA_UAU_1#", false, true);
            document.FindAllString("#FIA_UAU_1_1#", false, true);
            document.FindAllString("#FIA_UAU_1_2#", false, true);
            document.FindAllString("#FIA_UAU_2#", false, true);
            document.FindAllString("#FIA_UAU_2_1#", false, true);
            document.FindAllString("#FIA_UAU_3#", false, true);
            document.FindAllString("#FIA_UAU_3_1#", false, true);
            document.FindAllString("#FIA_UAU_3_2#", false, true);
            document.FindAllString("#FIA_UAU_4#", false, true);
            document.FindAllString("#FIA_UAU_4_1#", false, true);
            document.FindAllString("#FIA_UAU_5#", false, true);
            document.FindAllString("#FIA_UAU_5_1#", false, true);
            document.FindAllString("#FIA_UAU_5_2#", false, true);
            document.FindAllString("#FIA_UAU_6#", false, true);
            document.FindAllString("#FIA_UAU_6_1#", false, true);
            document.FindAllString("#FIA_UAU_7#", false, true);
            document.FindAllString("#FIA_UAU_7_1#", false, true);
            document.FindAllString("#FIA_UID_1#", false, true);
            document.FindAllString("#FIA_UID_1_1#", false, true);
            document.FindAllString("#FIA_UID_1_2#", false, true);
            document.FindAllString("#FIA_UID_2#", false, true);
            document.FindAllString("#FIA_UID_2_1#", false, true);
            document.FindAllString("#FIA_USB_1#", false, true);
            document.FindAllString("#FIA_USB_1_1#", false, true);
            document.FindAllString("#FIA_USB_1_2#", false, true);
            document.FindAllString("#FIA_USB_1_3#", false, true);
            document.FindAllString("#FMT_MOF_1#", false, true);
            document.FindAllString("#FMT_MOF_1_1#", false, true);
            document.FindAllString("#FMT_MSA_1#", false, true);
            document.FindAllString("#FMT_MSA_1_1#", false, true);
            document.FindAllString("#FMT_MSA_2#", false, true);
            document.FindAllString("#FMT_MSA_2_1#", false, true);
            document.FindAllString("#FMT_MSA_3#", false, true);
            document.FindAllString("#FMT_MSA_3_1#", false, true);
            document.FindAllString("#FMT_MSA_3_2#", false, true);
            document.FindAllString("#FMT_MSA_4#", false, true);
            document.FindAllString("#FMT_MSA_4_1#", false, true);
            document.FindAllString("#FMT_MTD_1#", false, true);
            document.FindAllString("#FMT_MTD_1_1#", false, true);
            document.FindAllString("#FMT_MTD_2#", false, true);
            document.FindAllString("#FMT_MTD_2_1#", false, true);
            document.FindAllString("#FMT_MTD_2_2#", false, true);
            document.FindAllString("#FMT_MTD_3#", false, true);
            document.FindAllString("#FMT_MTD_3_1#", false, true);
            document.FindAllString("#FMT_REV_1#", false, true);
            document.FindAllString("#FMT_REV_1_1#", false, true);
            document.FindAllString("#FMT_REV_1_2#", false, true);
            document.FindAllString("#FMT_SAE_1#", false, true);
            document.FindAllString("#FMT_SAE_1_1#", false, true);
            document.FindAllString("#FMT_SAE_1_2#", false, true);
            document.FindAllString("#FMT_SMF_1#", false, true);
            document.FindAllString("#FMT_SMF_1_1#", false, true);
            document.FindAllString("#FMT_SMR_1#", false, true);
            document.FindAllString("#FMT_SMR_1_1#", false, true);
            document.FindAllString("#FMT_SMR_1_2#", false, true);
            document.FindAllString("#FMT_SMR_2#", false, true);
            document.FindAllString("#FMT_SMR_2_1#", false, true);
            document.FindAllString("#FMT_SMR_2_2#", false, true);
            document.FindAllString("#FMT_SMR_2_3#", false, true);
            document.FindAllString("#FMT_SMR_3#", false, true);
            document.FindAllString("#FMT_SMR_3_1#", false, true);
            document.FindAllString("#FPR_ANO_1#", false, true);
            document.FindAllString("#FPR_ANO_1_1#", false, true);
            document.FindAllString("#FPR_ANO_2#", false, true);
            document.FindAllString("#FPR_ANO_2_1#", false, true);
            document.FindAllString("#FPR_ANO_2_2#", false, true);
            document.FindAllString("#FPR_PSE_1#", false, true);
            document.FindAllString("#FPR_PSE_1_1#", false, true);
            document.FindAllString("#FPR_PSE_1_2#", false, true);
            document.FindAllString("#FPR_PSE_1_3#", false, true);
            document.FindAllString("#FPR_PSE_2#", false, true);
            document.FindAllString("#FPR_PSE_2_1#", false, true);
            document.FindAllString("#FPR_PSE_2_2#", false, true);
            document.FindAllString("#FPR_PSE_2_3#", false, true);
            document.FindAllString("#FPR_PSE_2_4#", false, true);
            document.FindAllString("#FPR_PSE_3#", false, true);
            document.FindAllString("#FPR_PSE_3_1#", false, true);
            document.FindAllString("#FPR_PSE_3_2#", false, true);
            document.FindAllString("#FPR_PSE_3_3#", false, true);
            document.FindAllString("#FPR_PSE_3_4#", false, true);
            document.FindAllString("#FPR_UNL_1#", false, true);
            document.FindAllString("#FPR_UNL_1_1#", false, true);
            document.FindAllString("#FPR_UNO_1#", false, true);
            document.FindAllString("#FPR_UNO_1_1#", false, true);
            document.FindAllString("#FPR_UNO_2#", false, true);
            document.FindAllString("#FPR_UNO_2_1#", false, true);
            document.FindAllString("#FPR_UNO_2_2#", false, true);
            document.FindAllString("#FPR_UNO_3#", false, true);
            document.FindAllString("#FPR_UNO_3_1#", false, true);
            document.FindAllString("#FPR_UNO_4#", false, true);
            document.FindAllString("#FPR_UNO_4_1#", false, true);
            document.FindAllString("#FPT_FLS_1#", false, true);
            document.FindAllString("#FPT_FLS_1_1#", false, true);
            document.FindAllString("#FPT_ITA_1#", false, true);
            document.FindAllString("#FPT_ITA_1_1#", false, true);
            document.FindAllString("#FPT_ITC_1#", false, true);
            document.FindAllString("#FPT_ITC_1_1#", false, true);
            document.FindAllString("#FPT_ITI_1#", false, true);
            document.FindAllString("#FPT_ITI_1_1#", false, true);
            document.FindAllString("#FPT_ITI_1_2#", false, true);
            document.FindAllString("#FPT_ITI_2#", false, true);
            document.FindAllString("#FPT_ITI_2_1#", false, true);
            document.FindAllString("#FPT_ITI_2_2#", false, true);
            document.FindAllString("#FPT_ITI_2_3#", false, true);
            document.FindAllString("#FPT_ITT_1#", false, true);
            document.FindAllString("#FPT_ITT_1_1#", false, true);
            document.FindAllString("#FPT_ITT_2#", false, true);
            document.FindAllString("#FPT_ITT_2_1#", false, true);
            document.FindAllString("#FPT_ITT_2_2#", false, true);
            document.FindAllString("#FPT_ITT_3#", false, true);
            document.FindAllString("#FPT_ITT_3_1#", false, true);
            document.FindAllString("#FPT_ITT_3_2#", false, true);
            document.FindAllString("#FPT_PHP_1#", false, true);
            document.FindAllString("#FPT_PHP_1_1#", false, true);
            document.FindAllString("#FPT_PHP_1_2#", false, true);
            document.FindAllString("#FPT_PHP_2#", false, true);
            document.FindAllString("#FPT_PHP_2_1#", false, true);
            document.FindAllString("#FPT_PHP_2_2#", false, true);
            document.FindAllString("#FPT_PHP_2_3#", false, true);
            document.FindAllString("#FPT_PHP_3#", false, true);
            document.FindAllString("#FPT_PHP_3_1#", false, true);
            document.FindAllString("#FPT_RCV_1#", false, true);
            document.FindAllString("#FPT_RCV_1_1#", false, true);
            document.FindAllString("#FPT_RCV_2#", false, true);
            document.FindAllString("#FPT_RCV_2_1#", false, true);
            document.FindAllString("#FPT_RCV_2_2#", false, true);
            document.FindAllString("#FPT_RCV_3#", false, true);
            document.FindAllString("#FPT_RCV_3_1#", false, true);
            document.FindAllString("#FPT_RCV_3_2#", false, true);
            document.FindAllString("#FPT_RCV_3_3#", false, true);
            document.FindAllString("#FPT_RCV_3_4#", false, true);
            document.FindAllString("#FPT_RCV_4#", false, true);
            document.FindAllString("#FPT_RCV_4_1#", false, true);
            document.FindAllString("#FPT_RPL_1#", false, true);
            document.FindAllString("#FPT_RPL_1_1#", false, true);
            document.FindAllString("#FPT_RPL_1_2#", false, true);
            document.FindAllString("#FPT_SSP_1#", false, true);
            document.FindAllString("#FPT_SSP_1_1#", false, true);
            document.FindAllString("#FPT_SSP_2#", false, true);
            document.FindAllString("#FPT_SSP_2_1#", false, true);
            document.FindAllString("#FPT_SSP_2_2#", false, true);
            document.FindAllString("#FPT_STM_1#", false, true);
            document.FindAllString("#FPT_STM_1_1#", false, true);
            document.FindAllString("#FPT_TDC_1#", false, true);
            document.FindAllString("#FPT_TDC_1_1#", false, true);
            document.FindAllString("#FPT_TDC_1_2#", false, true);
            document.FindAllString("#FPT_TRC_1#", false, true);
            document.FindAllString("#FPT_TRC_1_1#", false, true);
            document.FindAllString("#FPT_TRC_1_2#", false, true);
            document.FindAllString("#FPT_TST_1#", false, true);
            document.FindAllString("#FPT_TST_1_1#", false, true);
            document.FindAllString("#FPT_TST_1_2#", false, true);
            document.FindAllString("#FPT_TST_1_3#", false, true);
            document.FindAllString("#FRU_FLT_1#", false, true);
            document.FindAllString("#FRU_FLT_1_1#", false, true);
            document.FindAllString("#FRU_FLT_2#", false, true);
            document.FindAllString("#FRU_FLT_2_1#", false, true);
            document.FindAllString("#FRU_PRS_1#", false, true);
            document.FindAllString("#FRU_PRS_1_1#", false, true);
            document.FindAllString("#FRU_PRS_1_2#", false, true);
            document.FindAllString("#FRU_PRS_2#", false, true);
            document.FindAllString("#FRU_PRS_2_1#", false, true);
            document.FindAllString("#FRU_PRS_2_2#", false, true);
            document.FindAllString("#FRU_RSA_1#", false, true);
            document.FindAllString("#FRU_RSA_1_1#", false, true);
            document.FindAllString("#FRU_RSA_2#", false, true);
            document.FindAllString("#FRU_RSA_2_1#", false, true);
            document.FindAllString("#FRU_RSA_2_2#", false, true);
            document.FindAllString("#FTA_LSA_1#", false, true);
            document.FindAllString("#FTA_LSA_1_1#", false, true);
            document.FindAllString("#FTA_MCS_1#", false, true);
            document.FindAllString("#FTA_MCS_1_1#", false, true);
            document.FindAllString("#FTA_MCS_1_2#", false, true);
            document.FindAllString("#FTA_MCS_2#", false, true);
            document.FindAllString("#FTA_MCS_2_1#", false, true);
            document.FindAllString("#FTA_MCS_2_2#", false, true);
            document.FindAllString("#FTA_SSL_1#", false, true);
            document.FindAllString("#FTA_SSL_1_1#", false, true);
            document.FindAllString("#FTA_SSL_1_2#", false, true);
            document.FindAllString("#FTA_SSL_2#", false, true);
            document.FindAllString("#FTA_SSL_2_1#", false, true);
            document.FindAllString("#FTA_SSL_2_2#", false, true);
            document.FindAllString("#FTA_SSL_3#", false, true);
            document.FindAllString("#FTA_SSL_3_1#", false, true);
            document.FindAllString("#FTA_SSL_4#", false, true);
            document.FindAllString("#FTA_SSL_4_1#", false, true);
            document.FindAllString("#FTA_TAB_1#", false, true);
            document.FindAllString("#FTA_TAB_1_1#", false, true);
            document.FindAllString("#FTA_TAH_1#", false, true);
            document.FindAllString("#FTA_TAH_1_1#", false, true);
            document.FindAllString("#FTA_TAH_1_2#", false, true);
            document.FindAllString("#FTA_TAH_1_3#", false, true);
            document.FindAllString("#FTA_TSE_1#", false, true);
            document.FindAllString("#FTA_TSE_1_1#", false, true);
            document.FindAllString("#FTP_ITC_1#", false, true);
            document.FindAllString("#FTP_ITC_1_1#", false, true);
            document.FindAllString("#FTP_ITC_1_2#", false, true);
            document.FindAllString("#FTP_ITC_1_3#", false, true);
            document.FindAllString("#FTP_TRP_1#", false, true);
            document.FindAllString("#FTP_TRP_1_1#", false, true);
            document.FindAllString("#FTP_TRP_1_2#", false, true);
            document.FindAllString("#FTP_TRP_1_3#", false, true);



            document.FindAllString("#FAU_ARP_1_hierarchy#", false, true);
            document.FindAllString("#FAU_ARP_1_dependence#", false, true);
            document.FindAllString("#FAU_ARP_1_1_description#", false, true);
            document.FindAllString("#FAU_GEN_1_hierarchy#", false, true);
            document.FindAllString("#FAU_GEN_1_dependence#", false, true);
            document.FindAllString("#FAU_GEN_1_1_description#", false, true);
            document.FindAllString("#FAU_GEN_1_2_description#", false, true);
            document.FindAllString("#FAU_GEN_2_hierarchy#", false, true);
            document.FindAllString("#FAU_GEN_2_dependence#", false, true);
            document.FindAllString("#FAU_GEN_2_1_description#", false, true);
            document.FindAllString("#FAU_SAA_1_hierarchy#", false, true);
            document.FindAllString("#FAU_SAA_1_dependence#", false, true);
            document.FindAllString("#FAU_SAA_1_1_description#", false, true);
            document.FindAllString("#FAU_SAA_1_2_description#", false, true);
            document.FindAllString("#FAU_SAA_2_hierarchy#", false, true);
            document.FindAllString("#FAU_SAA_2_dependence#", false, true);
            document.FindAllString("#FAU_SAA_2_1_description#", false, true);
            document.FindAllString("#FAU_SAA_2_2_description#", false, true);
            document.FindAllString("#FAU_SAA_2_3_description#", false, true);
            document.FindAllString("#FAU_SAA_3_hierarchy#", false, true);
            document.FindAllString("#FAU_SAA_3_dependence#", false, true);
            document.FindAllString("#FAU_SAA_3_1_description#", false, true);
            document.FindAllString("#FAU_SAA_3_2_description#", false, true);
            document.FindAllString("#FAU_SAA_3_3_description#", false, true);
            document.FindAllString("#FAU_SAA_4_hierarchy#", false, true);
            document.FindAllString("#FAU_SAA_4_dependence#", false, true);
            document.FindAllString("#FAU_SAA_4_1_description#", false, true);
            document.FindAllString("#FAU_SAA_4_2_description#", false, true);
            document.FindAllString("#FAU_SAA_4_3_description#", false, true);
            document.FindAllString("#FAU_SAR_1_hierarchy#", false, true);
            document.FindAllString("#FAU_SAR_1_dependence#", false, true);
            document.FindAllString("#FAU_SAR_1_1_description#", false, true);
            document.FindAllString("#FAU_SAR_1_2_description#", false, true);
            document.FindAllString("#FAU_SAR_2_hierarchy#", false, true);
            document.FindAllString("#FAU_SAR_2_dependence#", false, true);
            document.FindAllString("#FAU_SAR_2_1_description#", false, true);
            document.FindAllString("#FAU_SAR_3_hierarchy#", false, true);
            document.FindAllString("#FAU_SAR_3_dependence#", false, true);
            document.FindAllString("#FAU_SAR_3_1_description#", false, true);
            document.FindAllString("#FAU_SEL_1_hierarchy#", false, true);
            document.FindAllString("#FAU_SEL_1_dependence#", false, true);
            document.FindAllString("#FAU_SEL_1_1_description#", false, true);
            document.FindAllString("#FAU_STG_1_hierarchy#", false, true);
            document.FindAllString("#FAU_STG_1_dependence#", false, true);
            document.FindAllString("#FAU_STG_1_1_description#", false, true);
            document.FindAllString("#FAU_STG_1_2_description#", false, true);
            document.FindAllString("#FAU_STG_2_hierarchy#", false, true);
            document.FindAllString("#FAU_STG_2_dependence#", false, true);
            document.FindAllString("#FAU_STG_2_1_description#", false, true);
            document.FindAllString("#FAU_STG_2_2_description#", false, true);
            document.FindAllString("#FAU_STG_2_3_description#", false, true);
            document.FindAllString("#FAU_STG_3_hierarchy#", false, true);
            document.FindAllString("#FAU_STG_3_dependence#", false, true);
            document.FindAllString("#FAU_STG_3_1_description#", false, true);
            document.FindAllString("#FAU_STG_4_hierarchy#", false, true);
            document.FindAllString("#FAU_STG_4_dependence#", false, true);
            document.FindAllString("#FAU_STG_4_1_description#", false, true);
            document.FindAllString("#FCO_NRO_1_hierarchy#", false, true);
            document.FindAllString("#FCO_NRO_1_dependence#", false, true);
            document.FindAllString("#FCO_NRO_1_1_description#", false, true);
            document.FindAllString("#FCO_NRO_1_2_description#", false, true);
            document.FindAllString("#FCO_NRO_1_3_description#", false, true);
            document.FindAllString("#FCO_NRO_2_hierarchy#", false, true);
            document.FindAllString("#FCO_NRO_2_dependence#", false, true);
            document.FindAllString("#FCO_NRO_2_1_description#", false, true);
            document.FindAllString("#FCO_NRO_2_2_description#", false, true);
            document.FindAllString("#FCO_NRO_2_3_description#", false, true);
            document.FindAllString("#FCO_NRR_1_hierarchy#", false, true);
            document.FindAllString("#FCO_NRR_1_dependence#", false, true);
            document.FindAllString("#FCO_NRR_1_1_description#", false, true);
            document.FindAllString("#FCO_NRR_1_2_description#", false, true);
            document.FindAllString("#FCO_NRR_1_3_description#", false, true);
            document.FindAllString("#FCO_NRR_2_hierarchy#", false, true);
            document.FindAllString("#FCO_NRR_2_dependence#", false, true);
            document.FindAllString("#FCO_NRR_2_1_description#", false, true);
            document.FindAllString("#FCO_NRR_2_2_description#", false, true);
            document.FindAllString("#FCO_NRR_2_3_description#", false, true);
            document.FindAllString("#FCS_CKM_1_hierarchy#", false, true);
            document.FindAllString("#FCS_CKM_1_dependence#", false, true);
            document.FindAllString("#FCS_CKM_1_1_description#", false, true);
            document.FindAllString("#FCS_CKM_2_hierarchy#", false, true);
            document.FindAllString("#FCS_CKM_2_dependence#", false, true);
            document.FindAllString("#FCS_CKM_2_1_description#", false, true);
            document.FindAllString("#FCS_CKM_3_hierarchy#", false, true);
            document.FindAllString("#FCS_CKM_3_dependence#", false, true);
            document.FindAllString("#FCS_CKM_3_1_description#", false, true);
            document.FindAllString("#FCS_CKM_4_hierarchy#", false, true);
            document.FindAllString("#FCS_CKM_4_dependence#", false, true);
            document.FindAllString("#FCS_CKM_4_1_description#", false, true);
            document.FindAllString("#FCS_COP_1_hierarchy#", false, true);
            document.FindAllString("#FCS_COP_1_dependence#", false, true);
            document.FindAllString("#FCS_COP_1_1_description#", false, true);
            document.FindAllString("#FDP_ACC_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ACC_1_dependence#", false, true);
            document.FindAllString("#FDP_ACC_1_1_description#", false, true);
            document.FindAllString("#FDP_ACC_2_hierarchy#", false, true);
            document.FindAllString("#FDP_ACC_2_dependence#", false, true);
            document.FindAllString("#FDP_ACC_2_1_description#", false, true);
            document.FindAllString("#FDP_ACC_2_2_description#", false, true);
            document.FindAllString("#FDP_ACF_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ACF_1_dependence#", false, true);
            document.FindAllString("#FDP_ACF_1_1_description#", false, true);
            document.FindAllString("#FDP_ACF_1_2_description#", false, true);
            document.FindAllString("#FDP_ACF_1_3_description#", false, true);
            document.FindAllString("#FDP_ACF_1_4_description#", false, true);
            document.FindAllString("#FDP_DAU_1_hierarchy#", false, true);
            document.FindAllString("#FDP_DAU_1_dependence#", false, true);
            document.FindAllString("#FDP_DAU_1_1_description#", false, true);
            document.FindAllString("#FDP_DAU_1_2_description#", false, true);
            document.FindAllString("#FDP_DAU_2_hierarchy#", false, true);
            document.FindAllString("#FDP_DAU_2_dependence#", false, true);
            document.FindAllString("#FDP_DAU_2_1_description#", false, true);
            document.FindAllString("#FDP_DAU_2_2_description#", false, true);
            document.FindAllString("#FDP_ETC_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ETC_1_dependence#", false, true);
            document.FindAllString("#FDP_ETC_1_1_description#", false, true);
            document.FindAllString("#FDP_ETC_1_2_description#", false, true);
            document.FindAllString("#FDP_ETC_2_hierarchy#", false, true);
            document.FindAllString("#FDP_ETC_2_dependence#", false, true);
            document.FindAllString("#FDP_ETC_2_1_description#", false, true);
            document.FindAllString("#FDP_ETC_2_2_description#", false, true);
            document.FindAllString("#FDP_ETC_2_3_description#", false, true);
            document.FindAllString("#FDP_ETC_2_4_description#", false, true);
            document.FindAllString("#FDP_IFC_1_hierarchy#", false, true);
            document.FindAllString("#FDP_IFC_1_dependence#", false, true);
            document.FindAllString("#FDP_IFC_1_1_description#", false, true);
            document.FindAllString("#FDP_IFC_2_hierarchy#", false, true);
            document.FindAllString("#FDP_IFC_2_dependence#", false, true);
            document.FindAllString("#FDP_IFC_2_1_description#", false, true);
            document.FindAllString("#FDP_IFC_2_2_description#", false, true);
            document.FindAllString("#FDP_IFF_1_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_1_dependence#", false, true);
            document.FindAllString("#FDP_IFF_1_1_description#", false, true);
            document.FindAllString("#FDP_IFF_1_2_description#", false, true);
            document.FindAllString("#FDP_IFF_1_3_description#", false, true);
            document.FindAllString("#FDP_IFF_1_4_description#", false, true);
            document.FindAllString("#FDP_IFF_1_5_description#", false, true);
            document.FindAllString("#FDP_IFF_1_6_description#", false, true);
            document.FindAllString("#FDP_IFF_2_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_2_dependence#", false, true);
            document.FindAllString("#FDP_IFF_2_1_description#", false, true);
            document.FindAllString("#FDP_IFF_2_2_description#", false, true);
            document.FindAllString("#FDP_IFF_2_3_description#", false, true);
            document.FindAllString("#FDP_IFF_2_4_description#", false, true);
            document.FindAllString("#FDP_IFF_2_5_description#", false, true);
            document.FindAllString("#FDP_IFF_2_6_description#", false, true);
            document.FindAllString("#FDP_IFF_3_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_3_dependence#", false, true);
            document.FindAllString("#FDP_IFF_3_1_description#", false, true);
            document.FindAllString("#FDP_IFF_4_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_4_dependence#", false, true);
            document.FindAllString("#FDP_IFF_4_1_description#", false, true);
            document.FindAllString("#FDP_IFF_4_2_description#", false, true);
            document.FindAllString("#FDP_IFF_5_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_5_dependence#", false, true);
            document.FindAllString("#FDP_IFF_5_1_description#", false, true);
            document.FindAllString("#FDP_IFF_6_hierarchy#", false, true);
            document.FindAllString("#FDP_IFF_6_dependence#", false, true);
            document.FindAllString("#FDP_IFF_6_1_description#", false, true);
            document.FindAllString("#FDP_ITC_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ITC_1_dependence#", false, true);
            document.FindAllString("#FDP_ITC_1_1_description#", false, true);
            document.FindAllString("#FDP_ITC_1_2_description#", false, true);
            document.FindAllString("#FDP_ITC_1_3_description#", false, true);
            document.FindAllString("#FDP_ITC_2_hierarchy#", false, true);
            document.FindAllString("#FDP_ITC_2_dependence#", false, true);
            document.FindAllString("#FDP_ITC_2_1_description#", false, true);
            document.FindAllString("#FDP_ITC_2_2_description#", false, true);
            document.FindAllString("#FDP_ITC_2_3_description#", false, true);
            document.FindAllString("#FDP_ITC_2_4_description#", false, true);
            document.FindAllString("#FDP_ITC_2_5_description#", false, true);
            document.FindAllString("#FDP_ITT_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ITT_1_dependence#", false, true);
            document.FindAllString("#FDP_ITT_1_1_description#", false, true);
            document.FindAllString("#FDP_ITT_2_hierarchy#", false, true);
            document.FindAllString("#FDP_ITT_2_dependence#", false, true);
            document.FindAllString("#FDP_ITT_2_1_description#", false, true);
            document.FindAllString("#FDP_ITT_2_2_description#", false, true);
            document.FindAllString("#FDP_ITT_3_hierarchy#", false, true);
            document.FindAllString("#FDP_ITT_3_dependence#", false, true);
            document.FindAllString("#FDP_ITT_3_1_description#", false, true);
            document.FindAllString("#FDP_ITT_3_2_description#", false, true);
            document.FindAllString("#FDP_ITT_4_hierarchy#", false, true);
            document.FindAllString("#FDP_ITT_4_dependence#", false, true);
            document.FindAllString("#FDP_ITT_4_1_description#", false, true);
            document.FindAllString("#FDP_ITT_4_2_description#", false, true);
            document.FindAllString("#FDP_RIP_1_hierarchy#", false, true);
            document.FindAllString("#FDP_RIP_1_dependence#", false, true);
            document.FindAllString("#FDP_RIP_1_1_description#", false, true);
            document.FindAllString("#FDP_RIP_2_hierarchy#", false, true);
            document.FindAllString("#FDP_RIP_2_dependence#", false, true);
            document.FindAllString("#FDP_RIP_2_1_description#", false, true);
            document.FindAllString("#FDP_ROL_1_hierarchy#", false, true);
            document.FindAllString("#FDP_ROL_1_dependence#", false, true);
            document.FindAllString("#FDP_ROL_1_1_description#", false, true);
            document.FindAllString("#FDP_ROL_2_hierarchy#", false, true);
            document.FindAllString("#FDP_ROL_2_dependence#", false, true);
            document.FindAllString("#FDP_ROL_2_1_description#", false, true);
            document.FindAllString("#FDP_SDI_1_hierarchy#", false, true);
            document.FindAllString("#FDP_SDI_1_dependence#", false, true);
            document.FindAllString("#FDP_SDI_1_1_description#", false, true);
            document.FindAllString("#FDP_SDI_2_hierarchy#", false, true);
            document.FindAllString("#FDP_SDI_2_dependence#", false, true);
            document.FindAllString("#FDP_SDI_2_1_description#", false, true);
            document.FindAllString("#FDP_SDI_2_2_description#", false, true);
            document.FindAllString("#FDP_UCT_1_hierarchy#", false, true);
            document.FindAllString("#FDP_UCT_1_dependence#", false, true);
            document.FindAllString("#FDP_UCT_1_1_description#", false, true);
            document.FindAllString("#FDP_UIT_1_hierarchy#", false, true);
            document.FindAllString("#FDP_UIT_1_dependence#", false, true);
            document.FindAllString("#FDP_UIT_1_1_description#", false, true);
            document.FindAllString("#FDP_UIT_1_2_description#", false, true);
            document.FindAllString("#FDP_UIT_2_hierarchy#", false, true);
            document.FindAllString("#FDP_UIT_2_dependence#", false, true);
            document.FindAllString("#FDP_UIT_2_1_description#", false, true);
            document.FindAllString("#FDP_UIT_3_hierarchy#", false, true);
            document.FindAllString("#FDP_UIT_3_dependence#", false, true);
            document.FindAllString("#FDP_UIT_3_1_description#", false, true);
            document.FindAllString("#FIA_AFL_1_hierarchy#", false, true);
            document.FindAllString("#FIA_AFL_1_dependence#", false, true);
            document.FindAllString("#FIA_AFL_1_1_description#", false, true);
            document.FindAllString("#FIA_AFL_1_2_description#", false, true);
            document.FindAllString("#FIA_ATD_1_hierarchy#", false, true);
            document.FindAllString("#FIA_ATD_1_dependence#", false, true);
            document.FindAllString("#FIA_ATD_1_1_description#", false, true);
            document.FindAllString("#FIA_SOS_1_hierarchy#", false, true);
            document.FindAllString("#FIA_SOS_1_dependence#", false, true);
            document.FindAllString("#FIA_SOS_1_1_description#", false, true);
            document.FindAllString("#FIA_SOS_2_hierarchy#", false, true);
            document.FindAllString("#FIA_SOS_2_dependence#", false, true);
            document.FindAllString("#FIA_SOS_2_1_description#", false, true);
            document.FindAllString("#FIA_SOS_2_2_description#", false, true);
            document.FindAllString("#FIA_UAU_1_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_1_dependence#", false, true);
            document.FindAllString("#FIA_UAU_1_1_description#", false, true);
            document.FindAllString("#FIA_UAU_1_2_description#", false, true);
            document.FindAllString("#FIA_UAU_2_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_2_dependence#", false, true);
            document.FindAllString("#FIA_UAU_2_1_description#", false, true);
            document.FindAllString("#FIA_UAU_3_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_3_dependence#", false, true);
            document.FindAllString("#FIA_UAU_3_1_description#", false, true);
            document.FindAllString("#FIA_UAU_3_2_description#", false, true);
            document.FindAllString("#FIA_UAU_4_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_4_dependence#", false, true);
            document.FindAllString("#FIA_UAU_4_1_description#", false, true);
            document.FindAllString("#FIA_UAU_5_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_5_dependence#", false, true);
            document.FindAllString("#FIA_UAU_5_1_description#", false, true);
            document.FindAllString("#FIA_UAU_5_2_description#", false, true);
            document.FindAllString("#FIA_UAU_6_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_6_dependence#", false, true);
            document.FindAllString("#FIA_UAU_6_1_description#", false, true);
            document.FindAllString("#FIA_UAU_7_hierarchy#", false, true);
            document.FindAllString("#FIA_UAU_7_dependence#", false, true);
            document.FindAllString("#FIA_UAU_7_1_description#", false, true);
            document.FindAllString("#FIA_UID_1_hierarchy#", false, true);
            document.FindAllString("#FIA_UID_1_dependence#", false, true);
            document.FindAllString("#FIA_UID_1_1_description#", false, true);
            document.FindAllString("#FIA_UID_1_2_description#", false, true);
            document.FindAllString("#FIA_UID_2_hierarchy#", false, true);
            document.FindAllString("#FIA_UID_2_dependence#", false, true);
            document.FindAllString("#FIA_UID_2_1_description#", false, true);
            document.FindAllString("#FIA_USB_1_hierarchy#", false, true);
            document.FindAllString("#FIA_USB_1_dependence#", false, true);
            document.FindAllString("#FIA_USB_1_1_description#", false, true);
            document.FindAllString("#FIA_USB_1_2_description#", false, true);
            document.FindAllString("#FIA_USB_1_3_description#", false, true);
            document.FindAllString("#FMT_MOF_1_hierarchy#", false, true);
            document.FindAllString("#FMT_MOF_1_dependence#", false, true);
            document.FindAllString("#FMT_MOF_1_1_description#", false, true);
            document.FindAllString("#FMT_MSA_1_hierarchy#", false, true);
            document.FindAllString("#FMT_MSA_1_dependence#", false, true);
            document.FindAllString("#FMT_MSA_1_1_description#", false, true);
            document.FindAllString("#FMT_MSA_2_hierarchy#", false, true);
            document.FindAllString("#FMT_MSA_2_dependence#", false, true);
            document.FindAllString("#FMT_MSA_2_1_description#", false, true);
            document.FindAllString("#FMT_MSA_3_hierarchy#", false, true);
            document.FindAllString("#FMT_MSA_3_dependence#", false, true);
            document.FindAllString("#FMT_MSA_3_1_description#", false, true);
            document.FindAllString("#FMT_MSA_3_2_description#", false, true);
            document.FindAllString("#FMT_MSA_4_hierarchy#", false, true);
            document.FindAllString("#FMT_MSA_4_dependence#", false, true);
            document.FindAllString("#FMT_MSA_4_1_description#", false, true);
            document.FindAllString("#FMT_MTD_1_hierarchy#", false, true);
            document.FindAllString("#FMT_MTD_1_dependence#", false, true);
            document.FindAllString("#FMT_MTD_1_1_description#", false, true);
            document.FindAllString("#FMT_MTD_2_hierarchy#", false, true);
            document.FindAllString("#FMT_MTD_2_dependence#", false, true);
            document.FindAllString("#FMT_MTD_2_1_description#", false, true);
            document.FindAllString("#FMT_MTD_2_2_description#", false, true);
            document.FindAllString("#FMT_MTD_3_hierarchy#", false, true);
            document.FindAllString("#FMT_MTD_3_dependence#", false, true);
            document.FindAllString("#FMT_MTD_3_1_description#", false, true);
            document.FindAllString("#FMT_REV_1_hierarchy#", false, true);
            document.FindAllString("#FMT_REV_1_dependence#", false, true);
            document.FindAllString("#FMT_REV_1_1_description#", false, true);
            document.FindAllString("#FMT_REV_1_2_description#", false, true);
            document.FindAllString("#FMT_SAE_1_hierarchy#", false, true);
            document.FindAllString("#FMT_SAE_1_dependence#", false, true);
            document.FindAllString("#FMT_SAE_1_1_description#", false, true);
            document.FindAllString("#FMT_SAE_1_2_description#", false, true);
            document.FindAllString("#FMT_SMF_1_hierarchy#", false, true);
            document.FindAllString("#FMT_SMF_1_dependence#", false, true);
            document.FindAllString("#FMT_SMF_1_1_description#", false, true);
            document.FindAllString("#FMT_SMR_1_hierarchy#", false, true);
            document.FindAllString("#FMT_SMR_1_dependence#", false, true);
            document.FindAllString("#FMT_SMR_1_1_description#", false, true);
            document.FindAllString("#FMT_SMR_1_2_description#", false, true);
            document.FindAllString("#FMT_SMR_2_hierarchy#", false, true);
            document.FindAllString("#FMT_SMR_2_dependence#", false, true);
            document.FindAllString("#FMT_SMR_2_1_description#", false, true);
            document.FindAllString("#FMT_SMR_2_2_description#", false, true);
            document.FindAllString("#FMT_SMR_2_3_description#", false, true);
            document.FindAllString("#FMT_SMR_3_hierarchy#", false, true);
            document.FindAllString("#FMT_SMR_3_dependence#", false, true);
            document.FindAllString("#FMT_SMR_3_1_description#", false, true);
            document.FindAllString("#FPR_ANO_1_hierarchy#", false, true);
            document.FindAllString("#FPR_ANO_1_dependence#", false, true);
            document.FindAllString("#FPR_ANO_1_1_description#", false, true);
            document.FindAllString("#FPR_ANO_2_hierarchy#", false, true);
            document.FindAllString("#FPR_ANO_2_dependence#", false, true);
            document.FindAllString("#FPR_ANO_2_1_description#", false, true);
            document.FindAllString("#FPR_ANO_2_2_description#", false, true);
            document.FindAllString("#FPR_PSE_1_hierarchy#", false, true);
            document.FindAllString("#FPR_PSE_1_dependence#", false, true);
            document.FindAllString("#FPR_PSE_1_1_description#", false, true);
            document.FindAllString("#FPR_PSE_1_2_description#", false, true);
            document.FindAllString("#FPR_PSE_1_3_description#", false, true);
            document.FindAllString("#FPR_PSE_2_hierarchy#", false, true);
            document.FindAllString("#FPR_PSE_2_dependence#", false, true);
            document.FindAllString("#FPR_PSE_2_1_description#", false, true);
            document.FindAllString("#FPR_PSE_2_2_description#", false, true);
            document.FindAllString("#FPR_PSE_2_3_description#", false, true);
            document.FindAllString("#FPR_PSE_2_4_description#", false, true);
            document.FindAllString("#FPR_PSE_3_hierarchy#", false, true);
            document.FindAllString("#FPR_PSE_3_dependence#", false, true);
            document.FindAllString("#FPR_PSE_3_1_description#", false, true);
            document.FindAllString("#FPR_PSE_3_2_description#", false, true);
            document.FindAllString("#FPR_PSE_3_3_description#", false, true);
            document.FindAllString("#FPR_PSE_3_4_description#", false, true);
            document.FindAllString("#FPR_UNL_1_hierarchy#", false, true);
            document.FindAllString("#FPR_UNL_1_dependence#", false, true);
            document.FindAllString("#FPR_UNL_1_1_description#", false, true);
            document.FindAllString("#FPR_UNO_1_hierarchy#", false, true);
            document.FindAllString("#FPR_UNO_1_dependence#", false, true);
            document.FindAllString("#FPR_UNO_1_1_description#", false, true);
            document.FindAllString("#FPR_UNO_2_hierarchy#", false, true);
            document.FindAllString("#FPR_UNO_2_dependence#", false, true);
            document.FindAllString("#FPR_UNO_2_1_description#", false, true);
            document.FindAllString("#FPR_UNO_2_2_description#", false, true);
            document.FindAllString("#FPR_UNO_3_hierarchy#", false, true);
            document.FindAllString("#FPR_UNO_3_dependence#", false, true);
            document.FindAllString("#FPR_UNO_3_1_description#", false, true);
            document.FindAllString("#FPR_UNO_4_hierarchy#", false, true);
            document.FindAllString("#FPR_UNO_4_dependence#", false, true);
            document.FindAllString("#FPR_UNO_4_1_description#", false, true);
            document.FindAllString("#FPT_FLS_1_hierarchy#", false, true);
            document.FindAllString("#FPT_FLS_1_dependence#", false, true);
            document.FindAllString("#FPT_FLS_1_1_description#", false, true);
            document.FindAllString("#FPT_ITA_1_hierarchy#", false, true);
            document.FindAllString("#FPT_ITA_1_dependence#", false, true);
            document.FindAllString("#FPT_ITA_1_1_description#", false, true);
            document.FindAllString("#FPT_ITC_1_hierarchy#", false, true);
            document.FindAllString("#FPT_ITC_1_dependence#", false, true);
            document.FindAllString("#FPT_ITC_1_1_description#", false, true);
            document.FindAllString("#FPT_ITI_1_hierarchy#", false, true);
            document.FindAllString("#FPT_ITI_1_dependence#", false, true);
            document.FindAllString("#FPT_ITI_1_1_description#", false, true);
            document.FindAllString("#FPT_ITI_1_2_description#", false, true);
            document.FindAllString("#FPT_ITI_2_hierarchy#", false, true);
            document.FindAllString("#FPT_ITI_2_dependence#", false, true);
            document.FindAllString("#FPT_ITI_2_1_description#", false, true);
            document.FindAllString("#FPT_ITI_2_2_description#", false, true);
            document.FindAllString("#FPT_ITI_2_3_description#", false, true);
            document.FindAllString("#FPT_ITT_1_hierarchy#", false, true);
            document.FindAllString("#FPT_ITT_1_dependence#", false, true);
            document.FindAllString("#FPT_ITT_1_1_description#", false, true);
            document.FindAllString("#FPT_ITT_2_hierarchy#", false, true);
            document.FindAllString("#FPT_ITT_2_dependence#", false, true);
            document.FindAllString("#FPT_ITT_2_1_description#", false, true);
            document.FindAllString("#FPT_ITT_2_2_description#", false, true);
            document.FindAllString("#FPT_ITT_3_hierarchy#", false, true);
            document.FindAllString("#FPT_ITT_3_dependence#", false, true);
            document.FindAllString("#FPT_ITT_3_1_description#", false, true);
            document.FindAllString("#FPT_ITT_3_2_description#", false, true);
            document.FindAllString("#FPT_PHP_1_hierarchy#", false, true);
            document.FindAllString("#FPT_PHP_1_dependence#", false, true);
            document.FindAllString("#FPT_PHP_1_1_description#", false, true);
            document.FindAllString("#FPT_PHP_1_2_description#", false, true);
            document.FindAllString("#FPT_PHP_2_hierarchy#", false, true);
            document.FindAllString("#FPT_PHP_2_dependence#", false, true);
            document.FindAllString("#FPT_PHP_2_1_description#", false, true);
            document.FindAllString("#FPT_PHP_2_2_description#", false, true);
            document.FindAllString("#FPT_PHP_2_3_description#", false, true);
            document.FindAllString("#FPT_PHP_3_hierarchy#", false, true);
            document.FindAllString("#FPT_PHP_3_dependence#", false, true);
            document.FindAllString("#FPT_PHP_3_1_description#", false, true);
            document.FindAllString("#FPT_RCV_1_hierarchy#", false, true);
            document.FindAllString("#FPT_RCV_1_dependence#", false, true);
            document.FindAllString("#FPT_RCV_1_1_description#", false, true);
            document.FindAllString("#FPT_RCV_2_hierarchy#", false, true);
            document.FindAllString("#FPT_RCV_2_dependence#", false, true);
            document.FindAllString("#FPT_RCV_2_1_description#", false, true);
            document.FindAllString("#FPT_RCV_2_2_description#", false, true);
            document.FindAllString("#FPT_RCV_3_hierarchy#", false, true);
            document.FindAllString("#FPT_RCV_3_dependence#", false, true);
            document.FindAllString("#FPT_RCV_3_1_description#", false, true);
            document.FindAllString("#FPT_RCV_3_2_description#", false, true);
            document.FindAllString("#FPT_RCV_3_3_description#", false, true);
            document.FindAllString("#FPT_RCV_3_4_description#", false, true);
            document.FindAllString("#FPT_RCV_4_hierarchy#", false, true);
            document.FindAllString("#FPT_RCV_4_dependence#", false, true);
            document.FindAllString("#FPT_RCV_4_1_description#", false, true);
            document.FindAllString("#FPT_RPL_1_hierarchy#", false, true);
            document.FindAllString("#FPT_RPL_1_dependence#", false, true);
            document.FindAllString("#FPT_RPL_1_1_description#", false, true);
            document.FindAllString("#FPT_RPL_1_2_description#", false, true);
            document.FindAllString("#FPT_SSP_1_hierarchy#", false, true);
            document.FindAllString("#FPT_SSP_1_dependence#", false, true);
            document.FindAllString("#FPT_SSP_1_1_description#", false, true);
            document.FindAllString("#FPT_SSP_2_hierarchy#", false, true);
            document.FindAllString("#FPT_SSP_2_dependence#", false, true);
            document.FindAllString("#FPT_SSP_2_1_description#", false, true);
            document.FindAllString("#FPT_SSP_2_2_description#", false, true);
            document.FindAllString("#FPT_STM_1_hierarchy#", false, true);
            document.FindAllString("#FPT_STM_1_dependence#", false, true);
            document.FindAllString("#FPT_STM_1_1_description#", false, true);
            document.FindAllString("#FPT_TDC_1_hierarchy#", false, true);
            document.FindAllString("#FPT_TDC_1_dependence#", false, true);
            document.FindAllString("#FPT_TDC_1_1_description#", false, true);
            document.FindAllString("#FPT_TDC_1_2_description#", false, true);
            document.FindAllString("#FPT_TRC_1_hierarchy#", false, true);
            document.FindAllString("#FPT_TRC_1_dependence#", false, true);
            document.FindAllString("#FPT_TRC_1_1_description#", false, true);
            document.FindAllString("#FPT_TRC_1_2_description#", false, true);
            document.FindAllString("#FPT_TST_1_hierarchy#", false, true);
            document.FindAllString("#FPT_TST_1_dependence#", false, true);
            document.FindAllString("#FPT_TST_1_1_description#", false, true);
            document.FindAllString("#FPT_TST_1_2_description#", false, true);
            document.FindAllString("#FPT_TST_1_3_description#", false, true);
            document.FindAllString("#FRU_FLT_1_hierarchy#", false, true);
            document.FindAllString("#FRU_FLT_1_dependence#", false, true);
            document.FindAllString("#FRU_FLT_1_1_description#", false, true);
            document.FindAllString("#FRU_FLT_2_hierarchy#", false, true);
            document.FindAllString("#FRU_FLT_2_dependence#", false, true);
            document.FindAllString("#FRU_FLT_2_1_description#", false, true);
            document.FindAllString("#FRU_PRS_1_hierarchy#", false, true);
            document.FindAllString("#FRU_PRS_1_dependence#", false, true);
            document.FindAllString("#FRU_PRS_1_1_description#", false, true);
            document.FindAllString("#FRU_PRS_1_2_description#", false, true);
            document.FindAllString("#FRU_PRS_2_hierarchy#", false, true);
            document.FindAllString("#FRU_PRS_2_dependence#", false, true);
            document.FindAllString("#FRU_PRS_2_1_description#", false, true);
            document.FindAllString("#FRU_PRS_2_2_description#", false, true);
            document.FindAllString("#FRU_RSA_1_hierarchy#", false, true);
            document.FindAllString("#FRU_RSA_1_dependence#", false, true);
            document.FindAllString("#FRU_RSA_1_1_description#", false, true);
            document.FindAllString("#FRU_RSA_2_hierarchy#", false, true);
            document.FindAllString("#FRU_RSA_2_dependence#", false, true);
            document.FindAllString("#FRU_RSA_2_1_description#", false, true);
            document.FindAllString("#FRU_RSA_2_2_description#", false, true);
            document.FindAllString("#FTA_LSA_1_hierarchy#", false, true);
            document.FindAllString("#FTA_LSA_1_dependence#", false, true);
            document.FindAllString("#FTA_LSA_1_1_description#", false, true);
            document.FindAllString("#FTA_MCS_1_hierarchy#", false, true);
            document.FindAllString("#FTA_MCS_1_dependence#", false, true);
            document.FindAllString("#FTA_MCS_1_1_description#", false, true);
            document.FindAllString("#FTA_MCS_1_2_description#", false, true);
            document.FindAllString("#FTA_MCS_2_hierarchy#", false, true);
            document.FindAllString("#FTA_MCS_2_dependence#", false, true);
            document.FindAllString("#FTA_MCS_2_1_description#", false, true);
            document.FindAllString("#FTA_MCS_2_2_description#", false, true);
            document.FindAllString("#FTA_SSL_1_hierarchy#", false, true);
            document.FindAllString("#FTA_SSL_1_dependence#", false, true);
            document.FindAllString("#FTA_SSL_1_1_description#", false, true);
            document.FindAllString("#FTA_SSL_1_2_description#", false, true);
            document.FindAllString("#FTA_SSL_2_hierarchy#", false, true);
            document.FindAllString("#FTA_SSL_2_dependence#", false, true);
            document.FindAllString("#FTA_SSL_2_1_description#", false, true);
            document.FindAllString("#FTA_SSL_2_2_description#", false, true);
            document.FindAllString("#FTA_SSL_3_hierarchy#", false, true);
            document.FindAllString("#FTA_SSL_3_dependence#", false, true);
            document.FindAllString("#FTA_SSL_3_1_description#", false, true);
            document.FindAllString("#FTA_SSL_4_hierarchy#", false, true);
            document.FindAllString("#FTA_SSL_4_dependence#", false, true);
            document.FindAllString("#FTA_SSL_4_1_description#", false, true);
            document.FindAllString("#FTA_TAB_1_hierarchy#", false, true);
            document.FindAllString("#FTA_TAB_1_dependence#", false, true);
            document.FindAllString("#FTA_TAB_1_1_description#", false, true);
            document.FindAllString("#FTA_TAH_1_hierarchy#", false, true);
            document.FindAllString("#FTA_TAH_1_dependence#", false, true);
            document.FindAllString("#FTA_TAH_1_1_description#", false, true);
            document.FindAllString("#FTA_TAH_1_2_description#", false, true);
            document.FindAllString("#FTA_TAH_1_3_description#", false, true);
            document.FindAllString("#FTA_TSE_1_hierarchy#", false, true);
            document.FindAllString("#FTA_TSE_1_dependence#", false, true);
            document.FindAllString("#FTA_TSE_1_1_description#", false, true);
            document.FindAllString("#FTP_ITC_1_hierarchy#", false, true);
            document.FindAllString("#FTP_ITC_1_dependence#", false, true);
            document.FindAllString("#FTP_ITC_1_1_description#", false, true);
            document.FindAllString("#FTP_ITC_1_2_description#", false, true);
            document.FindAllString("#FTP_ITC_1_3_description#", false, true);
            document.FindAllString("#FTP_TRP_1_hierarchy#", false, true);
            document.FindAllString("#FTP_TRP_1_dependence#", false, true);
            document.FindAllString("#FTP_TRP_1_1_description#", false, true);
            document.FindAllString("#FTP_TRP_1_2_description#", false, true);
            document.FindAllString("#FTP_TRP_1_3_description#", false, true);


            document.Replace("#FAU_ARP_1#", "", false, true);
            document.Replace("#FAU_ARP_1_1#", "", false, true);
            document.Replace("#FAU_GEN_1#", "", false, true);
            document.Replace("#FAU_GEN_1_1#", "", false, true);
            document.Replace("#FAU_GEN_1_2#", "", false, true);
            document.Replace("#FAU_GEN_2#", "", false, true);
            document.Replace("#FAU_GEN_2_1#", "", false, true);
            document.Replace("#FAU_SAA_1#", "", false, true);
            document.Replace("#FAU_SAA_1_1#", "", false, true);
            document.Replace("#FAU_SAA_1_2#", "", false, true);
            document.Replace("#FAU_SAA_2#", "", false, true);
            document.Replace("#FAU_SAA_2_1#", "", false, true);
            document.Replace("#FAU_SAA_2_2#", "", false, true);
            document.Replace("#FAU_SAA_2_3#", "", false, true);
            document.Replace("#FAU_SAA_3#", "", false, true);
            document.Replace("#FAU_SAA_3_1#", "", false, true);
            document.Replace("#FAU_SAA_3_2#", "", false, true);
            document.Replace("#FAU_SAA_3_3#", "", false, true);
            document.Replace("#FAU_SAA_4#", "", false, true);
            document.Replace("#FAU_SAA_4_1#", "", false, true);
            document.Replace("#FAU_SAA_4_2#", "", false, true);
            document.Replace("#FAU_SAA_4_3#", "", false, true);
            document.Replace("#FAU_SAR_1#", "", false, true);
            document.Replace("#FAU_SAR_1_1#", "", false, true);
            document.Replace("#FAU_SAR_1_2#", "", false, true);
            document.Replace("#FAU_SAR_2#", "", false, true);
            document.Replace("#FAU_SAR_2_1#", "", false, true);
            document.Replace("#FAU_SAR_3#", "", false, true);
            document.Replace("#FAU_SAR_3_1#", "", false, true);
            document.Replace("#FAU_SEL_1#", "", false, true);
            document.Replace("#FAU_SEL_1_1#", "", false, true);
            document.Replace("#FAU_STG_1#", "", false, true);
            document.Replace("#FAU_STG_1_1#", "", false, true);
            document.Replace("#FAU_STG_1_2#", "", false, true);
            document.Replace("#FAU_STG_2#", "", false, true);
            document.Replace("#FAU_STG_2_1#", "", false, true);
            document.Replace("#FAU_STG_2_2#", "", false, true);
            document.Replace("#FAU_STG_2_3#", "", false, true);
            document.Replace("#FAU_STG_3#", "", false, true);
            document.Replace("#FAU_STG_3_1#", "", false, true);
            document.Replace("#FAU_STG_4#", "", false, true);
            document.Replace("#FAU_STG_4_1#", "", false, true);
            document.Replace("#FCO_NRO_1#", "", false, true);
            document.Replace("#FCO_NRO_1_1#", "", false, true);
            document.Replace("#FCO_NRO_1_2#", "", false, true);
            document.Replace("#FCO_NRO_1_3#", "", false, true);
            document.Replace("#FCO_NRO_2#", "", false, true);
            document.Replace("#FCO_NRO_2_1#", "", false, true);
            document.Replace("#FCO_NRO_2_2#", "", false, true);
            document.Replace("#FCO_NRO_2_3#", "", false, true);
            document.Replace("#FCO_NRR_1#", "", false, true);
            document.Replace("#FCO_NRR_1_1#", "", false, true);
            document.Replace("#FCO_NRR_1_2#", "", false, true);
            document.Replace("#FCO_NRR_1_3#", "", false, true);
            document.Replace("#FCO_NRR_2#", "", false, true);
            document.Replace("#FCO_NRR_2_1#", "", false, true);
            document.Replace("#FCO_NRR_2_2#", "", false, true);
            document.Replace("#FCO_NRR_2_3#", "", false, true);
            document.Replace("#FCS_CKM_1#", "", false, true);
            document.Replace("#FCS_CKM_1_1#", "", false, true);
            document.Replace("#FCS_CKM_2#", "", false, true);
            document.Replace("#FCS_CKM_2_1#", "", false, true);
            document.Replace("#FCS_CKM_3#", "", false, true);
            document.Replace("#FCS_CKM_3_1#", "", false, true);
            document.Replace("#FCS_CKM_4#", "", false, true);
            document.Replace("#FCS_CKM_4_1#", "", false, true);
            document.Replace("#FCS_COP_1#", "", false, true);
            document.Replace("#FCS_COP_1_1#", "", false, true);
            document.Replace("#FDP_ACC_1#", "", false, true);
            document.Replace("#FDP_ACC_1_1#", "", false, true);
            document.Replace("#FDP_ACC_2#", "", false, true);
            document.Replace("#FDP_ACC_2_1#", "", false, true);
            document.Replace("#FDP_ACC_2_2#", "", false, true);
            document.Replace("#FDP_ACF_1#", "", false, true);
            document.Replace("#FDP_ACF_1_1#", "", false, true);
            document.Replace("#FDP_ACF_1_2#", "", false, true);
            document.Replace("#FDP_ACF_1_3#", "", false, true);
            document.Replace("#FDP_ACF_1_4#", "", false, true);
            document.Replace("#FDP_DAU_1#", "", false, true);
            document.Replace("#FDP_DAU_1_1#", "", false, true);
            document.Replace("#FDP_DAU_1_2#", "", false, true);
            document.Replace("#FDP_DAU_2#", "", false, true);
            document.Replace("#FDP_DAU_2_1#", "", false, true);
            document.Replace("#FDP_DAU_2_2#", "", false, true);
            document.Replace("#FDP_ETC_1#", "", false, true);
            document.Replace("#FDP_ETC_1_1#", "", false, true);
            document.Replace("#FDP_ETC_1_2#", "", false, true);
            document.Replace("#FDP_ETC_2#", "", false, true);
            document.Replace("#FDP_ETC_2_1#", "", false, true);
            document.Replace("#FDP_ETC_2_2#", "", false, true);
            document.Replace("#FDP_ETC_2_3#", "", false, true);
            document.Replace("#FDP_ETC_2_4#", "", false, true);
            document.Replace("#FDP_IFC_1#", "", false, true);
            document.Replace("#FDP_IFC_1_1#", "", false, true);
            document.Replace("#FDP_IFC_2#", "", false, true);
            document.Replace("#FDP_IFC_2_1#", "", false, true);
            document.Replace("#FDP_IFC_2_2#", "", false, true);
            document.Replace("#FDP_IFF_1#", "", false, true);
            document.Replace("#FDP_IFF_1_1#", "", false, true);
            document.Replace("#FDP_IFF_1_2#", "", false, true);
            document.Replace("#FDP_IFF_1_3#", "", false, true);
            document.Replace("#FDP_IFF_1_4#", "", false, true);
            document.Replace("#FDP_IFF_1_5#", "", false, true);
            document.Replace("#FDP_IFF_1_6#", "", false, true);
            document.Replace("#FDP_IFF_2#", "", false, true);
            document.Replace("#FDP_IFF_2_1#", "", false, true);
            document.Replace("#FDP_IFF_2_2#", "", false, true);
            document.Replace("#FDP_IFF_2_3#", "", false, true);
            document.Replace("#FDP_IFF_2_4#", "", false, true);
            document.Replace("#FDP_IFF_2_5#", "", false, true);
            document.Replace("#FDP_IFF_2_6#", "", false, true);
            document.Replace("#FDP_IFF_3#", "", false, true);
            document.Replace("#FDP_IFF_3_1#", "", false, true);
            document.Replace("#FDP_IFF_4#", "", false, true);
            document.Replace("#FDP_IFF_4_1#", "", false, true);
            document.Replace("#FDP_IFF_4_2#", "", false, true);
            document.Replace("#FDP_IFF_5#", "", false, true);
            document.Replace("#FDP_IFF_5_1#", "", false, true);
            document.Replace("#FDP_IFF_6#", "", false, true);
            document.Replace("#FDP_IFF_6_1#", "", false, true);
            document.Replace("#FDP_ITC_1#", "", false, true);
            document.Replace("#FDP_ITC_1_1#", "", false, true);
            document.Replace("#FDP_ITC_1_2#", "", false, true);
            document.Replace("#FDP_ITC_1_3#", "", false, true);
            document.Replace("#FDP_ITC_2#", "", false, true);
            document.Replace("#FDP_ITC_2_1#", "", false, true);
            document.Replace("#FDP_ITC_2_2#", "", false, true);
            document.Replace("#FDP_ITC_2_3#", "", false, true);
            document.Replace("#FDP_ITC_2_4#", "", false, true);
            document.Replace("#FDP_ITC_2_5#", "", false, true);
            document.Replace("#FDP_ITT_1#", "", false, true);
            document.Replace("#FDP_ITT_1_1#", "", false, true);
            document.Replace("#FDP_ITT_2#", "", false, true);
            document.Replace("#FDP_ITT_2_1#", "", false, true);
            document.Replace("#FDP_ITT_2_2#", "", false, true);
            document.Replace("#FDP_ITT_3#", "", false, true);
            document.Replace("#FDP_ITT_3_1#", "", false, true);
            document.Replace("#FDP_ITT_3_2#", "", false, true);
            document.Replace("#FDP_ITT_4#", "", false, true);
            document.Replace("#FDP_ITT_4_1#", "", false, true);
            document.Replace("#FDP_ITT_4_2#", "", false, true);
            document.Replace("#FDP_RIP_1#", "", false, true);
            document.Replace("#FDP_RIP_1_1#", "", false, true);
            document.Replace("#FDP_RIP_2#", "", false, true);
            document.Replace("#FDP_RIP_2_1#", "", false, true);
            document.Replace("#FDP_ROL_1#", "", false, true);
            document.Replace("#FDP_ROL_1_1#", "", false, true);
            document.Replace("#FDP_ROL_2#", "", false, true);
            document.Replace("#FDP_ROL_2_1#", "", false, true);
            document.Replace("#FDP_SDI_1#", "", false, true);
            document.Replace("#FDP_SDI_1_1#", "", false, true);
            document.Replace("#FDP_SDI_2#", "", false, true);
            document.Replace("#FDP_SDI_2_1#", "", false, true);
            document.Replace("#FDP_SDI_2_2#", "", false, true);
            document.Replace("#FDP_UCT_1#", "", false, true);
            document.Replace("#FDP_UCT_1_1#", "", false, true);
            document.Replace("#FDP_UIT_1#", "", false, true);
            document.Replace("#FDP_UIT_1_1#", "", false, true);
            document.Replace("#FDP_UIT_1_2#", "", false, true);
            document.Replace("#FDP_UIT_2#", "", false, true);
            document.Replace("#FDP_UIT_2_1#", "", false, true);
            document.Replace("#FDP_UIT_3#", "", false, true);
            document.Replace("#FDP_UIT_3_1#", "", false, true);
            document.Replace("#FIA_AFL_1#", "", false, true);
            document.Replace("#FIA_AFL_1_1#", "", false, true);
            document.Replace("#FIA_AFL_1_2#", "", false, true);
            document.Replace("#FIA_ATD_1#", "", false, true);
            document.Replace("#FIA_ATD_1_1#", "", false, true);
            document.Replace("#FIA_SOS_1#", "", false, true);
            document.Replace("#FIA_SOS_1_1#", "", false, true);
            document.Replace("#FIA_SOS_2#", "", false, true);
            document.Replace("#FIA_SOS_2_1#", "", false, true);
            document.Replace("#FIA_SOS_2_2#", "", false, true);
            document.Replace("#FIA_UAU_1#", "", false, true);
            document.Replace("#FIA_UAU_1_1#", "", false, true);
            document.Replace("#FIA_UAU_1_2#", "", false, true);
            document.Replace("#FIA_UAU_2#", "", false, true);
            document.Replace("#FIA_UAU_2_1#", "", false, true);
            document.Replace("#FIA_UAU_3#", "", false, true);
            document.Replace("#FIA_UAU_3_1#", "", false, true);
            document.Replace("#FIA_UAU_3_2#", "", false, true);
            document.Replace("#FIA_UAU_4#", "", false, true);
            document.Replace("#FIA_UAU_4_1#", "", false, true);
            document.Replace("#FIA_UAU_5#", "", false, true);
            document.Replace("#FIA_UAU_5_1#", "", false, true);
            document.Replace("#FIA_UAU_5_2#", "", false, true);
            document.Replace("#FIA_UAU_6#", "", false, true);
            document.Replace("#FIA_UAU_6_1#", "", false, true);
            document.Replace("#FIA_UAU_7#", "", false, true);
            document.Replace("#FIA_UAU_7_1#", "", false, true);
            document.Replace("#FIA_UID_1#", "", false, true);
            document.Replace("#FIA_UID_1_1#", "", false, true);
            document.Replace("#FIA_UID_1_2#", "", false, true);
            document.Replace("#FIA_UID_2#", "", false, true);
            document.Replace("#FIA_UID_2_1#", "", false, true);
            document.Replace("#FIA_USB_1#", "", false, true);
            document.Replace("#FIA_USB_1_1#", "", false, true);
            document.Replace("#FIA_USB_1_2#", "", false, true);
            document.Replace("#FIA_USB_1_3#", "", false, true);
            document.Replace("#FMT_MOF_1#", "", false, true);
            document.Replace("#FMT_MOF_1_1#", "", false, true);
            document.Replace("#FMT_MSA_1#", "", false, true);
            document.Replace("#FMT_MSA_1_1#", "", false, true);
            document.Replace("#FMT_MSA_2#", "", false, true);
            document.Replace("#FMT_MSA_2_1#", "", false, true);
            document.Replace("#FMT_MSA_3#", "", false, true);
            document.Replace("#FMT_MSA_3_1#", "", false, true);
            document.Replace("#FMT_MSA_3_2#", "", false, true);
            document.Replace("#FMT_MSA_4#", "", false, true);
            document.Replace("#FMT_MSA_4_1#", "", false, true);
            document.Replace("#FMT_MTD_1#", "", false, true);
            document.Replace("#FMT_MTD_1_1#", "", false, true);
            document.Replace("#FMT_MTD_2#", "", false, true);
            document.Replace("#FMT_MTD_2_1#", "", false, true);
            document.Replace("#FMT_MTD_2_2#", "", false, true);
            document.Replace("#FMT_MTD_3#", "", false, true);
            document.Replace("#FMT_MTD_3_1#", "", false, true);
            document.Replace("#FMT_REV_1#", "", false, true);
            document.Replace("#FMT_REV_1_1#", "", false, true);
            document.Replace("#FMT_REV_1_2#", "", false, true);
            document.Replace("#FMT_SAE_1#", "", false, true);
            document.Replace("#FMT_SAE_1_1#", "", false, true);
            document.Replace("#FMT_SAE_1_2#", "", false, true);
            document.Replace("#FMT_SMF_1#", "", false, true);
            document.Replace("#FMT_SMF_1_1#", "", false, true);
            document.Replace("#FMT_SMR_1#", "", false, true);
            document.Replace("#FMT_SMR_1_1#", "", false, true);
            document.Replace("#FMT_SMR_1_2#", "", false, true);
            document.Replace("#FMT_SMR_2#", "", false, true);
            document.Replace("#FMT_SMR_2_1#", "", false, true);
            document.Replace("#FMT_SMR_2_2#", "", false, true);
            document.Replace("#FMT_SMR_2_3#", "", false, true);
            document.Replace("#FMT_SMR_3#", "", false, true);
            document.Replace("#FMT_SMR_3_1#", "", false, true);
            document.Replace("#FPR_ANO_1#", "", false, true);
            document.Replace("#FPR_ANO_1_1#", "", false, true);
            document.Replace("#FPR_ANO_2#", "", false, true);
            document.Replace("#FPR_ANO_2_1#", "", false, true);
            document.Replace("#FPR_ANO_2_2#", "", false, true);
            document.Replace("#FPR_PSE_1#", "", false, true);
            document.Replace("#FPR_PSE_1_1#", "", false, true);
            document.Replace("#FPR_PSE_1_2#", "", false, true);
            document.Replace("#FPR_PSE_1_3#", "", false, true);
            document.Replace("#FPR_PSE_2#", "", false, true);
            document.Replace("#FPR_PSE_2_1#", "", false, true);
            document.Replace("#FPR_PSE_2_2#", "", false, true);
            document.Replace("#FPR_PSE_2_3#", "", false, true);
            document.Replace("#FPR_PSE_2_4#", "", false, true);
            document.Replace("#FPR_PSE_3#", "", false, true);
            document.Replace("#FPR_PSE_3_1#", "", false, true);
            document.Replace("#FPR_PSE_3_2#", "", false, true);
            document.Replace("#FPR_PSE_3_3#", "", false, true);
            document.Replace("#FPR_PSE_3_4#", "", false, true);
            document.Replace("#FPR_UNL_1#", "", false, true);
            document.Replace("#FPR_UNL_1_1#", "", false, true);
            document.Replace("#FPR_UNO_1#", "", false, true);
            document.Replace("#FPR_UNO_1_1#", "", false, true);
            document.Replace("#FPR_UNO_2#", "", false, true);
            document.Replace("#FPR_UNO_2_1#", "", false, true);
            document.Replace("#FPR_UNO_2_2#", "", false, true);
            document.Replace("#FPR_UNO_3#", "", false, true);
            document.Replace("#FPR_UNO_3_1#", "", false, true);
            document.Replace("#FPR_UNO_4#", "", false, true);
            document.Replace("#FPR_UNO_4_1#", "", false, true);
            document.Replace("#FPT_FLS_1#", "", false, true);
            document.Replace("#FPT_FLS_1_1#", "", false, true);
            document.Replace("#FPT_ITA_1#", "", false, true);
            document.Replace("#FPT_ITA_1_1#", "", false, true);
            document.Replace("#FPT_ITC_1#", "", false, true);
            document.Replace("#FPT_ITC_1_1#", "", false, true);
            document.Replace("#FPT_ITI_1#", "", false, true);
            document.Replace("#FPT_ITI_1_1#", "", false, true);
            document.Replace("#FPT_ITI_1_2#", "", false, true);
            document.Replace("#FPT_ITI_2#", "", false, true);
            document.Replace("#FPT_ITI_2_1#", "", false, true);
            document.Replace("#FPT_ITI_2_2#", "", false, true);
            document.Replace("#FPT_ITI_2_3#", "", false, true);
            document.Replace("#FPT_ITT_1#", "", false, true);
            document.Replace("#FPT_ITT_1_1#", "", false, true);
            document.Replace("#FPT_ITT_2#", "", false, true);
            document.Replace("#FPT_ITT_2_1#", "", false, true);
            document.Replace("#FPT_ITT_2_2#", "", false, true);
            document.Replace("#FPT_ITT_3#", "", false, true);
            document.Replace("#FPT_ITT_3_1#", "", false, true);
            document.Replace("#FPT_ITT_3_2#", "", false, true);
            document.Replace("#FPT_PHP_1#", "", false, true);
            document.Replace("#FPT_PHP_1_1#", "", false, true);
            document.Replace("#FPT_PHP_1_2#", "", false, true);
            document.Replace("#FPT_PHP_2#", "", false, true);
            document.Replace("#FPT_PHP_2_1#", "", false, true);
            document.Replace("#FPT_PHP_2_2#", "", false, true);
            document.Replace("#FPT_PHP_2_3#", "", false, true);
            document.Replace("#FPT_PHP_3#", "", false, true);
            document.Replace("#FPT_PHP_3_1#", "", false, true);
            document.Replace("#FPT_RCV_1#", "", false, true);
            document.Replace("#FPT_RCV_1_1#", "", false, true);
            document.Replace("#FPT_RCV_2#", "", false, true);
            document.Replace("#FPT_RCV_2_1#", "", false, true);
            document.Replace("#FPT_RCV_2_2#", "", false, true);
            document.Replace("#FPT_RCV_3#", "", false, true);
            document.Replace("#FPT_RCV_3_1#", "", false, true);
            document.Replace("#FPT_RCV_3_2#", "", false, true);
            document.Replace("#FPT_RCV_3_3#", "", false, true);
            document.Replace("#FPT_RCV_3_4#", "", false, true);
            document.Replace("#FPT_RCV_4#", "", false, true);
            document.Replace("#FPT_RCV_4_1#", "", false, true);
            document.Replace("#FPT_RPL_1#", "", false, true);
            document.Replace("#FPT_RPL_1_1#", "", false, true);
            document.Replace("#FPT_RPL_1_2#", "", false, true);
            document.Replace("#FPT_SSP_1#", "", false, true);
            document.Replace("#FPT_SSP_1_1#", "", false, true);
            document.Replace("#FPT_SSP_2#", "", false, true);
            document.Replace("#FPT_SSP_2_1#", "", false, true);
            document.Replace("#FPT_SSP_2_2#", "", false, true);
            document.Replace("#FPT_STM_1#", "", false, true);
            document.Replace("#FPT_STM_1_1#", "", false, true);
            document.Replace("#FPT_TDC_1#", "", false, true);
            document.Replace("#FPT_TDC_1_1#", "", false, true);
            document.Replace("#FPT_TDC_1_2#", "", false, true);
            document.Replace("#FPT_TRC_1#", "", false, true);
            document.Replace("#FPT_TRC_1_1#", "", false, true);
            document.Replace("#FPT_TRC_1_2#", "", false, true);
            document.Replace("#FPT_TST_1#", "", false, true);
            document.Replace("#FPT_TST_1_1#", "", false, true);
            document.Replace("#FPT_TST_1_2#", "", false, true);
            document.Replace("#FPT_TST_1_3#", "", false, true);
            document.Replace("#FRU_FLT_1#", "", false, true);
            document.Replace("#FRU_FLT_1_1#", "", false, true);
            document.Replace("#FRU_FLT_2#", "", false, true);
            document.Replace("#FRU_FLT_2_1#", "", false, true);
            document.Replace("#FRU_PRS_1#", "", false, true);
            document.Replace("#FRU_PRS_1_1#", "", false, true);
            document.Replace("#FRU_PRS_1_2#", "", false, true);
            document.Replace("#FRU_PRS_2#", "", false, true);
            document.Replace("#FRU_PRS_2_1#", "", false, true);
            document.Replace("#FRU_PRS_2_2#", "", false, true);
            document.Replace("#FRU_RSA_1#", "", false, true);
            document.Replace("#FRU_RSA_1_1#", "", false, true);
            document.Replace("#FRU_RSA_2#", "", false, true);
            document.Replace("#FRU_RSA_2_1#", "", false, true);
            document.Replace("#FRU_RSA_2_2#", "", false, true);
            document.Replace("#FTA_LSA_1#", "", false, true);
            document.Replace("#FTA_LSA_1_1#", "", false, true);
            document.Replace("#FTA_MCS_1#", "", false, true);
            document.Replace("#FTA_MCS_1_1#", "", false, true);
            document.Replace("#FTA_MCS_1_2#", "", false, true);
            document.Replace("#FTA_MCS_2#", "", false, true);
            document.Replace("#FTA_MCS_2_1#", "", false, true);
            document.Replace("#FTA_MCS_2_2#", "", false, true);
            document.Replace("#FTA_SSL_1#", "", false, true);
            document.Replace("#FTA_SSL_1_1#", "", false, true);
            document.Replace("#FTA_SSL_1_2#", "", false, true);
            document.Replace("#FTA_SSL_2#", "", false, true);
            document.Replace("#FTA_SSL_2_1#", "", false, true);
            document.Replace("#FTA_SSL_2_2#", "", false, true);
            document.Replace("#FTA_SSL_3#", "", false, true);
            document.Replace("#FTA_SSL_3_1#", "", false, true);
            document.Replace("#FTA_SSL_4#", "", false, true);
            document.Replace("#FTA_SSL_4_1#", "", false, true);
            document.Replace("#FTA_TAB_1#", "", false, true);
            document.Replace("#FTA_TAB_1_1#", "", false, true);
            document.Replace("#FTA_TAH_1#", "", false, true);
            document.Replace("#FTA_TAH_1_1#", "", false, true);
            document.Replace("#FTA_TAH_1_2#", "", false, true);
            document.Replace("#FTA_TAH_1_3#", "", false, true);
            document.Replace("#FTA_TSE_1#", "", false, true);
            document.Replace("#FTA_TSE_1_1#", "", false, true);
            document.Replace("#FTP_ITC_1#", "", false, true);
            document.Replace("#FTP_ITC_1_1#", "", false, true);
            document.Replace("#FTP_ITC_1_2#", "", false, true);
            document.Replace("#FTP_ITC_1_3#", "", false, true);
            document.Replace("#FTP_TRP_1#", "", false, true);
            document.Replace("#FTP_TRP_1_1#", "", false, true);
            document.Replace("#FTP_TRP_1_2#", "", false, true);
            document.Replace("#FTP_TRP_1_3#", "", false, true);



            document.Replace("#FAU_ARP_1_hierarchy#", "", false, true);
            document.Replace("#FAU_ARP_1_dependence#", "", false, true);
            document.Replace("#FAU_ARP_1_1_description#", "", false, true);
            document.Replace("#FAU_GEN_1_hierarchy#", "", false, true);
            document.Replace("#FAU_GEN_1_dependence#", "", false, true);
            document.Replace("#FAU_GEN_1_1_description#", "", false, true);
            document.Replace("#FAU_GEN_1_2_description#", "", false, true);
            document.Replace("#FAU_GEN_2_hierarchy#", "", false, true);
            document.Replace("#FAU_GEN_2_dependence#", "", false, true);
            document.Replace("#FAU_GEN_2_1_description#", "", false, true);
            document.Replace("#FAU_SAA_1_hierarchy#", "", false, true);
            document.Replace("#FAU_SAA_1_dependence#", "", false, true);
            document.Replace("#FAU_SAA_1_1_description#", "", false, true);
            document.Replace("#FAU_SAA_1_2_description#", "", false, true);
            document.Replace("#FAU_SAA_2_hierarchy#", "", false, true);
            document.Replace("#FAU_SAA_2_dependence#", "", false, true);
            document.Replace("#FAU_SAA_2_1_description#", "", false, true);
            document.Replace("#FAU_SAA_2_2_description#", "", false, true);
            document.Replace("#FAU_SAA_2_3_description#", "", false, true);
            document.Replace("#FAU_SAA_3_hierarchy#", "", false, true);
            document.Replace("#FAU_SAA_3_dependence#", "", false, true);
            document.Replace("#FAU_SAA_3_1_description#", "", false, true);
            document.Replace("#FAU_SAA_3_2_description#", "", false, true);
            document.Replace("#FAU_SAA_3_3_description#", "", false, true);
            document.Replace("#FAU_SAA_4_hierarchy#", "", false, true);
            document.Replace("#FAU_SAA_4_dependence#", "", false, true);
            document.Replace("#FAU_SAA_4_1_description#", "", false, true);
            document.Replace("#FAU_SAA_4_2_description#", "", false, true);
            document.Replace("#FAU_SAA_4_3_description#", "", false, true);
            document.Replace("#FAU_SAR_1_hierarchy#", "", false, true);
            document.Replace("#FAU_SAR_1_dependence#", "", false, true);
            document.Replace("#FAU_SAR_1_1_description#", "", false, true);
            document.Replace("#FAU_SAR_1_2_description#", "", false, true);
            document.Replace("#FAU_SAR_2_hierarchy#", "", false, true);
            document.Replace("#FAU_SAR_2_dependence#", "", false, true);
            document.Replace("#FAU_SAR_2_1_description#", "", false, true);
            document.Replace("#FAU_SAR_3_hierarchy#", "", false, true);
            document.Replace("#FAU_SAR_3_dependence#", "", false, true);
            document.Replace("#FAU_SAR_3_1_description#", "", false, true);
            document.Replace("#FAU_SEL_1_hierarchy#", "", false, true);
            document.Replace("#FAU_SEL_1_dependence#", "", false, true);
            document.Replace("#FAU_SEL_1_1_description#", "", false, true);
            document.Replace("#FAU_STG_1_hierarchy#", "", false, true);
            document.Replace("#FAU_STG_1_dependence#", "", false, true);
            document.Replace("#FAU_STG_1_1_description#", "", false, true);
            document.Replace("#FAU_STG_1_2_description#", "", false, true);
            document.Replace("#FAU_STG_2_hierarchy#", "", false, true);
            document.Replace("#FAU_STG_2_dependence#", "", false, true);
            document.Replace("#FAU_STG_2_1_description#", "", false, true);
            document.Replace("#FAU_STG_2_2_description#", "", false, true);
            document.Replace("#FAU_STG_2_3_description#", "", false, true);
            document.Replace("#FAU_STG_3_hierarchy#", "", false, true);
            document.Replace("#FAU_STG_3_dependence#", "", false, true);
            document.Replace("#FAU_STG_3_1_description#", "", false, true);
            document.Replace("#FAU_STG_4_hierarchy#", "", false, true);
            document.Replace("#FAU_STG_4_dependence#", "", false, true);
            document.Replace("#FAU_STG_4_1_description#", "", false, true);
            document.Replace("#FCO_NRO_1_hierarchy#", "", false, true);
            document.Replace("#FCO_NRO_1_dependence#", "", false, true);
            document.Replace("#FCO_NRO_1_1_description#", "", false, true);
            document.Replace("#FCO_NRO_1_2_description#", "", false, true);
            document.Replace("#FCO_NRO_1_3_description#", "", false, true);
            document.Replace("#FCO_NRO_2_hierarchy#", "", false, true);
            document.Replace("#FCO_NRO_2_dependence#", "", false, true);
            document.Replace("#FCO_NRO_2_1_description#", "", false, true);
            document.Replace("#FCO_NRO_2_2_description#", "", false, true);
            document.Replace("#FCO_NRO_2_3_description#", "", false, true);
            document.Replace("#FCO_NRR_1_hierarchy#", "", false, true);
            document.Replace("#FCO_NRR_1_dependence#", "", false, true);
            document.Replace("#FCO_NRR_1_1_description#", "", false, true);
            document.Replace("#FCO_NRR_1_2_description#", "", false, true);
            document.Replace("#FCO_NRR_1_3_description#", "", false, true);
            document.Replace("#FCO_NRR_2_hierarchy#", "", false, true);
            document.Replace("#FCO_NRR_2_dependence#", "", false, true);
            document.Replace("#FCO_NRR_2_1_description#", "", false, true);
            document.Replace("#FCO_NRR_2_2_description#", "", false, true);
            document.Replace("#FCO_NRR_2_3_description#", "", false, true);
            document.Replace("#FCS_CKM_1_hierarchy#", "", false, true);
            document.Replace("#FCS_CKM_1_dependence#", "", false, true);
            document.Replace("#FCS_CKM_1_1_description#", "", false, true);
            document.Replace("#FCS_CKM_2_hierarchy#", "", false, true);
            document.Replace("#FCS_CKM_2_dependence#", "", false, true);
            document.Replace("#FCS_CKM_2_1_description#", "", false, true);
            document.Replace("#FCS_CKM_3_hierarchy#", "", false, true);
            document.Replace("#FCS_CKM_3_dependence#", "", false, true);
            document.Replace("#FCS_CKM_3_1_description#", "", false, true);
            document.Replace("#FCS_CKM_4_hierarchy#", "", false, true);
            document.Replace("#FCS_CKM_4_dependence#", "", false, true);
            document.Replace("#FCS_CKM_4_1_description#", "", false, true);
            document.Replace("#FCS_COP_1_hierarchy#", "", false, true);
            document.Replace("#FCS_COP_1_dependence#", "", false, true);
            document.Replace("#FCS_COP_1_1_description#", "", false, true);
            document.Replace("#FDP_ACC_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ACC_1_dependence#", "", false, true);
            document.Replace("#FDP_ACC_1_1_description#", "", false, true);
            document.Replace("#FDP_ACC_2_hierarchy#", "", false, true);
            document.Replace("#FDP_ACC_2_dependence#", "", false, true);
            document.Replace("#FDP_ACC_2_1_description#", "", false, true);
            document.Replace("#FDP_ACC_2_2_description#", "", false, true);
            document.Replace("#FDP_ACF_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ACF_1_dependence#", "", false, true);
            document.Replace("#FDP_ACF_1_1_description#", "", false, true);
            document.Replace("#FDP_ACF_1_2_description#", "", false, true);
            document.Replace("#FDP_ACF_1_3_description#", "", false, true);
            document.Replace("#FDP_ACF_1_4_description#", "", false, true);
            document.Replace("#FDP_DAU_1_hierarchy#", "", false, true);
            document.Replace("#FDP_DAU_1_dependence#", "", false, true);
            document.Replace("#FDP_DAU_1_1_description#", "", false, true);
            document.Replace("#FDP_DAU_1_2_description#", "", false, true);
            document.Replace("#FDP_DAU_2_hierarchy#", "", false, true);
            document.Replace("#FDP_DAU_2_dependence#", "", false, true);
            document.Replace("#FDP_DAU_2_1_description#", "", false, true);
            document.Replace("#FDP_DAU_2_2_description#", "", false, true);
            document.Replace("#FDP_ETC_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ETC_1_dependence#", "", false, true);
            document.Replace("#FDP_ETC_1_1_description#", "", false, true);
            document.Replace("#FDP_ETC_1_2_description#", "", false, true);
            document.Replace("#FDP_ETC_2_hierarchy#", "", false, true);
            document.Replace("#FDP_ETC_2_dependence#", "", false, true);
            document.Replace("#FDP_ETC_2_1_description#", "", false, true);
            document.Replace("#FDP_ETC_2_2_description#", "", false, true);
            document.Replace("#FDP_ETC_2_3_description#", "", false, true);
            document.Replace("#FDP_ETC_2_4_description#", "", false, true);
            document.Replace("#FDP_IFC_1_hierarchy#", "", false, true);
            document.Replace("#FDP_IFC_1_dependence#", "", false, true);
            document.Replace("#FDP_IFC_1_1_description#", "", false, true);
            document.Replace("#FDP_IFC_2_hierarchy#", "", false, true);
            document.Replace("#FDP_IFC_2_dependence#", "", false, true);
            document.Replace("#FDP_IFC_2_1_description#", "", false, true);
            document.Replace("#FDP_IFC_2_2_description#", "", false, true);
            document.Replace("#FDP_IFF_1_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_1_dependence#", "", false, true);
            document.Replace("#FDP_IFF_1_1_description#", "", false, true);
            document.Replace("#FDP_IFF_1_2_description#", "", false, true);
            document.Replace("#FDP_IFF_1_3_description#", "", false, true);
            document.Replace("#FDP_IFF_1_4_description#", "", false, true);
            document.Replace("#FDP_IFF_1_5_description#", "", false, true);
            document.Replace("#FDP_IFF_1_6_description#", "", false, true);
            document.Replace("#FDP_IFF_2_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_2_dependence#", "", false, true);
            document.Replace("#FDP_IFF_2_1_description#", "", false, true);
            document.Replace("#FDP_IFF_2_2_description#", "", false, true);
            document.Replace("#FDP_IFF_2_3_description#", "", false, true);
            document.Replace("#FDP_IFF_2_4_description#", "", false, true);
            document.Replace("#FDP_IFF_2_5_description#", "", false, true);
            document.Replace("#FDP_IFF_2_6_description#", "", false, true);
            document.Replace("#FDP_IFF_3_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_3_dependence#", "", false, true);
            document.Replace("#FDP_IFF_3_1_description#", "", false, true);
            document.Replace("#FDP_IFF_4_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_4_dependence#", "", false, true);
            document.Replace("#FDP_IFF_4_1_description#", "", false, true);
            document.Replace("#FDP_IFF_4_2_description#", "", false, true);
            document.Replace("#FDP_IFF_5_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_5_dependence#", "", false, true);
            document.Replace("#FDP_IFF_5_1_description#", "", false, true);
            document.Replace("#FDP_IFF_6_hierarchy#", "", false, true);
            document.Replace("#FDP_IFF_6_dependence#", "", false, true);
            document.Replace("#FDP_IFF_6_1_description#", "", false, true);
            document.Replace("#FDP_ITC_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ITC_1_dependence#", "", false, true);
            document.Replace("#FDP_ITC_1_1_description#", "", false, true);
            document.Replace("#FDP_ITC_1_2_description#", "", false, true);
            document.Replace("#FDP_ITC_1_3_description#", "", false, true);
            document.Replace("#FDP_ITC_2_hierarchy#", "", false, true);
            document.Replace("#FDP_ITC_2_dependence#", "", false, true);
            document.Replace("#FDP_ITC_2_1_description#", "", false, true);
            document.Replace("#FDP_ITC_2_2_description#", "", false, true);
            document.Replace("#FDP_ITC_2_3_description#", "", false, true);
            document.Replace("#FDP_ITC_2_4_description#", "", false, true);
            document.Replace("#FDP_ITC_2_5_description#", "", false, true);
            document.Replace("#FDP_ITT_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ITT_1_dependence#", "", false, true);
            document.Replace("#FDP_ITT_1_1_description#", "", false, true);
            document.Replace("#FDP_ITT_2_hierarchy#", "", false, true);
            document.Replace("#FDP_ITT_2_dependence#", "", false, true);
            document.Replace("#FDP_ITT_2_1_description#", "", false, true);
            document.Replace("#FDP_ITT_2_2_description#", "", false, true);
            document.Replace("#FDP_ITT_3_hierarchy#", "", false, true);
            document.Replace("#FDP_ITT_3_dependence#", "", false, true);
            document.Replace("#FDP_ITT_3_1_description#", "", false, true);
            document.Replace("#FDP_ITT_3_2_description#", "", false, true);
            document.Replace("#FDP_ITT_4_hierarchy#", "", false, true);
            document.Replace("#FDP_ITT_4_dependence#", "", false, true);
            document.Replace("#FDP_ITT_4_1_description#", "", false, true);
            document.Replace("#FDP_ITT_4_2_description#", "", false, true);
            document.Replace("#FDP_RIP_1_hierarchy#", "", false, true);
            document.Replace("#FDP_RIP_1_dependence#", "", false, true);
            document.Replace("#FDP_RIP_1_1_description#", "", false, true);
            document.Replace("#FDP_RIP_2_hierarchy#", "", false, true);
            document.Replace("#FDP_RIP_2_dependence#", "", false, true);
            document.Replace("#FDP_RIP_2_1_description#", "", false, true);
            document.Replace("#FDP_ROL_1_hierarchy#", "", false, true);
            document.Replace("#FDP_ROL_1_dependence#", "", false, true);
            document.Replace("#FDP_ROL_1_1_description#", "", false, true);
            document.Replace("#FDP_ROL_2_hierarchy#", "", false, true);
            document.Replace("#FDP_ROL_2_dependence#", "", false, true);
            document.Replace("#FDP_ROL_2_1_description#", "", false, true);
            document.Replace("#FDP_SDI_1_hierarchy#", "", false, true);
            document.Replace("#FDP_SDI_1_dependence#", "", false, true);
            document.Replace("#FDP_SDI_1_1_description#", "", false, true);
            document.Replace("#FDP_SDI_2_hierarchy#", "", false, true);
            document.Replace("#FDP_SDI_2_dependence#", "", false, true);
            document.Replace("#FDP_SDI_2_1_description#", "", false, true);
            document.Replace("#FDP_SDI_2_2_description#", "", false, true);
            document.Replace("#FDP_UCT_1_hierarchy#", "", false, true);
            document.Replace("#FDP_UCT_1_dependence#", "", false, true);
            document.Replace("#FDP_UCT_1_1_description#", "", false, true);
            document.Replace("#FDP_UIT_1_hierarchy#", "", false, true);
            document.Replace("#FDP_UIT_1_dependence#", "", false, true);
            document.Replace("#FDP_UIT_1_1_description#", "", false, true);
            document.Replace("#FDP_UIT_1_2_description#", "", false, true);
            document.Replace("#FDP_UIT_2_hierarchy#", "", false, true);
            document.Replace("#FDP_UIT_2_dependence#", "", false, true);
            document.Replace("#FDP_UIT_2_1_description#", "", false, true);
            document.Replace("#FDP_UIT_3_hierarchy#", "", false, true);
            document.Replace("#FDP_UIT_3_dependence#", "", false, true);
            document.Replace("#FDP_UIT_3_1_description#", "", false, true);
            document.Replace("#FIA_AFL_1_hierarchy#", "", false, true);
            document.Replace("#FIA_AFL_1_dependence#", "", false, true);
            document.Replace("#FIA_AFL_1_1_description#", "", false, true);
            document.Replace("#FIA_AFL_1_2_description#", "", false, true);
            document.Replace("#FIA_ATD_1_hierarchy#", "", false, true);
            document.Replace("#FIA_ATD_1_dependence#", "", false, true);
            document.Replace("#FIA_ATD_1_1_description#", "", false, true);
            document.Replace("#FIA_SOS_1_hierarchy#", "", false, true);
            document.Replace("#FIA_SOS_1_dependence#", "", false, true);
            document.Replace("#FIA_SOS_1_1_description#", "", false, true);
            document.Replace("#FIA_SOS_2_hierarchy#", "", false, true);
            document.Replace("#FIA_SOS_2_dependence#", "", false, true);
            document.Replace("#FIA_SOS_2_1_description#", "", false, true);
            document.Replace("#FIA_SOS_2_2_description#", "", false, true);
            document.Replace("#FIA_UAU_1_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_1_dependence#", "", false, true);
            document.Replace("#FIA_UAU_1_1_description#", "", false, true);
            document.Replace("#FIA_UAU_1_2_description#", "", false, true);
            document.Replace("#FIA_UAU_2_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_2_dependence#", "", false, true);
            document.Replace("#FIA_UAU_2_1_description#", "", false, true);
            document.Replace("#FIA_UAU_3_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_3_dependence#", "", false, true);
            document.Replace("#FIA_UAU_3_1_description#", "", false, true);
            document.Replace("#FIA_UAU_3_2_description#", "", false, true);
            document.Replace("#FIA_UAU_4_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_4_dependence#", "", false, true);
            document.Replace("#FIA_UAU_4_1_description#", "", false, true);
            document.Replace("#FIA_UAU_5_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_5_dependence#", "", false, true);
            document.Replace("#FIA_UAU_5_1_description#", "", false, true);
            document.Replace("#FIA_UAU_5_2_description#", "", false, true);
            document.Replace("#FIA_UAU_6_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_6_dependence#", "", false, true);
            document.Replace("#FIA_UAU_6_1_description#", "", false, true);
            document.Replace("#FIA_UAU_7_hierarchy#", "", false, true);
            document.Replace("#FIA_UAU_7_dependence#", "", false, true);
            document.Replace("#FIA_UAU_7_1_description#", "", false, true);
            document.Replace("#FIA_UID_1_hierarchy#", "", false, true);
            document.Replace("#FIA_UID_1_dependence#", "", false, true);
            document.Replace("#FIA_UID_1_1_description#", "", false, true);
            document.Replace("#FIA_UID_1_2_description#", "", false, true);
            document.Replace("#FIA_UID_2_hierarchy#", "", false, true);
            document.Replace("#FIA_UID_2_dependence#", "", false, true);
            document.Replace("#FIA_UID_2_1_description#", "", false, true);
            document.Replace("#FIA_USB_1_hierarchy#", "", false, true);
            document.Replace("#FIA_USB_1_dependence#", "", false, true);
            document.Replace("#FIA_USB_1_1_description#", "", false, true);
            document.Replace("#FIA_USB_1_2_description#", "", false, true);
            document.Replace("#FIA_USB_1_3_description#", "", false, true);
            document.Replace("#FMT_MOF_1_hierarchy#", "", false, true);
            document.Replace("#FMT_MOF_1_dependence#", "", false, true);
            document.Replace("#FMT_MOF_1_1_description#", "", false, true);
            document.Replace("#FMT_MSA_1_hierarchy#", "", false, true);
            document.Replace("#FMT_MSA_1_dependence#", "", false, true);
            document.Replace("#FMT_MSA_1_1_description#", "", false, true);
            document.Replace("#FMT_MSA_2_hierarchy#", "", false, true);
            document.Replace("#FMT_MSA_2_dependence#", "", false, true);
            document.Replace("#FMT_MSA_2_1_description#", "", false, true);
            document.Replace("#FMT_MSA_3_hierarchy#", "", false, true);
            document.Replace("#FMT_MSA_3_dependence#", "", false, true);
            document.Replace("#FMT_MSA_3_1_description#", "", false, true);
            document.Replace("#FMT_MSA_3_2_description#", "", false, true);
            document.Replace("#FMT_MSA_4_hierarchy#", "", false, true);
            document.Replace("#FMT_MSA_4_dependence#", "", false, true);
            document.Replace("#FMT_MSA_4_1_description#", "", false, true);
            document.Replace("#FMT_MTD_1_hierarchy#", "", false, true);
            document.Replace("#FMT_MTD_1_dependence#", "", false, true);
            document.Replace("#FMT_MTD_1_1_description#", "", false, true);
            document.Replace("#FMT_MTD_2_hierarchy#", "", false, true);
            document.Replace("#FMT_MTD_2_dependence#", "", false, true);
            document.Replace("#FMT_MTD_2_1_description#", "", false, true);
            document.Replace("#FMT_MTD_2_2_description#", "", false, true);
            document.Replace("#FMT_MTD_3_hierarchy#", "", false, true);
            document.Replace("#FMT_MTD_3_dependence#", "", false, true);
            document.Replace("#FMT_MTD_3_1_description#", "", false, true);
            document.Replace("#FMT_REV_1_hierarchy#", "", false, true);
            document.Replace("#FMT_REV_1_dependence#", "", false, true);
            document.Replace("#FMT_REV_1_1_description#", "", false, true);
            document.Replace("#FMT_REV_1_2_description#", "", false, true);
            document.Replace("#FMT_SAE_1_hierarchy#", "", false, true);
            document.Replace("#FMT_SAE_1_dependence#", "", false, true);
            document.Replace("#FMT_SAE_1_1_description#", "", false, true);
            document.Replace("#FMT_SAE_1_2_description#", "", false, true);
            document.Replace("#FMT_SMF_1_hierarchy#", "", false, true);
            document.Replace("#FMT_SMF_1_dependence#", "", false, true);
            document.Replace("#FMT_SMF_1_1_description#", "", false, true);
            document.Replace("#FMT_SMR_1_hierarchy#", "", false, true);
            document.Replace("#FMT_SMR_1_dependence#", "", false, true);
            document.Replace("#FMT_SMR_1_1_description#", "", false, true);
            document.Replace("#FMT_SMR_1_2_description#", "", false, true);
            document.Replace("#FMT_SMR_2_hierarchy#", "", false, true);
            document.Replace("#FMT_SMR_2_dependence#", "", false, true);
            document.Replace("#FMT_SMR_2_1_description#", "", false, true);
            document.Replace("#FMT_SMR_2_2_description#", "", false, true);
            document.Replace("#FMT_SMR_2_3_description#", "", false, true);
            document.Replace("#FMT_SMR_3_hierarchy#", "", false, true);
            document.Replace("#FMT_SMR_3_dependence#", "", false, true);
            document.Replace("#FMT_SMR_3_1_description#", "", false, true);
            document.Replace("#FPR_ANO_1_hierarchy#", "", false, true);
            document.Replace("#FPR_ANO_1_dependence#", "", false, true);
            document.Replace("#FPR_ANO_1_1_description#", "", false, true);
            document.Replace("#FPR_ANO_2_hierarchy#", "", false, true);
            document.Replace("#FPR_ANO_2_dependence#", "", false, true);
            document.Replace("#FPR_ANO_2_1_description#", "", false, true);
            document.Replace("#FPR_ANO_2_2_description#", "", false, true);
            document.Replace("#FPR_PSE_1_hierarchy#", "", false, true);
            document.Replace("#FPR_PSE_1_dependence#", "", false, true);
            document.Replace("#FPR_PSE_1_1_description#", "", false, true);
            document.Replace("#FPR_PSE_1_2_description#", "", false, true);
            document.Replace("#FPR_PSE_1_3_description#", "", false, true);
            document.Replace("#FPR_PSE_2_hierarchy#", "", false, true);
            document.Replace("#FPR_PSE_2_dependence#", "", false, true);
            document.Replace("#FPR_PSE_2_1_description#", "", false, true);
            document.Replace("#FPR_PSE_2_2_description#", "", false, true);
            document.Replace("#FPR_PSE_2_3_description#", "", false, true);
            document.Replace("#FPR_PSE_2_4_description#", "", false, true);
            document.Replace("#FPR_PSE_3_hierarchy#", "", false, true);
            document.Replace("#FPR_PSE_3_dependence#", "", false, true);
            document.Replace("#FPR_PSE_3_1_description#", "", false, true);
            document.Replace("#FPR_PSE_3_2_description#", "", false, true);
            document.Replace("#FPR_PSE_3_3_description#", "", false, true);
            document.Replace("#FPR_PSE_3_4_description#", "", false, true);
            document.Replace("#FPR_UNL_1_hierarchy#", "", false, true);
            document.Replace("#FPR_UNL_1_dependence#", "", false, true);
            document.Replace("#FPR_UNL_1_1_description#", "", false, true);
            document.Replace("#FPR_UNO_1_hierarchy#", "", false, true);
            document.Replace("#FPR_UNO_1_dependence#", "", false, true);
            document.Replace("#FPR_UNO_1_1_description#", "", false, true);
            document.Replace("#FPR_UNO_2_hierarchy#", "", false, true);
            document.Replace("#FPR_UNO_2_dependence#", "", false, true);
            document.Replace("#FPR_UNO_2_1_description#", "", false, true);
            document.Replace("#FPR_UNO_2_2_description#", "", false, true);
            document.Replace("#FPR_UNO_3_hierarchy#", "", false, true);
            document.Replace("#FPR_UNO_3_dependence#", "", false, true);
            document.Replace("#FPR_UNO_3_1_description#", "", false, true);
            document.Replace("#FPR_UNO_4_hierarchy#", "", false, true);
            document.Replace("#FPR_UNO_4_dependence#", "", false, true);
            document.Replace("#FPR_UNO_4_1_description#", "", false, true);
            document.Replace("#FPT_FLS_1_hierarchy#", "", false, true);
            document.Replace("#FPT_FLS_1_dependence#", "", false, true);
            document.Replace("#FPT_FLS_1_1_description#", "", false, true);
            document.Replace("#FPT_ITA_1_hierarchy#", "", false, true);
            document.Replace("#FPT_ITA_1_dependence#", "", false, true);
            document.Replace("#FPT_ITA_1_1_description#", "", false, true);
            document.Replace("#FPT_ITC_1_hierarchy#", "", false, true);
            document.Replace("#FPT_ITC_1_dependence#", "", false, true);
            document.Replace("#FPT_ITC_1_1_description#", "", false, true);
            document.Replace("#FPT_ITI_1_hierarchy#", "", false, true);
            document.Replace("#FPT_ITI_1_dependence#", "", false, true);
            document.Replace("#FPT_ITI_1_1_description#", "", false, true);
            document.Replace("#FPT_ITI_1_2_description#", "", false, true);
            document.Replace("#FPT_ITI_2_hierarchy#", "", false, true);
            document.Replace("#FPT_ITI_2_dependence#", "", false, true);
            document.Replace("#FPT_ITI_2_1_description#", "", false, true);
            document.Replace("#FPT_ITI_2_2_description#", "", false, true);
            document.Replace("#FPT_ITI_2_3_description#", "", false, true);
            document.Replace("#FPT_ITT_1_hierarchy#", "", false, true);
            document.Replace("#FPT_ITT_1_dependence#", "", false, true);
            document.Replace("#FPT_ITT_1_1_description#", "", false, true);
            document.Replace("#FPT_ITT_2_hierarchy#", "", false, true);
            document.Replace("#FPT_ITT_2_dependence#", "", false, true);
            document.Replace("#FPT_ITT_2_1_description#", "", false, true);
            document.Replace("#FPT_ITT_2_2_description#", "", false, true);
            document.Replace("#FPT_ITT_3_hierarchy#", "", false, true);
            document.Replace("#FPT_ITT_3_dependence#", "", false, true);
            document.Replace("#FPT_ITT_3_1_description#", "", false, true);
            document.Replace("#FPT_ITT_3_2_description#", "", false, true);
            document.Replace("#FPT_PHP_1_hierarchy#", "", false, true);
            document.Replace("#FPT_PHP_1_dependence#", "", false, true);
            document.Replace("#FPT_PHP_1_1_description#", "", false, true);
            document.Replace("#FPT_PHP_1_2_description#", "", false, true);
            document.Replace("#FPT_PHP_2_hierarchy#", "", false, true);
            document.Replace("#FPT_PHP_2_dependence#", "", false, true);
            document.Replace("#FPT_PHP_2_1_description#", "", false, true);
            document.Replace("#FPT_PHP_2_2_description#", "", false, true);
            document.Replace("#FPT_PHP_2_3_description#", "", false, true);
            document.Replace("#FPT_PHP_3_hierarchy#", "", false, true);
            document.Replace("#FPT_PHP_3_dependence#", "", false, true);
            document.Replace("#FPT_PHP_3_1_description#", "", false, true);
            document.Replace("#FPT_RCV_1_hierarchy#", "", false, true);
            document.Replace("#FPT_RCV_1_dependence#", "", false, true);
            document.Replace("#FPT_RCV_1_1_description#", "", false, true);
            document.Replace("#FPT_RCV_2_hierarchy#", "", false, true);
            document.Replace("#FPT_RCV_2_dependence#", "", false, true);
            document.Replace("#FPT_RCV_2_1_description#", "", false, true);
            document.Replace("#FPT_RCV_2_2_description#", "", false, true);
            document.Replace("#FPT_RCV_3_hierarchy#", "", false, true);
            document.Replace("#FPT_RCV_3_dependence#", "", false, true);
            document.Replace("#FPT_RCV_3_1_description#", "", false, true);
            document.Replace("#FPT_RCV_3_2_description#", "", false, true);
            document.Replace("#FPT_RCV_3_3_description#", "", false, true);
            document.Replace("#FPT_RCV_3_4_description#", "", false, true);
            document.Replace("#FPT_RCV_4_hierarchy#", "", false, true);
            document.Replace("#FPT_RCV_4_dependence#", "", false, true);
            document.Replace("#FPT_RCV_4_1_description#", "", false, true);
            document.Replace("#FPT_RPL_1_hierarchy#", "", false, true);
            document.Replace("#FPT_RPL_1_dependence#", "", false, true);
            document.Replace("#FPT_RPL_1_1_description#", "", false, true);
            document.Replace("#FPT_RPL_1_2_description#", "", false, true);
            document.Replace("#FPT_SSP_1_hierarchy#", "", false, true);
            document.Replace("#FPT_SSP_1_dependence#", "", false, true);
            document.Replace("#FPT_SSP_1_1_description#", "", false, true);
            document.Replace("#FPT_SSP_2_hierarchy#", "", false, true);
            document.Replace("#FPT_SSP_2_dependence#", "", false, true);
            document.Replace("#FPT_SSP_2_1_description#", "", false, true);
            document.Replace("#FPT_SSP_2_2_description#", "", false, true);
            document.Replace("#FPT_STM_1_hierarchy#", "", false, true);
            document.Replace("#FPT_STM_1_dependence#", "", false, true);
            document.Replace("#FPT_STM_1_1_description#", "", false, true);
            document.Replace("#FPT_TDC_1_hierarchy#", "", false, true);
            document.Replace("#FPT_TDC_1_dependence#", "", false, true);
            document.Replace("#FPT_TDC_1_1_description#", "", false, true);
            document.Replace("#FPT_TDC_1_2_description#", "", false, true);
            document.Replace("#FPT_TRC_1_hierarchy#", "", false, true);
            document.Replace("#FPT_TRC_1_dependence#", "", false, true);
            document.Replace("#FPT_TRC_1_1_description#", "", false, true);
            document.Replace("#FPT_TRC_1_2_description#", "", false, true);
            document.Replace("#FPT_TST_1_hierarchy#", "", false, true);
            document.Replace("#FPT_TST_1_dependence#", "", false, true);
            document.Replace("#FPT_TST_1_1_description#", "", false, true);
            document.Replace("#FPT_TST_1_2_description#", "", false, true);
            document.Replace("#FPT_TST_1_3_description#", "", false, true);
            document.Replace("#FRU_FLT_1_hierarchy#", "", false, true);
            document.Replace("#FRU_FLT_1_dependence#", "", false, true);
            document.Replace("#FRU_FLT_1_1_description#", "", false, true);
            document.Replace("#FRU_FLT_2_hierarchy#", "", false, true);
            document.Replace("#FRU_FLT_2_dependence#", "", false, true);
            document.Replace("#FRU_FLT_2_1_description#", "", false, true);
            document.Replace("#FRU_PRS_1_hierarchy#", "", false, true);
            document.Replace("#FRU_PRS_1_dependence#", "", false, true);
            document.Replace("#FRU_PRS_1_1_description#", "", false, true);
            document.Replace("#FRU_PRS_1_2_description#", "", false, true);
            document.Replace("#FRU_PRS_2_hierarchy#", "", false, true);
            document.Replace("#FRU_PRS_2_dependence#", "", false, true);
            document.Replace("#FRU_PRS_2_1_description#", "", false, true);
            document.Replace("#FRU_PRS_2_2_description#", "", false, true);
            document.Replace("#FRU_RSA_1_hierarchy#", "", false, true);
            document.Replace("#FRU_RSA_1_dependence#", "", false, true);
            document.Replace("#FRU_RSA_1_1_description#", "", false, true);
            document.Replace("#FRU_RSA_2_hierarchy#", "", false, true);
            document.Replace("#FRU_RSA_2_dependence#", "", false, true);
            document.Replace("#FRU_RSA_2_1_description#", "", false, true);
            document.Replace("#FRU_RSA_2_2_description#", "", false, true);
            document.Replace("#FTA_LSA_1_hierarchy#", "", false, true);
            document.Replace("#FTA_LSA_1_dependence#", "", false, true);
            document.Replace("#FTA_LSA_1_1_description#", "", false, true);
            document.Replace("#FTA_MCS_1_hierarchy#", "", false, true);
            document.Replace("#FTA_MCS_1_dependence#", "", false, true);
            document.Replace("#FTA_MCS_1_1_description#", "", false, true);
            document.Replace("#FTA_MCS_1_2_description#", "", false, true);
            document.Replace("#FTA_MCS_2_hierarchy#", "", false, true);
            document.Replace("#FTA_MCS_2_dependence#", "", false, true);
            document.Replace("#FTA_MCS_2_1_description#", "", false, true);
            document.Replace("#FTA_MCS_2_2_description#", "", false, true);
            document.Replace("#FTA_SSL_1_hierarchy#", "", false, true);
            document.Replace("#FTA_SSL_1_dependence#", "", false, true);
            document.Replace("#FTA_SSL_1_1_description#", "", false, true);
            document.Replace("#FTA_SSL_1_2_description#", "", false, true);
            document.Replace("#FTA_SSL_2_hierarchy#", "", false, true);
            document.Replace("#FTA_SSL_2_dependence#", "", false, true);
            document.Replace("#FTA_SSL_2_1_description#", "", false, true);
            document.Replace("#FTA_SSL_2_2_description#", "", false, true);
            document.Replace("#FTA_SSL_3_hierarchy#", "", false, true);
            document.Replace("#FTA_SSL_3_dependence#", "", false, true);
            document.Replace("#FTA_SSL_3_1_description#", "", false, true);
            document.Replace("#FTA_SSL_4_hierarchy#", "", false, true);
            document.Replace("#FTA_SSL_4_dependence#", "", false, true);
            document.Replace("#FTA_SSL_4_1_description#", "", false, true);
            document.Replace("#FTA_TAB_1_hierarchy#", "", false, true);
            document.Replace("#FTA_TAB_1_dependence#", "", false, true);
            document.Replace("#FTA_TAB_1_1_description#", "", false, true);
            document.Replace("#FTA_TAH_1_hierarchy#", "", false, true);
            document.Replace("#FTA_TAH_1_dependence#", "", false, true);
            document.Replace("#FTA_TAH_1_1_description#", "", false, true);
            document.Replace("#FTA_TAH_1_2_description#", "", false, true);
            document.Replace("#FTA_TAH_1_3_description#", "", false, true);
            document.Replace("#FTA_TSE_1_hierarchy#", "", false, true);
            document.Replace("#FTA_TSE_1_dependence#", "", false, true);
            document.Replace("#FTA_TSE_1_1_description#", "", false, true);
            document.Replace("#FTP_ITC_1_hierarchy#", "", false, true);
            document.Replace("#FTP_ITC_1_dependence#", "", false, true);
            document.Replace("#FTP_ITC_1_1_description#", "", false, true);
            document.Replace("#FTP_ITC_1_2_description#", "", false, true);
            document.Replace("#FTP_ITC_1_3_description#", "", false, true);
            document.Replace("#FTP_TRP_1_hierarchy#", "", false, true);
            document.Replace("#FTP_TRP_1_dependence#", "", false, true);
            document.Replace("#FTP_TRP_1_1_description#", "", false, true);
            document.Replace("#FTP_TRP_1_2_description#", "", false, true);
            document.Replace("#FTP_TRP_1_3_description#", "", false, true);

            document.SaveToFile(docxPath, FileFormat.Docx);

            document.Close();
           

            //Aspose.Words.Document doc = new Aspose.Words.Document(docxPath);

            // foreach (Aspose.Words.Tables.Table table in doc.GetChildNodes(NodeType.Table, true))
           //  {
            //     foreach (Row row in table.Rows)
             //    {
            //         if (string.IsNullOrEmpty(row.ToString(SaveFormat.Text).Trim())) { 
            //             row.Remove();

             //        }
             //    }
            // }

            // doc.Save(docxPath1 + "Result_1.docx");
            
            Process.Start("explorer.exe", docxPath);
        }

        Dictionary<string, string> GetReplaceDictionary_1()
        {
            Dictionary<string, string> replaceDict = new Dictionary<string, string>();

            if (items.Contains("FAU_ARP.1"))
            {                
                replaceDict.Add("#FAU_ARP_1#", FAU_ARP_1);
                replaceDict.Add("#FAU_ARP_1_hierarchy#", FAU_ARP_1_hierarchy);
                replaceDict.Add("#FAU_ARP_1_dependence#", FAU_ARP_1_dependence);
                replaceDict.Add("#FAU_ARP_1_1#", FAU_ARP_1_1);
                replaceDict.Add("#FAU_ARP_1_1_description#", FAU_ARP_1_1_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_GEN.1"))
            {
                replaceDict.Add("#FAU_GEN_1#", FAU_GEN_1);
                replaceDict.Add("#FAU_GEN_1_hierarchy#", FAU_GEN_1_hierarchy);
                replaceDict.Add("#FAU_GEN_1_dependence#", FAU_GEN_1_dependence);
                replaceDict.Add("#FAU_GEN_1_1#", FAU_GEN_1_1);
                replaceDict.Add("#FAU_GEN_1_1_description#", FAU_GEN_1_1_description);
                replaceDict.Add("#FAU_GEN_1_2#", FAU_GEN_1_2);
                replaceDict.Add("#FAU_GEN_1_2_description#", FAU_GEN_1_2_description);
            }
            else if (items is null){ }
            else { }


            if (items.Contains("FAU_GEN.2"))
            {
                replaceDict.Add("#FAU_GEN_2#", FAU_GEN_2);
                replaceDict.Add("#FAU_GEN_2_hierarchy#", FAU_GEN_2_hierarchy);
                replaceDict.Add("#FAU_GEN_2_dependence#", FAU_GEN_2_dependence);
                replaceDict.Add("#FAU_GEN_2_1#", FAU_GEN_2_1);
                replaceDict.Add("#FAU_GEN_2_1_description#", FAU_GEN_2_1_description);

            }
            else if (items is null) { }
            else { }

            if (items.Contains("FAU_SAA.1"))
            {
                replaceDict.Add("#FAU_SAA_1#", FAU_SAA_1);
                replaceDict.Add("#FAU_SAA_1_hierarchy#", FAU_SAA_1_hierarchy);
                replaceDict.Add("#FAU_SAA_1_dependence#", FAU_SAA_1_dependence);
                replaceDict.Add("#FAU_SAA_1_1#", FAU_SAA_1_1);
                replaceDict.Add("#FAU_SAA_1_1_description#", FAU_SAA_1_1_description);
                replaceDict.Add("#FAU_SAA_1_2#", FAU_SAA_1_2);
                replaceDict.Add("#FAU_SAA_1_2_description#", FAU_SAA_1_2_description);
            }
            else if (items is null) { }
            else { }

            if (items.Contains("FAU_SAA.2"))
            {
                replaceDict.Add("#FAU_SAA_2#", FAU_SAA_2);
                replaceDict.Add("#FAU_SAA_2_hierarchy#", FAU_SAA_2_hierarchy);
                replaceDict.Add("#FAU_SAA_2_dependence#", FAU_SAA_2_dependence);
                replaceDict.Add("#FAU_SAA_2_1#", FAU_SAA_2_1);
                replaceDict.Add("#FAU_SAA_2_1_description#", FAU_SAA_2_1_description);
                replaceDict.Add("#FAU_SAA_2_2#", FAU_SAA_2_2);
                replaceDict.Add("#FAU_SAA_2_2_description#", FAU_SAA_2_2_description);
                replaceDict.Add("#FAU_SAA_2_3#", FAU_SAA_2_3);
                replaceDict.Add("#FAU_SAA_2_3_description#", FAU_SAA_2_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_SAA.3"))
            {
                replaceDict.Add("#FAU_SAA_3#", FAU_SAA_3);
                replaceDict.Add("#FAU_SAA_3_hierarchy#", FAU_SAA_3_hierarchy);
                replaceDict.Add("#FAU_SAA_3_dependence#", FAU_SAA_3_dependence);
                replaceDict.Add("#FAU_SAA_3_1#", FAU_SAA_3_1);
                replaceDict.Add("#FAU_SAA_3_1_description#", FAU_SAA_3_1_description);
                replaceDict.Add("#FAU_SAA_3_2#", FAU_SAA_3_2);
                replaceDict.Add("#FAU_SAA_3_2_description#", FAU_SAA_3_2_description);
                replaceDict.Add("#FAU_SAA_3_3#", FAU_SAA_3_3);
                replaceDict.Add("#FAU_SAA_3_3_description#", FAU_SAA_3_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_SAA.4"))
            {
                replaceDict.Add("#FAU_SAA_4#", FAU_SAA_4);
                replaceDict.Add("#FAU_SAA_4_hierarchy#", FAU_SAA_4_hierarchy);
                replaceDict.Add("#FAU_SAA_4_dependence#", FAU_SAA_4_dependence);
                replaceDict.Add("#FAU_SAA_4_1#", FAU_SAA_4_1);
                replaceDict.Add("#FAU_SAA_4_1_description#", FAU_SAA_4_1_description);
                replaceDict.Add("#FAU_SAA_4_2#", FAU_SAA_4_2);
                replaceDict.Add("#FAU_SAA_4_2_description#", FAU_SAA_4_2_description);
                replaceDict.Add("#FAU_SAA_4_3#", FAU_SAA_4_3);
                replaceDict.Add("#FAU_SAA_4_3_description#", FAU_SAA_4_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_SAR.1"))
            {
                replaceDict.Add("#FAU_SAR_1#", FAU_SAR_1);
                replaceDict.Add("#FAU_SAR_1_hierarchy#", FAU_SAR_1_hierarchy);
                replaceDict.Add("#FAU_SAR_1_dependence#", FAU_SAR_1_dependence);
                replaceDict.Add("#FAU_SAR_1_1#", FAU_SAR_1_1);
                replaceDict.Add("#FAU_SAR_1_1_description#", FAU_SAR_1_1_description);
                replaceDict.Add("#FAU_SAR_1_2#", FAU_SAR_1_2);
                replaceDict.Add("#FAU_SAR_1_2_description#", FAU_SAR_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_SAR.2"))
            {
                replaceDict.Add("#FAU_SAR_2#", FAU_SAR_2);
                replaceDict.Add("#FAU_SAR_2_hierarchy#", FAU_SAR_2_hierarchy);
                replaceDict.Add("#FAU_SAR_2_dependence#", FAU_SAR_2_dependence);
                replaceDict.Add("#FAU_SAR_2_1#", FAU_SAR_2_1);
                replaceDict.Add("#FAU_SAR_2_1_description#", FAU_SAR_2_1_description);
   
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FAU_SAR.3"))
            {
                replaceDict.Add("#FAU_SAR_3#", FAU_SAR_3);
                replaceDict.Add("#FAU_SAR_3_hierarchy#", FAU_SAR_3_hierarchy);
                replaceDict.Add("#FAU_SAR_3_dependence#", FAU_SAR_3_dependence);
                replaceDict.Add("#FAU_SAR_3_1#", FAU_SAR_3_1);
                replaceDict.Add("#FAU_SAR_3_1_description#", FAU_SAR_3_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FAU_SEL.1"))
            {
                replaceDict.Add("#FAU_SEL_1#", FAU_SEL_1);
                replaceDict.Add("#FAU_SEL_1_hierarchy#", FAU_SEL_1_hierarchy);
                replaceDict.Add("#FAU_SEL_1_dependence#", FAU_SEL_1_dependence);
                replaceDict.Add("#FAU_SEL_1_1#", FAU_SEL_1_1);
                replaceDict.Add("#FAU_SEL_1_1_description#", FAU_SEL_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_STG.1"))
            {
                replaceDict.Add("#FAU_STG_1#", FAU_STG_1);
                replaceDict.Add("#FAU_STG_1_hierarchy#", FAU_STG_1_hierarchy);
                replaceDict.Add("#FAU_STG_1_dependence#", FAU_STG_1_dependence);
                replaceDict.Add("#FAU_STG_1_1#", FAU_STG_1_1);
                replaceDict.Add("#FAU_STG_1_1_description#", FAU_STG_1_1_description);
                replaceDict.Add("#FAU_STG_1_2#", FAU_STG_1_2);
                replaceDict.Add("#FAU_STG_1_2_description#", FAU_STG_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_STG.2"))
            {
                replaceDict.Add("#FAU_STG_2#", FAU_STG_2);
                replaceDict.Add("#FAU_STG_2_hierarchy#", FAU_STG_2_hierarchy);
                replaceDict.Add("#FAU_STG_2_dependence#", FAU_STG_2_dependence);
                replaceDict.Add("#FAU_STG_2_1#", FAU_STG_2_1);
                replaceDict.Add("#FAU_STG_2_1_description#", FAU_STG_2_1_description);
                replaceDict.Add("#FAU_STG_2_2#", FAU_STG_2_2);
                replaceDict.Add("#FAU_STG_2_2_description#", FAU_STG_2_2_description);
                replaceDict.Add("#FAU_STG_2_3#", FAU_STG_2_3);
                replaceDict.Add("#FAU_STG_2_3_description#", FAU_STG_2_3_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FAU_STG.3"))
            {
                replaceDict.Add("#FAU_STG_3#", FAU_STG_3);
                replaceDict.Add("#FAU_STG_3_hierarchy#", FAU_STG_3_hierarchy);
                replaceDict.Add("#FAU_STG_3_dependence#", FAU_STG_3_dependence);
                replaceDict.Add("#FAU_STG_3_1#", FAU_STG_3_1);
                replaceDict.Add("#FAU_STG_3_1_description#", FAU_STG_3_1_description);
   
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FAU_STG.4"))
            {
                replaceDict.Add("#FAU_STG_4#", FAU_STG_4);
                replaceDict.Add("#FAU_STG_4_hierarchy#", FAU_STG_4_hierarchy);
                replaceDict.Add("#FAU_STG_4_dependence#", FAU_STG_4_dependence);
                replaceDict.Add("#FAU_STG_4_1#", FAU_STG_4_1);
                replaceDict.Add("#FAU_STG_4_1_description#", FAU_STG_4_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FCO_NRO.1"))
            {
                replaceDict.Add("#FCO_NRO_1#", FCO_NRO_1);
                replaceDict.Add("#FCO_NRO_1_hierarchy#", FCO_NRO_1_hierarchy);
                replaceDict.Add("#FCO_NRO_1_dependence#", FCO_NRO_1_dependence);
                replaceDict.Add("#FCO_NRO_1_1#", FCO_NRO_1_1);
                replaceDict.Add("#FCO_NRO_1_1_description#", FCO_NRO_1_1_description);
                replaceDict.Add("#FCO_NRO_1_2#", FCO_NRO_1_2);
                replaceDict.Add("#FCO_NRO_1_2_description#", FCO_NRO_1_2_description);
                replaceDict.Add("#FCO_NRO_1_3#", FCO_NRO_1_3);
                replaceDict.Add("#FCO_NRO_1_3_description#", FCO_NRO_1_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FCO_NRO.2"))
            {
                replaceDict.Add("#FCO_NRO_2#", FCO_NRO_2);
                replaceDict.Add("#FCO_NRO_2_hierarchy#", FCO_NRO_2_hierarchy);
                replaceDict.Add("#FCO_NRO_2_dependence#", FCO_NRO_2_dependence);
                replaceDict.Add("#FCO_NRO_2_1#", FCO_NRO_2_1);
                replaceDict.Add("#FCO_NRO_2_1_description#", FCO_NRO_2_1_description);
                replaceDict.Add("#FCO_NRO_2_2#", FCO_NRO_2_2);
                replaceDict.Add("#FCO_NRO_2_2_description#", FCO_NRO_2_2_description);
                replaceDict.Add("#FCO_NRO_2_3#", FCO_NRO_2_3);
                replaceDict.Add("#FCO_NRO_2_3_description#", FCO_NRO_2_3_description);
            }
            else if (items is null) { }
            else { }





            if (items.Contains("FCO_NRR.1"))
            {
                replaceDict.Add("#FCO_NRR_1#", FCO_NRR_1);
                replaceDict.Add("#FCO_NRR_1_hierarchy#", FCO_NRR_1_hierarchy);
                replaceDict.Add("#FCO_NRR_1_dependence#", FCO_NRR_1_dependence);
                replaceDict.Add("#FCO_NRR_1_1#", FCO_NRR_1_1);
                replaceDict.Add("#FCO_NRR_1_1_description#", FCO_NRR_1_1_description);
                replaceDict.Add("#FCO_NRR_1_2#", FCO_NRR_1_2);
                replaceDict.Add("#FCO_NRR_1_2_description#", FCO_NRR_1_2_description);
                replaceDict.Add("#FCO_NRR_1_3#", FCO_NRR_1_3);
                replaceDict.Add("#FCO_NRR_1_3_description#", FCO_NRR_1_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FCO_NRR.2"))
            {
                replaceDict.Add("#FCO_NRR_2#", FCO_NRR_2);
                replaceDict.Add("#FCO_NRR_2_hierarchy#", FCO_NRR_2_hierarchy);
                replaceDict.Add("#FCO_NRR_2_dependence#", FCO_NRR_2_dependence);
                replaceDict.Add("#FCO_NRR_2_1#", FCO_NRR_2_1);
                replaceDict.Add("#FCO_NRR_2_1_description#", FCO_NRR_2_1_description);
                replaceDict.Add("#FCO_NRR_2_2#", FCO_NRR_2_2);
                replaceDict.Add("#FCO_NRR_2_2_description#", FCO_NRR_2_2_description);
                replaceDict.Add("#FCO_NRR_2_3#", FCO_NRR_2_3);
                replaceDict.Add("#FCO_NRR_2_3_description#", FCO_NRR_2_3_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FCS_CKM.1"))
            {
                replaceDict.Add("#FCS_CKM_1#", FCS_CKM_1);
                replaceDict.Add("#FCS_CKM_1_hierarchy#", FCS_CKM_1_hierarchy);
                replaceDict.Add("#FCS_CKM_1_dependence#", FCS_CKM_1_dependence);
                replaceDict.Add("#FCS_CKM_1_1#", FCS_CKM_1_1);
                replaceDict.Add("#FCS_CKM_1_1_description#", FCS_CKM_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FCS_CKM.2"))
            {
                replaceDict.Add("#FCS_CKM_2#", FCS_CKM_2);
                replaceDict.Add("#FCS_CKM_2_hierarchy#", FCS_CKM_2_hierarchy);
                replaceDict.Add("#FCS_CKM_2_dependence#", FCS_CKM_2_dependence);
                replaceDict.Add("#FCS_CKM_2_1#", FCS_CKM_2_1);
                replaceDict.Add("#FCS_CKM_2_1_description#", FCS_CKM_2_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FCS_CKM.3"))
            {
                replaceDict.Add("#FCS_CKM_3#", FCS_CKM_3);
                replaceDict.Add("#FCS_CKM_3_hierarchy#", FCS_CKM_3_hierarchy);
                replaceDict.Add("#FCS_CKM_3_dependence#", FCS_CKM_3_dependence);
                replaceDict.Add("#FCS_CKM_3_1#", FCS_CKM_3_1);
                replaceDict.Add("#FCS_CKM_3_1_description#", FCS_CKM_3_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FCS_CKM.4"))
            {
                replaceDict.Add("#FCS_CKM_4#", FCS_CKM_4);
                replaceDict.Add("#FCS_CKM_4_hierarchy#", FCS_CKM_4_hierarchy);
                replaceDict.Add("#FCS_CKM_4_dependence#", FCS_CKM_4_dependence);
                replaceDict.Add("#FCS_CKM_4_1#", FCS_CKM_4_1);
                replaceDict.Add("#FCS_CKM_4_1_description#", FCS_CKM_4_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FCS_COP.1"))
            {
                replaceDict.Add("#FCS_COP_1#", FCS_COP_1);
                replaceDict.Add("#FCS_COP_1_hierarchy#", FCS_COP_1_hierarchy);
                replaceDict.Add("#FCS_COP_1_dependence#", FCS_COP_1_dependence);
                replaceDict.Add("#FCS_COP_1_1#", FCS_COP_1_1);
                replaceDict.Add("#FCS_COP_1_1_description#", FCS_COP_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_ACC.1"))
            {
                replaceDict.Add("#FDP_ACC_1#", FDP_ACC_1);
                replaceDict.Add("#FDP_ACC_1_hierarchy#", FDP_ACC_1_hierarchy);
                replaceDict.Add("#FDP_ACC_1_dependence#", FDP_ACC_1_dependence);
                replaceDict.Add("#FDP_ACC_1_1#", FDP_ACC_1_1);
                replaceDict.Add("#FDP_ACC_1_1_description#", FDP_ACC_1_1_description);

            }
            else if (items is null) { }
            else { }

            if (items.Contains("FDP_ACC.2"))
            {
                replaceDict.Add("#FDP_ACC_2#", FDP_ACC_2);
                replaceDict.Add("#FDP_ACC_2_hierarchy#", FDP_ACC_2_hierarchy);
                replaceDict.Add("#FDP_ACC_2_dependence#", FDP_ACC_2_dependence);
                replaceDict.Add("#FDP_ACC_2_1#", FDP_ACC_2_1);
                replaceDict.Add("#FDP_ACC_2_1_description#", FDP_ACC_2_1_description);
                replaceDict.Add("#FDP_ACC_2_2#", FDP_ACC_2_2);
                replaceDict.Add("#FDP_ACC_2_2_description#", FDP_ACC_2_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_ACF.1"))
            {
                replaceDict.Add("#FDP_ACF_1#", FDP_ACF_1);
                replaceDict.Add("#FDP_ACF_1_hierarchy#", FDP_ACF_1_hierarchy);
                replaceDict.Add("#FDP_ACF_1_dependence#", FDP_ACF_1_dependence);
                replaceDict.Add("#FDP_ACF_1_1#", FDP_ACF_1_1);
                replaceDict.Add("#FDP_ACF_1_1_description#", FDP_ACF_1_1_description);
                replaceDict.Add("#FDP_ACF_1_2#", FDP_ACF_1_2);
                replaceDict.Add("#FDP_ACF_1_2_description#", FDP_ACF_1_2_description);
                replaceDict.Add("#FDP_ACF_1_3#", FDP_ACF_1_3);
                replaceDict.Add("#FDP_ACF_1_3_description#", FDP_ACF_1_3_description);
                replaceDict.Add("#FDP_ACF_1_4#", FDP_ACF_1_4);
                replaceDict.Add("#FDP_ACF_1_4_description#", FDP_ACF_1_4_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_DAU.1"))
            {
                replaceDict.Add("#FDP_DAU_1#", FDP_DAU_1);
                replaceDict.Add("#FDP_DAU_1_hierarchy#", FDP_DAU_1_hierarchy);
                replaceDict.Add("#FDP_DAU_1_dependence#", FDP_DAU_1_dependence);
                replaceDict.Add("#FDP_DAU_1_1#", FDP_DAU_1_1);
                replaceDict.Add("#FDP_DAU_1_1_description#", FDP_DAU_1_1_description);
                replaceDict.Add("#FDP_DAU_1_2#", FDP_DAU_1_2);
                replaceDict.Add("#FDP_DAU_1_2_description#", FDP_DAU_1_2_description);

            }
            else if (items is null) { }
            else { }

            if (items.Contains("FDP_DAU.2"))
            {
                replaceDict.Add("#FDP_DAU_2#", FDP_DAU_2);
                replaceDict.Add("#FDP_DAU_2_hierarchy#", FDP_DAU_2_hierarchy);
                replaceDict.Add("#FDP_DAU_2_dependence#", FDP_DAU_2_dependence);
                replaceDict.Add("#FDP_DAU_2_1#", FDP_DAU_2_1);
                replaceDict.Add("#FDP_DAU_2_1_description#", FDP_DAU_2_1_description);
                replaceDict.Add("#FDP_DAU_2_2#", FDP_DAU_2_2);
                replaceDict.Add("#FDP_DAU_2_2_description#", FDP_DAU_2_2_description);

            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_ETC.1"))
            {
                replaceDict.Add("#FDP_ETC_1#", FDP_ETC_1);
                replaceDict.Add("#FDP_ETC_1_hierarchy#", FDP_ETC_1_hierarchy);
                replaceDict.Add("#FDP_ETC_1_dependence#", FDP_ETC_1_dependence);
                replaceDict.Add("#FDP_ETC_1_1#", FDP_ETC_1_1);
                replaceDict.Add("#FDP_ETC_1_1_description#", FDP_ETC_1_1_description);
                replaceDict.Add("#FDP_ETC_1_2#", FDP_ETC_1_2);
                replaceDict.Add("#FDP_ETC_1_2_description#", FDP_ETC_1_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_ETC.2"))
            {
                replaceDict.Add("#FDP_ETC_2#", FDP_ETC_2);
                replaceDict.Add("#FDP_ETC_2_hierarchy#", FDP_ETC_2_hierarchy);
                replaceDict.Add("#FDP_ETC_2_dependence#", FDP_ETC_2_dependence);
                replaceDict.Add("#FDP_ETC_2_1#", FDP_ETC_2_1);
                replaceDict.Add("#FDP_ETC_2_1_description#", FDP_ETC_2_1_description);
                replaceDict.Add("#FDP_ETC_2_2#", FDP_ETC_2_2);
                replaceDict.Add("#FDP_ETC_2_2_description#", FDP_ETC_2_2_description);
                replaceDict.Add("#FDP_ETC_2_3#", FDP_ETC_2_3);
                replaceDict.Add("#FDP_ETC_2_3_description#", FDP_ETC_2_3_description);
                replaceDict.Add("#FDP_ETC_2_4#", FDP_ETC_2_4);
                replaceDict.Add("#FDP_ETC_2_4_description#", FDP_ETC_2_4_description);
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_IFC.1"))
            {
                replaceDict.Add("#FDP_IFC_1#", FDP_IFC_1);
                replaceDict.Add("#FDP_IFC_1_hierarchy#", FDP_IFC_1_hierarchy);
                replaceDict.Add("#FDP_IFC_1_dependence#", FDP_IFC_1_dependence);
                replaceDict.Add("#FDP_IFC_1_1#", FDP_IFC_1_1);
                replaceDict.Add("#FDP_IFC_1_1_description#", FDP_IFC_1_1_description);


            }
            else if (items is null) { }
            else { }

            if (items.Contains("FDP_IFC.2"))
            {
                replaceDict.Add("#FDP_IFC_2#", FDP_IFC_2);
                replaceDict.Add("#FDP_IFC_2_hierarchy#", FDP_IFC_2_hierarchy);
                replaceDict.Add("#FDP_IFC_2_dependence#", FDP_IFC_2_dependence);
                replaceDict.Add("#FDP_IFC_2_1#", FDP_IFC_2_1);
                replaceDict.Add("#FDP_IFC_2_1_description#", FDP_IFC_2_1_description);
                replaceDict.Add("#FDP_IFC_2_2#", FDP_IFC_2_2);
                replaceDict.Add("#FDP_IFC_2_2_description#", FDP_IFC_2_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_IFF.1"))
            {
                replaceDict.Add("#FDP_IFF_1#", FDP_IFF_1);
                replaceDict.Add("#FDP_IFF_1_hierarchy#", FDP_IFF_1_hierarchy);
                replaceDict.Add("#FDP_IFF_1_dependence#", FDP_IFF_1_dependence);
                replaceDict.Add("#FDP_IFF_1_1#", FDP_IFF_1_1);
                replaceDict.Add("#FDP_IFF_1_1_description#", FDP_IFF_1_1_description);
                replaceDict.Add("#FDP_IFF_1_2#", FDP_IFF_1_2);
                replaceDict.Add("#FDP_IFF_1_2_description#", FDP_IFF_1_2_description);
                replaceDict.Add("#FDP_IFF_1_3#", FDP_IFF_1_3);
                replaceDict.Add("#FDP_IFF_1_3_description#", FDP_IFF_1_3_description);
                replaceDict.Add("#FDP_IFF_1_4#", FDP_IFF_1_4);
                replaceDict.Add("#FDP_IFF_1_4_description#", FDP_IFF_1_4_description);
                replaceDict.Add("#FDP_IFF_1_5#", FDP_IFF_1_5);
                replaceDict.Add("#FDP_IFF_1_5_description#", FDP_IFF_1_5_description);
                replaceDict.Add("#FDP_IFF_1_6#", FDP_IFF_1_6);
                replaceDict.Add("#FDP_IFF_1_6_description#", FDP_IFF_1_6_description);

            }
            else if (items is null) { }
            else { }





            if (items.Contains("FDP_IFF.2"))
            {
                replaceDict.Add("#FDP_IFF_2#", FDP_IFF_2);
                replaceDict.Add("#FDP_IFF_2_hierarchy#", FDP_IFF_2_hierarchy);
                replaceDict.Add("#FDP_IFF_2_dependence#", FDP_IFF_2_dependence);
                replaceDict.Add("#FDP_IFF_2_1#", FDP_IFF_2_1);
                replaceDict.Add("#FDP_IFF_2_1_description#", FDP_IFF_2_1_description);
                replaceDict.Add("#FDP_IFF_2_2#", FDP_IFF_2_2);
                replaceDict.Add("#FDP_IFF_2_2_description#", FDP_IFF_2_2_description);
                replaceDict.Add("#FDP_IFF_2_3#", FDP_IFF_2_3);
                replaceDict.Add("#FDP_IFF_2_3_description#", FDP_IFF_2_3_description);
                replaceDict.Add("#FDP_IFF_2_4#", FDP_IFF_2_4);
                replaceDict.Add("#FDP_IFF_2_4_description#", FDP_IFF_2_4_description);
                replaceDict.Add("#FDP_IFF_2_5#", FDP_IFF_2_5);
                replaceDict.Add("#FDP_IFF_2_5_description#", FDP_IFF_2_5_description);
                replaceDict.Add("#FDP_IFF_2_6#", FDP_IFF_2_6);
                replaceDict.Add("#FDP_IFF_2_6_description#", FDP_IFF_2_6_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_IFF.3"))
            {
                replaceDict.Add("#FDP_IFF_3#", FDP_IFF_3);
                replaceDict.Add("#FDP_IFF_3_hierarchy#", FDP_IFF_3_hierarchy);
                replaceDict.Add("#FDP_IFF_3_dependence#", FDP_IFF_3_dependence);
                replaceDict.Add("#FDP_IFF_3_1#", FDP_IFF_3_1);
                replaceDict.Add("#FDP_IFF_3_1_description#", FDP_IFF_3_1_description);
               

            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_IFF.4"))
            {
                replaceDict.Add("#FDP_IFF_4#", FDP_IFF_4);
                replaceDict.Add("#FDP_IFF_4_hierarchy#", FDP_IFF_4_hierarchy);
                replaceDict.Add("#FDP_IFF_4_dependence#", FDP_IFF_4_dependence);
                replaceDict.Add("#FDP_IFF_4_1#", FDP_IFF_4_1);
                replaceDict.Add("#FDP_IFF_4_1_description#", FDP_IFF_4_1_description);
                replaceDict.Add("#FDP_IFF_4_2#", FDP_IFF_4_2);
                replaceDict.Add("#FDP_IFF_4_2_description#", FDP_IFF_4_2_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_IFF.5"))
            {
                replaceDict.Add("#FDP_IFF_5#", FDP_IFF_5);
                replaceDict.Add("#FDP_IFF_5_hierarchy#", FDP_IFF_5_hierarchy);
                replaceDict.Add("#FDP_IFF_5_dependence#", FDP_IFF_5_dependence);
                replaceDict.Add("#FDP_IFF_5_1#", FDP_IFF_5_1);
                replaceDict.Add("#FDP_IFF_5_1_description#", FDP_IFF_5_1_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_IFF.6"))
            {
                replaceDict.Add("#FDP_IFF_6#", FDP_IFF_6);
                replaceDict.Add("#FDP_IFF_6_hierarchy#", FDP_IFF_6_hierarchy);
                replaceDict.Add("#FDP_IFF_6_dependence#", FDP_IFF_6_dependence);
                replaceDict.Add("#FDP_IFF_6_1#", FDP_IFF_6_1);
                replaceDict.Add("#FDP_IFF_6_1_description#", FDP_IFF_6_1_description);


            }
            else if (items is null) { }
            else { }






            if (items.Contains("FDP_ITC.1"))
            {
                replaceDict.Add("#FDP_ITC_1#", FDP_ITC_1);
                replaceDict.Add("#FDP_ITC_1_hierarchy#", FDP_ITC_1_hierarchy);
                replaceDict.Add("#FDP_ITC_1_dependence#", FDP_ITC_1_dependence);
                replaceDict.Add("#FDP_ITC_1_1#", FDP_ITC_1_1);
                replaceDict.Add("#FDP_ITC_1_1_description#", FDP_ITC_1_1_description);
                replaceDict.Add("#FDP_ITC_1_2#", FDP_ITC_1_2);
                replaceDict.Add("#FDP_ITC_1_2_description#", FDP_ITC_1_2_description);
                replaceDict.Add("#FDP_ITC_1_3#", FDP_ITC_1_3);
                replaceDict.Add("#FDP_ITC_1_3_description#", FDP_ITC_1_3_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FDP_ITC.2"))
            {
                replaceDict.Add("#FDP_ITC_2#", FDP_ITC_2);
                replaceDict.Add("#FDP_ITC_2_hierarchy#", FDP_ITC_2_hierarchy);
                replaceDict.Add("#FDP_ITC_2_dependence#", FDP_ITC_2_dependence);
                replaceDict.Add("#FDP_ITC_2_1#", FDP_ITC_2_1);
                replaceDict.Add("#FDP_ITC_2_1_description#", FDP_ITC_2_1_description);
                replaceDict.Add("#FDP_ITC_2_2#", FDP_ITC_2_2);
                replaceDict.Add("#FDP_ITC_2_2_description#", FDP_ITC_2_2_description);
                replaceDict.Add("#FDP_ITC_2_3#", FDP_ITC_2_3);
                replaceDict.Add("#FDP_ITC_2_3_description#", FDP_ITC_2_3_description);
                replaceDict.Add("#FDP_ITC_2_4#", FDP_ITC_2_4);
                replaceDict.Add("#FDP_ITC_2_4_description#", FDP_ITC_2_4_description);
                replaceDict.Add("#FDP_ITC_2_5#", FDP_ITC_2_5);
                replaceDict.Add("#FDP_ITC_2_5_description#", FDP_ITC_2_5_description);

            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_ITT.1"))
            {
                replaceDict.Add("#FDP_ITT_1#", FDP_ITT_1);
                replaceDict.Add("#FDP_ITT_1_hierarchy#", FDP_ITT_1_hierarchy);
                replaceDict.Add("#FDP_ITT_1_dependence#", FDP_ITT_1_dependence);
                replaceDict.Add("#FDP_ITT_1_1#", FDP_ITT_1_1);
                replaceDict.Add("#FDP_ITT_1_1_description#", FDP_ITT_1_1_description);



            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_ITT.2"))
            {
                replaceDict.Add("#FDP_ITT_2#", FDP_ITT_2);
                replaceDict.Add("#FDP_ITT_2_hierarchy#", FDP_ITT_2_hierarchy);
                replaceDict.Add("#FDP_ITT_2_dependence#", FDP_ITT_2_dependence);
                replaceDict.Add("#FDP_ITT_2_1#", FDP_ITT_2_1);
                replaceDict.Add("#FDP_ITT_2_1_description#", FDP_ITT_2_1_description);
                replaceDict.Add("#FDP_ITT_2_2#", FDP_ITT_2_2);
                replaceDict.Add("#FDP_ITT_2_2_description#", FDP_ITT_2_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_ITT.3"))
            {
                replaceDict.Add("#FDP_ITT_3#", FDP_ITT_3);
                replaceDict.Add("#FDP_ITT_3_hierarchy#", FDP_ITT_3_hierarchy);
                replaceDict.Add("#FDP_ITT_3_dependence#", FDP_ITT_3_dependence);
                replaceDict.Add("#FDP_ITT_3_1#", FDP_ITT_3_1);
                replaceDict.Add("#FDP_ITT_3_1_description#", FDP_ITT_3_1_description);
                replaceDict.Add("#FDP_ITT_3_2#", FDP_ITT_3_2);
                replaceDict.Add("#FDP_ITT_3_2_description#", FDP_ITT_3_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_ITT.4"))
            {
                replaceDict.Add("#FDP_ITT_4#", FDP_ITT_4);
                replaceDict.Add("#FDP_ITT_4_hierarchy#", FDP_ITT_4_hierarchy);
                replaceDict.Add("#FDP_ITT_4_dependence#", FDP_ITT_4_dependence);
                replaceDict.Add("#FDP_ITT_4_1#", FDP_ITT_4_1);
                replaceDict.Add("#FDP_ITT_4_1_description#", FDP_ITT_4_1_description);
                replaceDict.Add("#FDP_ITT_4_2#", FDP_ITT_4_2);
                replaceDict.Add("#FDP_ITT_4_2_description#", FDP_ITT_4_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_RIP.1"))
            {
                replaceDict.Add("#FDP_RIP_1#", FDP_RIP_1);
                replaceDict.Add("#FDP_RIP_1_hierarchy#", FDP_RIP_1_hierarchy);
                replaceDict.Add("#FDP_RIP_1_dependence#", FDP_RIP_1_dependence);
                replaceDict.Add("#FDP_RIP_1_1#", FDP_RIP_1_1);
                replaceDict.Add("#FDP_RIP_1_1_description#", FDP_RIP_1_1_description);



            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_RIP.2"))
            {
                replaceDict.Add("#FDP_RIP_2#", FDP_RIP_2);
                replaceDict.Add("#FDP_RIP_2_hierarchy#", FDP_RIP_2_hierarchy);
                replaceDict.Add("#FDP_RIP_2_dependence#", FDP_RIP_2_dependence);
                replaceDict.Add("#FDP_RIP_2_1#", FDP_RIP_2_1);
                replaceDict.Add("#FDP_RIP_2_1_description#", FDP_RIP_2_1_description);



            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_ROL.1"))
            {
                replaceDict.Add("#FDP_ROL_1#", FDP_ROL_1);
                replaceDict.Add("#FDP_ROL_1_hierarchy#", FDP_ROL_1_hierarchy);
                replaceDict.Add("#FDP_ROL_1_dependence#", FDP_ROL_1_dependence);
                replaceDict.Add("#FDP_ROL_1_1#", FDP_ROL_1_1);
                replaceDict.Add("#FDP_ROL_1_1_description#", FDP_ROL_1_1_description);
                replaceDict.Add("#FDP_ROL_1_2#", FDP_ROL_1_2);
                replaceDict.Add("#FDP_ROL_1_2_description#", FDP_ROL_1_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_ROL.2"))
            {
                replaceDict.Add("#FDP_ROL_2#", FDP_ROL_2);
                replaceDict.Add("#FDP_ROL_2_hierarchy#", FDP_ROL_2_hierarchy);
                replaceDict.Add("#FDP_ROL_2_dependence#", FDP_ROL_2_dependence);
                replaceDict.Add("#FDP_ROL_2_1#", FDP_ROL_2_1);
                replaceDict.Add("#FDP_ROL_2_1_description#", FDP_ROL_2_1_description);
                replaceDict.Add("#FDP_ROL_2_2#", FDP_ROL_2_2);
                replaceDict.Add("#FDP_ROL_2_2_description#", FDP_ROL_2_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_SDI.1"))
            {
                replaceDict.Add("#FDP_SDI_1#", FDP_SDI_1);
                replaceDict.Add("#FDP_SDI_1_hierarchy#", FDP_SDI_1_hierarchy);
                replaceDict.Add("#FDP_SDI_1_dependence#", FDP_SDI_1_dependence);
                replaceDict.Add("#FDP_SDI_1_1#", FDP_SDI_1_1);
                replaceDict.Add("#FDP_SDI_1_1_description#", FDP_SDI_1_1_description);



            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_SDI.2"))
            {
                replaceDict.Add("#FDP_SDI_2#", FDP_SDI_2);
                replaceDict.Add("#FDP_SDI_2_hierarchy#", FDP_SDI_2_hierarchy);
                replaceDict.Add("#FDP_SDI_2_dependence#", FDP_SDI_2_dependence);
                replaceDict.Add("#FDP_SDI_2_1#", FDP_SDI_2_1);
                replaceDict.Add("#FDP_SDI_2_1_description#", FDP_SDI_2_1_description);
                replaceDict.Add("#FDP_SDI_2_2#", FDP_SDI_2_2);
                replaceDict.Add("#FDP_SDI_2_2_description#", FDP_SDI_2_2_description);


            }
            else if (items is null) { }
            else { }




            if (items.Contains("FDP_UCT.1"))
            {
                replaceDict.Add("#FDP_UCT_1#", FDP_UCT_1);
                replaceDict.Add("#FDP_UCT_1_hierarchy#", FDP_UCT_1_hierarchy);
                replaceDict.Add("#FDP_UCT_1_dependence#", FDP_UCT_1_dependence);
                replaceDict.Add("#FDP_UCT_1_1#", FDP_UCT_1_1);
                replaceDict.Add("#FDP_UCT_1_1_description#", FDP_UCT_1_1_description);



            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_UIT.1"))
            {
                replaceDict.Add("#FDP_UIT_1#", FDP_UIT_1);
                replaceDict.Add("#FDP_UIT_1_hierarchy#", FDP_UIT_1_hierarchy);
                replaceDict.Add("#FDP_UIT_1_dependence#", FDP_UIT_1_dependence);
                replaceDict.Add("#FDP_UIT_1_1#", FDP_UIT_1_1);
                replaceDict.Add("#FDP_UIT_1_1_description#", FDP_UIT_1_1_description);
                replaceDict.Add("#FDP_UIT_1_2#", FDP_UIT_1_2);
                replaceDict.Add("#FDP_UIT_1_2_description#", FDP_UIT_1_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_UIT.2"))
            {
                replaceDict.Add("#FDP_UIT_2#", FDP_UIT_2);
                replaceDict.Add("#FDP_UIT_2_hierarchy#", FDP_UIT_2_hierarchy);
                replaceDict.Add("#FDP_UIT_2_dependence#", FDP_UIT_2_dependence);
                replaceDict.Add("#FDP_UIT_2_1#", FDP_UIT_2_1);
                replaceDict.Add("#FDP_UIT_2_1_description#", FDP_UIT_2_1_description);
  


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FDP_UIT.3"))
            {
                replaceDict.Add("#FDP_UIT_3#", FDP_UIT_3);
                replaceDict.Add("#FDP_UIT_3_hierarchy#", FDP_UIT_3_hierarchy);
                replaceDict.Add("#FDP_UIT_3_dependence#", FDP_UIT_3_dependence);
                replaceDict.Add("#FDP_UIT_3_1#", FDP_UIT_3_1);
                replaceDict.Add("#FDP_UIT_3_1_description#", FDP_UIT_3_1_description);



            }
            else if (items is null) { }
            else { }




            if (items.Contains("FIA_AFL.1"))
            {
                replaceDict.Add("#FIA_AFL_1#", FIA_AFL_1);
                replaceDict.Add("#FIA_AFL_1_hierarchy#", FIA_AFL_1_hierarchy);
                replaceDict.Add("#FIA_AFL_1_dependence#", FIA_AFL_1_dependence);
                replaceDict.Add("#FIA_AFL_1_1#", FIA_AFL_1_1);
                replaceDict.Add("#FIA_AFL_1_1_description#", FIA_AFL_1_1_description);
                replaceDict.Add("#FIA_AFL_1_2#", FIA_AFL_1_2);
                replaceDict.Add("#FIA_AFL_1_2_description#", FIA_AFL_1_2_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_ATD.1"))
            {
                replaceDict.Add("#FIA_ATD_1#", FIA_ATD_1);
                replaceDict.Add("#FIA_ATD_1_hierarchy#", FIA_ATD_1_hierarchy);
                replaceDict.Add("#FIA_ATD_1_dependence#", FIA_ATD_1_dependence);
                replaceDict.Add("#FIA_ATD_1_1#", FIA_ATD_1_1);
                replaceDict.Add("#FIA_ATD_1_1_description#", FIA_ATD_1_1_description);
            


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_SOS.1"))
            {
                replaceDict.Add("#FIA_SOS_1#", FIA_SOS_1);
                replaceDict.Add("#FIA_SOS_1_hierarchy#", FIA_SOS_1_hierarchy);
                replaceDict.Add("#FIA_SOS_1_dependence#", FIA_SOS_1_dependence);
                replaceDict.Add("#FIA_SOS_1_1#", FIA_SOS_1_1);
                replaceDict.Add("#FIA_SOS_1_1_description#", FIA_SOS_1_1_description);



            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_SOS.2"))
            {
                replaceDict.Add("#FIA_SOS_2#", FIA_SOS_2);
                replaceDict.Add("#FIA_SOS_2_hierarchy#", FIA_SOS_2_hierarchy);
                replaceDict.Add("#FIA_SOS_2_dependence#", FIA_SOS_2_dependence);
                replaceDict.Add("#FIA_SOS_2_1#", FIA_SOS_2_1);
                replaceDict.Add("#FIA_SOS_2_1_description#", FIA_SOS_2_1_description);
                replaceDict.Add("#FIA_SOS_2_2#", FIA_SOS_2_2);
                replaceDict.Add("#FIA_SOS_2_2_description#", FIA_SOS_2_2_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.1"))
            {
                replaceDict.Add("#FIA_UAU_1#", FIA_UAU_1);
                replaceDict.Add("#FIA_UAU_1_hierarchy#", FIA_UAU_1_hierarchy);
                replaceDict.Add("#FIA_UAU_1_dependence#", FIA_UAU_1_dependence);
                replaceDict.Add("#FIA_UAU_1_1#", FIA_UAU_1_1);
                replaceDict.Add("#FIA_UAU_1_1_description#", FIA_UAU_1_1_description);
                replaceDict.Add("#FIA_UAU_1_2#", FIA_UAU_1_2);
                replaceDict.Add("#FIA_UAU_1_2_description#", FIA_UAU_1_2_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FIA_UAU.2"))
            {
                replaceDict.Add("#FIA_UAU_2#", FIA_UAU_2);
                replaceDict.Add("#FIA_UAU_2_hierarchy#", FIA_UAU_2_hierarchy);
                replaceDict.Add("#FIA_UAU_2_dependence#", FIA_UAU_2_dependence);
                replaceDict.Add("#FIA_UAU_2_1#", FIA_UAU_2_1);
                replaceDict.Add("#FIA_UAU_2_1_description#", FIA_UAU_2_1_description);
   


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.3"))
            {
                replaceDict.Add("#FIA_UAU_3#", FIA_UAU_3);
                replaceDict.Add("#FIA_UAU_3_hierarchy#", FIA_UAU_3_hierarchy);
                replaceDict.Add("#FIA_UAU_3_dependence#", FIA_UAU_3_dependence);
                replaceDict.Add("#FIA_UAU_3_1#", FIA_UAU_3_1);
                replaceDict.Add("#FIA_UAU_3_1_description#", FIA_UAU_3_1_description);
                replaceDict.Add("#FIA_UAU_3_2#", FIA_UAU_3_2);
                replaceDict.Add("#FIA_UAU_3_2_description#", FIA_UAU_3_2_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.4"))
            {
                replaceDict.Add("#FIA_UAU_4#", FIA_UAU_4);
                replaceDict.Add("#FIA_UAU_4_hierarchy#", FIA_UAU_4_hierarchy);
                replaceDict.Add("#FIA_UAU_4_dependence#", FIA_UAU_4_dependence);
                replaceDict.Add("#FIA_UAU_4_1#", FIA_UAU_4_1);
                replaceDict.Add("#FIA_UAU_4_1_description#", FIA_UAU_4_1_description);
   


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.5"))
            {
                replaceDict.Add("#FIA_UAU_5#", FIA_UAU_5);
                replaceDict.Add("#FIA_UAU_5_hierarchy#", FIA_UAU_5_hierarchy);
                replaceDict.Add("#FIA_UAU_5_dependence#", FIA_UAU_5_dependence);
                replaceDict.Add("#FIA_UAU_5_1#", FIA_UAU_5_1);
                replaceDict.Add("#FIA_UAU_5_1_description#", FIA_UAU_5_1_description);
                replaceDict.Add("#FIA_UAU_5_2#", FIA_UAU_5_2);
                replaceDict.Add("#FIA_UAU_5_2_description#", FIA_UAU_5_2_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.6"))
            {
                replaceDict.Add("#FIA_UAU_6#", FIA_UAU_6);
                replaceDict.Add("#FIA_UAU_6_hierarchy#", FIA_UAU_6_hierarchy);
                replaceDict.Add("#FIA_UAU_6_dependence#", FIA_UAU_6_dependence);
                replaceDict.Add("#FIA_UAU_6_1#", FIA_UAU_6_1);
                replaceDict.Add("#FIA_UAU_6_1_description#", FIA_UAU_6_1_description);



            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UAU.7"))
            {
                replaceDict.Add("#FIA_UAU_7#", FIA_UAU_7);
                replaceDict.Add("#FIA_UAU_7_hierarchy#", FIA_UAU_7_hierarchy);
                replaceDict.Add("#FIA_UAU_7_dependence#", FIA_UAU_7_dependence);
                replaceDict.Add("#FIA_UAU_7_1#", FIA_UAU_7_1);
                replaceDict.Add("#FIA_UAU_7_1_description#", FIA_UAU_7_1_description);



            }
            else if (items is null) { }
            else { }



            if (items.Contains("FIA_UID.1"))
            {
                replaceDict.Add("#FIA_UID_1#", FIA_UID_1);
                replaceDict.Add("#FIA_UID_1_hierarchy#", FIA_UID_1_hierarchy);
                replaceDict.Add("#FIA_UID_1_dependence#", FIA_UID_1_dependence);
                replaceDict.Add("#FIA_UID_1_1#", FIA_UID_1_1);
                replaceDict.Add("#FIA_UID_1_1_description#", FIA_UID_1_1_description);
                replaceDict.Add("#FIA_UID_1_2#", FIA_UID_1_2);
                replaceDict.Add("#FIA_UID_1_2_description#", FIA_UID_1_2_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FIA_UID.2"))
            {
                replaceDict.Add("#FIA_UID_2#", FIA_UID_2);
                replaceDict.Add("#FIA_UID_2_hierarchy#", FIA_UID_2_hierarchy);
                replaceDict.Add("#FIA_UID_2_dependence#", FIA_UID_2_dependence);
                replaceDict.Add("#FIA_UID_2_1#", FIA_UID_2_1);
                replaceDict.Add("#FIA_UID_2_1_description#", FIA_UID_2_1_description);


            }
            else if (items is null) { }
            else { }




            if (items.Contains("FIA_USB.1"))
            {
                replaceDict.Add("#FIA_USB_1#", FIA_USB_1);
                replaceDict.Add("#FIA_USB_1_hierarchy#", FIA_USB_1_hierarchy);
                replaceDict.Add("#FIA_USB_1_dependence#", FIA_USB_1_dependence);
                replaceDict.Add("#FIA_USB_1_1#", FIA_USB_1_1);
                replaceDict.Add("#FIA_USB_1_1_description#", FIA_USB_1_1_description);
                replaceDict.Add("#FIA_USB_1_2#", FIA_USB_1_2);
                replaceDict.Add("#FIA_USB_1_2_description#", FIA_USB_1_2_description);
                replaceDict.Add("#FIA_USB_1_3#", FIA_USB_1_3);
                replaceDict.Add("#FIA_USB_1_3_description#", FIA_USB_1_3_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_MOF.1"))
            {
                replaceDict.Add("#FMT_MOF_1#", FMT_MOF_1);
                replaceDict.Add("#FMT_MOF_1_hierarchy#", FMT_MOF_1_hierarchy);
                replaceDict.Add("#FMT_MOF_1_dependence#", FMT_MOF_1_dependence);
                replaceDict.Add("#FMT_MOF_1_1#", FMT_MOF_1_1);
                replaceDict.Add("#FMT_MOF_1_1_description#", FMT_MOF_1_1_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FMT_MSA.1"))
            {
                replaceDict.Add("#FMT_MSA_1#", FMT_MSA_1);
                replaceDict.Add("#FMT_MSA_1_hierarchy#", FMT_MSA_1_hierarchy);
                replaceDict.Add("#FMT_MSA_1_dependence#", FMT_MSA_1_dependence);
                replaceDict.Add("#FMT_MSA_1_1#", FMT_MSA_1_1);
                replaceDict.Add("#FMT_MSA_1_1_description#", FMT_MSA_1_1_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FMT_MSA.2"))
            {
                replaceDict.Add("#FMT_MSA_2#", FMT_MSA_2);
                replaceDict.Add("#FMT_MSA_2_hierarchy#", FMT_MSA_2_hierarchy);
                replaceDict.Add("#FMT_MSA_2_dependence#", FMT_MSA_2_dependence);
                replaceDict.Add("#FMT_MSA_2_1#", FMT_MSA_2_1);
                replaceDict.Add("#FMT_MSA_2_1_description#", FMT_MSA_2_1_description);


            }
            else if (items is null) { }
            else { }


            if (items.Contains("FMT_MSA.3"))
            {
                replaceDict.Add("#FMT_MSA_3#", FMT_MSA_3);
                replaceDict.Add("#FMT_MSA_3_hierarchy#", FMT_MSA_3_hierarchy);
                replaceDict.Add("#FMT_MSA_3_dependence#", FMT_MSA_3_dependence);
                replaceDict.Add("#FMT_MSA_3_1#", FMT_MSA_3_1);
                replaceDict.Add("#FMT_MSA_3_1_description#", FMT_MSA_3_1_description);
                replaceDict.Add("#FMT_MSA_3_2#", FMT_MSA_3_2);
                replaceDict.Add("#FMT_MSA_3_2_description#", FMT_MSA_3_2_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FMT_MSA.4"))
            {
                replaceDict.Add("#FMT_MSA_4#", FMT_MSA_4);
                replaceDict.Add("#FMT_MSA_4_hierarchy#", FMT_MSA_4_hierarchy);
                replaceDict.Add("#FMT_MSA_4_dependence#", FMT_MSA_4_dependence);
                replaceDict.Add("#FMT_MSA_4_1#", FMT_MSA_4_1);
                replaceDict.Add("#FMT_MSA_4_1_description#", FMT_MSA_4_1_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_MTD.1"))
            {
                replaceDict.Add("#FMT_MTD_1#", FMT_MTD_1);
                replaceDict.Add("#FMT_MTD_1_hierarchy#", FMT_MTD_1_hierarchy);
                replaceDict.Add("#FMT_MTD_1_dependence#", FMT_MTD_1_dependence);
                replaceDict.Add("#FMT_MTD_1_1#", FMT_MTD_1_1);
                replaceDict.Add("#FMT_MTD_1_1_description#", FMT_MTD_1_1_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_MTD.2"))
            {
                replaceDict.Add("#FMT_MTD_2#", FMT_MTD_2);
                replaceDict.Add("#FMT_MTD_2_hierarchy#", FMT_MTD_2_hierarchy);
                replaceDict.Add("#FMT_MTD_2_dependence#", FMT_MTD_2_dependence);
                replaceDict.Add("#FMT_MTD_2_1#", FMT_MTD_2_1);
                replaceDict.Add("#FMT_MTD_2_1_description#", FMT_MTD_2_1_description);
                replaceDict.Add("#FMT_MTD_2_2#", FMT_MTD_2_2);
                replaceDict.Add("#FMT_MTD_2_2_description#", FMT_MTD_2_2_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FMT_MTD.3"))
            {
                replaceDict.Add("#FMT_MTD_3#", FMT_MTD_3);
                replaceDict.Add("#FMT_MTD_3_hierarchy#", FMT_MTD_3_hierarchy);
                replaceDict.Add("#FMT_MTD_3_dependence#", FMT_MTD_3_dependence);
                replaceDict.Add("#FMT_MTD_3_1#", FMT_MTD_3_1);
                replaceDict.Add("#FMT_MTD_3_1_description#", FMT_MTD_3_1_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_REV.1"))
            {
                replaceDict.Add("#FMT_REV_1#", FMT_REV_1);
                replaceDict.Add("#FMT_REV_1_hierarchy#", FMT_REV_1_hierarchy);
                replaceDict.Add("#FMT_REV_1_dependence#", FMT_REV_1_dependence);
                replaceDict.Add("#FMT_REV_1_1#", FMT_REV_1_1);
                replaceDict.Add("#FMT_REV_1_1_description#", FMT_REV_1_1_description);
                replaceDict.Add("#FMT_REV_1_2#", FMT_REV_1_2);
                replaceDict.Add("#FMT_REV_1_2_description#", FMT_REV_1_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_SAE.1"))
            {
                replaceDict.Add("#FMT_SAE_1#", FMT_SAE_1);
                replaceDict.Add("#FMT_SAE_1_hierarchy#", FMT_SAE_1_hierarchy);
                replaceDict.Add("#FMT_SAE_1_dependence#", FMT_SAE_1_dependence);
                replaceDict.Add("#FMT_SAE_1_1#", FMT_SAE_1_1);
                replaceDict.Add("#FMT_SAE_1_1_description#", FMT_SAE_1_1_description);
                replaceDict.Add("#FMT_SAE_1_2#", FMT_SAE_1_2);
                replaceDict.Add("#FMT_SAE_1_2_description#", FMT_SAE_1_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_SMF.1"))
            {
                replaceDict.Add("#FMT_SMF_1#", FMT_SMF_1);
                replaceDict.Add("#FMT_SMF_1_hierarchy#", FMT_SMF_1_hierarchy);
                replaceDict.Add("#FMT_SMF_1_dependence#", FMT_SMF_1_dependence);
                replaceDict.Add("#FMT_SMF_1_1#", FMT_SMF_1_1);
                replaceDict.Add("#FMT_SMF_1_1_description#", FMT_SMF_1_1_description);


            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_SMR.1"))
            {
                replaceDict.Add("#FMT_SMR_1#", FMT_SMR_1);
                replaceDict.Add("#FMT_SMR_1_hierarchy#", FMT_SMR_1_hierarchy);
                replaceDict.Add("#FMT_SMR_1_dependence#", FMT_SMR_1_dependence);
                replaceDict.Add("#FMT_SMR_1_1#", FMT_SMR_1_1);
                replaceDict.Add("#FMT_SMR_1_1_description#", FMT_SMR_1_1_description);
                replaceDict.Add("#FMT_SMR_1_2#", FMT_SMR_1_2);
                replaceDict.Add("#FMT_SMR_1_2_description#", FMT_SMR_1_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_SMR.2"))
            {
                replaceDict.Add("#FMT_SMR_2#", FMT_SMR_2);
                replaceDict.Add("#FMT_SMR_2_hierarchy#", FMT_SMR_2_hierarchy);
                replaceDict.Add("#FMT_SMR_2_dependence#", FMT_SMR_2_dependence);
                replaceDict.Add("#FMT_SMR_2_1#", FMT_SMR_2_1);
                replaceDict.Add("#FMT_SMR_2_1_description#", FMT_SMR_2_1_description);
                replaceDict.Add("#FMT_SMR_2_2#", FMT_SMR_2_2);
                replaceDict.Add("#FMT_SMR_2_2_description#", FMT_SMR_2_2_description);
                replaceDict.Add("#FMT_SMR_2_3#", FMT_SMR_2_3);
                replaceDict.Add("#FMT_SMR_2_3_description#", FMT_SMR_2_3_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FMT_SMR.3"))
            {
                replaceDict.Add("#FMT_SMR_3#", FMT_SMR_3);
                replaceDict.Add("#FMT_SMR_3_hierarchy#", FMT_SMR_3_hierarchy);
                replaceDict.Add("#FMT_SMR_3_dependence#", FMT_SMR_3_dependence);
                replaceDict.Add("#FMT_SMR_3_1#", FMT_SMR_3_1);
                replaceDict.Add("#FMT_SMR_3_1_description#", FMT_SMR_3_1_description);
  
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPR_ANO.1"))
            {
                replaceDict.Add("#FPR_ANO_1#", FPR_ANO_1);
                replaceDict.Add("#FPR_ANO_1_hierarchy#", FPR_ANO_1_hierarchy);
                replaceDict.Add("#FPR_ANO_1_dependence#", FPR_ANO_1_dependence);
                replaceDict.Add("#FPR_ANO_1_1#", FPR_ANO_1_1);
                replaceDict.Add("#FPR_ANO_1_1_description#", FPR_ANO_1_1_description);
  

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPR_ANO.2"))
            {
                replaceDict.Add("#FPR_ANO_2#", FPR_ANO_2);
                replaceDict.Add("#FPR_ANO_2_hierarchy#", FPR_ANO_2_hierarchy);
                replaceDict.Add("#FPR_ANO_2_dependence#", FPR_ANO_2_dependence);
                replaceDict.Add("#FPR_ANO_2_1#", FPR_ANO_2_1);
                replaceDict.Add("#FPR_ANO_2_1_description#", FPR_ANO_2_1_description);
                replaceDict.Add("#FPR_ANO_2_2#", FPR_ANO_2_2);
                replaceDict.Add("#FPR_ANO_2_2_description#", FPR_ANO_2_2_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPR_PSE.1"))
            {
                replaceDict.Add("#FPR_PSE_1#", FPR_PSE_1);
                replaceDict.Add("#FPR_PSE_1_hierarchy#", FPR_PSE_1_hierarchy);
                replaceDict.Add("#FPR_PSE_1_dependence#", FPR_PSE_1_dependence);
                replaceDict.Add("#FPR_PSE_1_1#", FPR_PSE_1_1);
                replaceDict.Add("#FPR_PSE_1_1_description#", FPR_PSE_1_1_description);
                replaceDict.Add("#FPR_PSE_1_2#", FPR_PSE_1_2);
                replaceDict.Add("#FPR_PSE_1_2_description#", FPR_PSE_1_2_description);
                replaceDict.Add("#FPR_PSE_1_3#", FPR_PSE_1_3);
                replaceDict.Add("#FPR_PSE_1_3_description#", FPR_PSE_1_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPR_PSE.2"))
            {
                replaceDict.Add("#FPR_PSE_2#", FPR_PSE_2);
                replaceDict.Add("#FPR_PSE_2_hierarchy#", FPR_PSE_2_hierarchy);
                replaceDict.Add("#FPR_PSE_2_dependence#", FPR_PSE_2_dependence);
                replaceDict.Add("#FPR_PSE_2_1#", FPR_PSE_2_1);
                replaceDict.Add("#FPR_PSE_2_1_description#", FPR_PSE_2_1_description);
                replaceDict.Add("#FPR_PSE_2_2#", FPR_PSE_2_2);
                replaceDict.Add("#FPR_PSE_2_2_description#", FPR_PSE_2_2_description);
                replaceDict.Add("#FPR_PSE_2_3#", FPR_PSE_2_3);
                replaceDict.Add("#FPR_PSE_2_3_description#", FPR_PSE_2_3_description);
                replaceDict.Add("#FPR_PSE_2_4#", FPR_PSE_2_4);
                replaceDict.Add("#FPR_PSE_2_4_description#", FPR_PSE_2_4_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPR_PSE.3"))
            {
                replaceDict.Add("#FPR_PSE_3#", FPR_PSE_3);
                replaceDict.Add("#FPR_PSE_3_hierarchy#", FPR_PSE_3_hierarchy);
                replaceDict.Add("#FPR_PSE_3_dependence#", FPR_PSE_3_dependence);
                replaceDict.Add("#FPR_PSE_3_1#", FPR_PSE_3_1);
                replaceDict.Add("#FPR_PSE_3_1_description#", FPR_PSE_3_1_description);
                replaceDict.Add("#FPR_PSE_3_2#", FPR_PSE_3_2);
                replaceDict.Add("#FPR_PSE_3_2_description#", FPR_PSE_3_2_description);
                replaceDict.Add("#FPR_PSE_3_3#", FPR_PSE_3_3);
                replaceDict.Add("#FPR_PSE_3_3_description#", FPR_PSE_3_3_description);
                replaceDict.Add("#FPR_PSE_3_4#", FPR_PSE_3_4);
                replaceDict.Add("#FPR_PSE_3_4_description#", FPR_PSE_3_4_description);
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FPR_UNL.1"))
            {
                replaceDict.Add("#FPR_UNL_1#", FPR_UNL_1);
                replaceDict.Add("#FPR_UNL_1_hierarchy#", FPR_UNL_1_hierarchy);
                replaceDict.Add("#FPR_UNL_1_dependence#", FPR_UNL_1_dependence);
                replaceDict.Add("#FPR_UNL_1_1#", FPR_UNL_1_1);
                replaceDict.Add("#FPR_UNL_1_1_description#", FPR_UNL_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPR_UNO.1"))
            {
                replaceDict.Add("#FPR_UNO_1#", FPR_UNO_1);
                replaceDict.Add("#FPR_UNO_1_hierarchy#", FPR_UNO_1_hierarchy);
                replaceDict.Add("#FPR_UNO_1_dependence#", FPR_UNO_1_dependence);
                replaceDict.Add("#FPR_UNO_1_1#", FPR_UNO_1_1);
                replaceDict.Add("#FPR_UNO_1_1_description#", FPR_UNO_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPR_UNO.2"))
            {
                replaceDict.Add("#FPR_UNO_2#", FPR_UNO_2);
                replaceDict.Add("#FPR_UNO_2_hierarchy#", FPR_UNO_2_hierarchy);
                replaceDict.Add("#FPR_UNO_2_dependence#", FPR_UNO_2_dependence);
                replaceDict.Add("#FPR_UNO_2_1#", FPR_UNO_2_1);
                replaceDict.Add("#FPR_UNO_2_1_description#", FPR_UNO_2_1_description);
                replaceDict.Add("#FPR_UNO_2_2#", FPR_UNO_2_2);
                replaceDict.Add("#FPR_UNO_2_2_description#", FPR_UNO_2_2_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPR_UNO.3"))
            {
                replaceDict.Add("#FPR_UNO_3#", FPR_UNO_3);
                replaceDict.Add("#FPR_UNO_3_hierarchy#", FPR_UNO_3_hierarchy);
                replaceDict.Add("#FPR_UNO_3_dependence#", FPR_UNO_3_dependence);
                replaceDict.Add("#FPR_UNO_3_1#", FPR_UNO_3_1);
                replaceDict.Add("#FPR_UNO_3_1_description#", FPR_UNO_3_1_description);
          
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FPR_UNO.4"))
            {
                replaceDict.Add("#FPR_UNO_4#", FPR_UNO_4);
                replaceDict.Add("#FPR_UNO_4_hierarchy#", FPR_UNO_4_hierarchy);
                replaceDict.Add("#FPR_UNO_4_dependence#", FPR_UNO_4_dependence);
                replaceDict.Add("#FPR_UNO_4_1#", FPR_UNO_4_1);
                replaceDict.Add("#FPR_UNO_4_1_description#", FPR_UNO_4_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_FLS.1"))
            {
                replaceDict.Add("#FPT_FLS_1#", FPT_FLS_1);
                replaceDict.Add("#FPT_FLS_1_hierarchy#", FPT_FLS_1_hierarchy);
                replaceDict.Add("#FPT_FLS_1_dependence#", FPT_FLS_1_dependence);
                replaceDict.Add("#FPT_FLS_1_1#", FPT_FLS_1_1);
                replaceDict.Add("#FPT_FLS_1_1_description#", FPT_FLS_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_ITA.1"))
            {
                replaceDict.Add("#FPT_ITA_1#", FPT_ITA_1);
                replaceDict.Add("#FPT_ITA_1_hierarchy#", FPT_ITA_1_hierarchy);
                replaceDict.Add("#FPT_ITA_1_dependence#", FPT_ITA_1_dependence);
                replaceDict.Add("#FPT_ITA_1_1#", FPT_ITA_1_1);
                replaceDict.Add("#FPT_ITA_1_1_description#", FPT_ITA_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_ITC.1"))
            {
                replaceDict.Add("#FPT_ITC_1#", FPT_ITC_1);
                replaceDict.Add("#FPT_ITC_1_hierarchy#", FPT_ITC_1_hierarchy);
                replaceDict.Add("#FPT_ITC_1_dependence#", FPT_ITC_1_dependence);
                replaceDict.Add("#FPT_ITC_1_1#", FPT_ITC_1_1);
                replaceDict.Add("#FPT_ITC_1_1_description#", FPT_ITC_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_ITI.1"))
            {
                replaceDict.Add("#FPT_ITI_1#", FPT_ITI_1);
                replaceDict.Add("#FPT_ITI_1_hierarchy#", FPT_ITI_1_hierarchy);
                replaceDict.Add("#FPT_ITI_1_dependence#", FPT_ITI_1_dependence);
                replaceDict.Add("#FPT_ITI_1_1#", FPT_ITI_1_1);
                replaceDict.Add("#FPT_ITI_1_1_description#", FPT_ITI_1_1_description);
                replaceDict.Add("#FPT_ITI_1_2#", FPT_ITI_1_2);
                replaceDict.Add("#FPT_ITI_1_2_description#", FPT_ITI_1_2_description);
            }
            else if (items is null) { }
            else { }

            if (items.Contains("FPT_ITI.2"))
            {
                replaceDict.Add("#FPT_ITI_2#", FPT_ITI_2);
                replaceDict.Add("#FPT_ITI_2_hierarchy#", FPT_ITI_2_hierarchy);
                replaceDict.Add("#FPT_ITI_2_dependence#", FPT_ITI_2_dependence);
                replaceDict.Add("#FPT_ITI_2_1#", FPT_ITI_2_1);
                replaceDict.Add("#FPT_ITI_2_1_description#", FPT_ITI_2_1_description);
                replaceDict.Add("#FPT_ITI_2_2#", FPT_ITI_2_2);
                replaceDict.Add("#FPT_ITI_2_2_description#", FPT_ITI_2_2_description);
                replaceDict.Add("#FPT_ITI_2_3#", FPT_ITI_2_3);
                replaceDict.Add("#FPT_ITI_2_3_description#", FPT_ITI_2_3_description);
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FPT_ITT.1"))
            {
                replaceDict.Add("#FPT_ITT_1#", FPT_ITT_1);
                replaceDict.Add("#FPT_ITT_1_hierarchy#", FPT_ITT_1_hierarchy);
                replaceDict.Add("#FPT_ITT_1_dependence#", FPT_ITT_1_dependence);
                replaceDict.Add("#FPT_ITT_1_1#", FPT_ITT_1_1);
                replaceDict.Add("#FPT_ITT_1_1_description#", FPT_ITT_1_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_ITT.2"))
            {
                replaceDict.Add("#FPT_ITT_2#", FPT_ITT_2);
                replaceDict.Add("#FPT_ITT_2_hierarchy#", FPT_ITT_2_hierarchy);
                replaceDict.Add("#FPT_ITT_2_dependence#", FPT_ITT_2_dependence);
                replaceDict.Add("#FPT_ITT_2_1#", FPT_ITT_2_1);
                replaceDict.Add("#FPT_ITT_2_1_description#", FPT_ITT_2_1_description);
                replaceDict.Add("#FPT_ITT_2_2#", FPT_ITT_2_2);
                replaceDict.Add("#FPT_ITT_2_2_description#", FPT_ITT_2_2_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_ITT.3"))
            {
                replaceDict.Add("#FPT_ITT_3#", FPT_ITT_3);
                replaceDict.Add("#FPT_ITT_3_hierarchy#", FPT_ITT_3_hierarchy);
                replaceDict.Add("#FPT_ITT_3_dependence#", FPT_ITT_3_dependence);
                replaceDict.Add("#FPT_ITT_3_1#", FPT_ITT_3_1);
                replaceDict.Add("#FPT_ITT_3_1_description#", FPT_ITT_3_1_description);
                replaceDict.Add("#FPT_ITT_3_2#", FPT_ITT_3_2);
                replaceDict.Add("#FPT_ITT_3_2_description#", FPT_ITT_3_2_description);
            }
            else if (items is null) { }
            else { }





            if (items.Contains("FPT_PHP.1"))
            {
                replaceDict.Add("#FPT_PHP_1#", FPT_PHP_1);
                replaceDict.Add("#FPT_PHP_1_hierarchy#", FPT_PHP_1_hierarchy);
                replaceDict.Add("#FPT_PHP_1_dependence#", FPT_PHP_1_dependence);
                replaceDict.Add("#FPT_PHP_1_1#", FPT_PHP_1_1);
                replaceDict.Add("#FPT_PHP_1_1_description#", FPT_PHP_1_1_description);
                replaceDict.Add("#FPT_PHP_1_2#", FPT_PHP_1_2);
                replaceDict.Add("#FPT_PHP_1_2_description#", FPT_PHP_1_2_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_PHP.2"))
            {
                replaceDict.Add("#FPT_PHP_2#", FPT_PHP_2);
                replaceDict.Add("#FPT_PHP_2_hierarchy#", FPT_PHP_2_hierarchy);
                replaceDict.Add("#FPT_PHP_2_dependence#", FPT_PHP_2_dependence);
                replaceDict.Add("#FPT_PHP_2_1#", FPT_PHP_2_1);
                replaceDict.Add("#FPT_PHP_2_1_description#", FPT_PHP_2_1_description);
                replaceDict.Add("#FPT_PHP_2_2#", FPT_PHP_2_2);
                replaceDict.Add("#FPT_PHP_2_2_description#", FPT_PHP_2_2_description);
                replaceDict.Add("#FPT_PHP_2_3#", FPT_PHP_2_3);
                replaceDict.Add("#FPT_PHP_2_3_description#", FPT_PHP_2_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_PHP.3"))
            {
                replaceDict.Add("#FPT_PHP_3#", FPT_PHP_3);
                replaceDict.Add("#FPT_PHP_3_hierarchy#", FPT_PHP_3_hierarchy);
                replaceDict.Add("#FPT_PHP_3_dependence#", FPT_PHP_3_dependence);
                replaceDict.Add("#FPT_PHP_3_1#", FPT_PHP_3_1);
                replaceDict.Add("#FPT_PHP_3_1_description#", FPT_PHP_3_1_description);
         
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_RCV.1"))
            {
                replaceDict.Add("#FPT_RCV_1#", FPT_RCV_1);
                replaceDict.Add("#FPT_RCV_1_hierarchy#", FPT_RCV_1_hierarchy);
                replaceDict.Add("#FPT_RCV_1_dependence#", FPT_RCV_1_dependence);
                replaceDict.Add("#FPT_RCV_1_1#", FPT_RCV_1_1);
                replaceDict.Add("#FPT_RCV_1_1_description#", FPT_RCV_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_RCV.2"))
            {
                replaceDict.Add("#FPT_RCV_2#", FPT_RCV_2);
                replaceDict.Add("#FPT_RCV_2_hierarchy#", FPT_RCV_2_hierarchy);
                replaceDict.Add("#FPT_RCV_2_dependence#", FPT_RCV_2_dependence);
                replaceDict.Add("#FPT_RCV_2_1#", FPT_RCV_2_1);
                replaceDict.Add("#FPT_RCV_2_1_description#", FPT_RCV_2_1_description);
                replaceDict.Add("#FPT_RCV_2_2#", FPT_RCV_2_2);
                replaceDict.Add("#FPT_RCV_2_2_description#", FPT_RCV_2_2_description);
            }
            else if (items is null) { }
            else { }

            if (items.Contains("FPT_RCV.3"))
            {
                replaceDict.Add("#FPT_RCV_3#", FPT_RCV_3);
                replaceDict.Add("#FPT_RCV_3_hierarchy#", FPT_RCV_3_hierarchy);
                replaceDict.Add("#FPT_RCV_3_dependence#", FPT_RCV_3_dependence);
                replaceDict.Add("#FPT_RCV_3_1#", FPT_RCV_3_1);
                replaceDict.Add("#FPT_RCV_3_1_description#", FPT_RCV_3_1_description);
                replaceDict.Add("#FPT_RCV_3_2#", FPT_RCV_3_2);
                replaceDict.Add("#FPT_RCV_3_2_description#", FPT_RCV_3_2_description);
                replaceDict.Add("#FPT_RCV_3_3#", FPT_RCV_3_3);
                replaceDict.Add("#FPT_RCV_3_3_description#", FPT_RCV_3_3_description);
                replaceDict.Add("#FPT_RCV_3_4#", FPT_RCV_3_4);
                replaceDict.Add("#FPT_RCV_3_4_description#", FPT_RCV_3_4_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_RCV.4"))
            {
                replaceDict.Add("#FPT_RCV_4#", FPT_RCV_4);
                replaceDict.Add("#FPT_RCV_4_hierarchy#", FPT_RCV_4_hierarchy);
                replaceDict.Add("#FPT_RCV_4_dependence#", FPT_RCV_4_dependence);
                replaceDict.Add("#FPT_RCV_4_1#", FPT_RCV_4_1);
                replaceDict.Add("#FPT_RCV_4_1_description#", FPT_RCV_4_1_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_RPL.1"))
            {
                replaceDict.Add("#FPT_RPL_1#", FPT_RPL_1);
                replaceDict.Add("#FPT_RPL_1_hierarchy#", FPT_RPL_1_hierarchy);
                replaceDict.Add("#FPT_RPL_1_dependence#", FPT_RPL_1_dependence);
                replaceDict.Add("#FPT_RPL_1_1#", FPT_RPL_1_1);
                replaceDict.Add("#FPT_RPL_1_1_description#", FPT_RPL_1_1_description);
                replaceDict.Add("#FPT_RPL_1_2#", FPT_RPL_1_2);
                replaceDict.Add("#FPT_RPL_1_2_description#", FPT_RPL_1_2_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_SSP.1"))
            {
                replaceDict.Add("#FPT_SSP_1#", FPT_SSP_1);
                replaceDict.Add("#FPT_SSP_1_hierarchy#", FPT_SSP_1_hierarchy);
                replaceDict.Add("#FPT_SSP_1_dependence#", FPT_SSP_1_dependence);
                replaceDict.Add("#FPT_SSP_1_1#", FPT_SSP_1_1);
                replaceDict.Add("#FPT_SSP_1_1_description#", FPT_SSP_1_1_description);
            
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FPT_SSP.2"))
            {
                replaceDict.Add("#FPT_SSP_2#", FPT_SSP_2);
                replaceDict.Add("#FPT_SSP_2_hierarchy#", FPT_SSP_2_hierarchy);
                replaceDict.Add("#FPT_SSP_2_dependence#", FPT_SSP_2_dependence);
                replaceDict.Add("#FPT_SSP_2_1#", FPT_SSP_2_1);
                replaceDict.Add("#FPT_SSP_2_1_description#", FPT_SSP_2_1_description);
                replaceDict.Add("#FPT_SSP_2_2#", FPT_SSP_2_2);
                replaceDict.Add("#FPT_SSP_2_2_description#", FPT_SSP_2_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_STM.1"))
            {
                replaceDict.Add("#FPT_STM_1#", FPT_STM_1);
                replaceDict.Add("#FPT_STM_1_hierarchy#", FPT_STM_1_hierarchy);
                replaceDict.Add("#FPT_STM_1_dependence#", FPT_STM_1_dependence);
                replaceDict.Add("#FPT_STM_1_1#", FPT_STM_1_1);
                replaceDict.Add("#FPT_STM_1_1_description#", FPT_STM_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_TDC.1"))
            {
                replaceDict.Add("#FPT_TDC_1#", FPT_TDC_1);
                replaceDict.Add("#FPT_TDC_1_hierarchy#", FPT_TDC_1_hierarchy);
                replaceDict.Add("#FPT_TDC_1_dependence#", FPT_TDC_1_dependence);
                replaceDict.Add("#FPT_TDC_1_1#", FPT_TDC_1_1);
                replaceDict.Add("#FPT_TDC_1_1_description#", FPT_TDC_1_1_description);
                replaceDict.Add("#FPT_TDC_1_2#", FPT_TDC_1_2);
                replaceDict.Add("#FPT_TDC_1_2_description#", FPT_TDC_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_TRC.1"))
            {
                replaceDict.Add("#FPT_TRC_1#", FPT_TRC_1);
                replaceDict.Add("#FPT_TRC_1_hierarchy#", FPT_TRC_1_hierarchy);
                replaceDict.Add("#FPT_TRC_1_dependence#", FPT_TRC_1_dependence);
                replaceDict.Add("#FPT_TRC_1_1#", FPT_TRC_1_1);
                replaceDict.Add("#FPT_TRC_1_1_description#", FPT_TRC_1_1_description);
                replaceDict.Add("#FPT_TRC_1_2#", FPT_TRC_1_2);
                replaceDict.Add("#FPT_TRC_1_2_description#", FPT_TRC_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FPT_TST.1"))
            {
                replaceDict.Add("#FPT_TST_1#", FPT_TST_1);
                replaceDict.Add("#FPT_TST_1_hierarchy#", FPT_TST_1_hierarchy);
                replaceDict.Add("#FPT_TST_1_dependence#", FPT_TST_1_dependence);
                replaceDict.Add("#FPT_TST_1_1#", FPT_TST_1_1);
                replaceDict.Add("#FPT_TST_1_1_description#", FPT_TST_1_1_description);
                replaceDict.Add("#FPT_TST_1_2#", FPT_TST_1_2);
                replaceDict.Add("#FPT_TST_1_2_description#", FPT_TST_1_2_description);
                replaceDict.Add("#FPT_TST_1_3#", FPT_TST_1_3);
                replaceDict.Add("#FPT_TST_1_3_description#", FPT_TST_1_3_description);
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FRU_FLT.1"))
            {
                replaceDict.Add("#FRU_FLT_1#", FRU_FLT_1);
                replaceDict.Add("#FRU_FLT_1_hierarchy#", FRU_FLT_1_hierarchy);
                replaceDict.Add("#FRU_FLT_1_dependence#", FRU_FLT_1_dependence);
                replaceDict.Add("#FRU_FLT_1_1#", FRU_FLT_1_1);
                replaceDict.Add("#FRU_FLT_1_1_description#", FRU_FLT_1_1_description);
   
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FRU_FLT.2"))
            {
                replaceDict.Add("#FRU_FLT_2#", FRU_FLT_2);
                replaceDict.Add("#FRU_FLT_2_hierarchy#", FRU_FLT_2_hierarchy);
                replaceDict.Add("#FRU_FLT_2_dependence#", FRU_FLT_2_dependence);
                replaceDict.Add("#FRU_FLT_2_1#", FRU_FLT_2_1);
                replaceDict.Add("#FRU_FLT_2_1_description#", FRU_FLT_2_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FRU_PRS.1"))
            {
                replaceDict.Add("#FRU_PRS_1#", FRU_PRS_1);
                replaceDict.Add("#FRU_PRS_1_hierarchy#", FRU_PRS_1_hierarchy);
                replaceDict.Add("#FRU_PRS_1_dependence#", FRU_PRS_1_dependence);
                replaceDict.Add("#FRU_PRS_1_1#", FRU_PRS_1_1);
                replaceDict.Add("#FRU_PRS_1_1_description#", FRU_PRS_1_1_description);
                replaceDict.Add("#FRU_PRS_1_2#", FRU_PRS_1_2);
                replaceDict.Add("#FRU_PRS_1_2_description#", FRU_PRS_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FRU_PRS.2"))
            {
                replaceDict.Add("#FRU_PRS_2#", FRU_PRS_2);
                replaceDict.Add("#FRU_PRS_2_hierarchy#", FRU_PRS_2_hierarchy);
                replaceDict.Add("#FRU_PRS_2_dependence#", FRU_PRS_2_dependence);
                replaceDict.Add("#FRU_PRS_2_1#", FRU_PRS_2_1);
                replaceDict.Add("#FRU_PRS_2_1_description#", FRU_PRS_2_1_description);
                replaceDict.Add("#FRU_PRS_2_2#", FRU_PRS_2_2);
                replaceDict.Add("#FRU_PRS_2_2_description#", FRU_PRS_2_2_description);
            }
            else if (items is null) { }
            else { }





            if (items.Contains("FRU_RSA.1"))
            {
                replaceDict.Add("#FRU_RSA_1#", FRU_RSA_1);
                replaceDict.Add("#FRU_RSA_1_hierarchy#", FRU_RSA_1_hierarchy);
                replaceDict.Add("#FRU_RSA_1_dependence#", FRU_RSA_1_dependence);
                replaceDict.Add("#FRU_RSA_1_1#", FRU_RSA_1_1);
                replaceDict.Add("#FRU_RSA_1_1_description#", FRU_RSA_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FRU_RSA.2"))
            {
                replaceDict.Add("#FRU_RSA_2#", FRU_RSA_2);
                replaceDict.Add("#FRU_RSA_2_hierarchy#", FRU_RSA_2_hierarchy);
                replaceDict.Add("#FRU_RSA_2_dependence#", FRU_RSA_2_dependence);
                replaceDict.Add("#FRU_RSA_2_1#", FRU_RSA_2_1);
                replaceDict.Add("#FRU_RSA_2_1_description#", FRU_RSA_2_1_description);
                replaceDict.Add("#FRU_RSA_2_2#", FRU_RSA_2_2);
                replaceDict.Add("#FRU_RSA_2_2_description#", FRU_RSA_2_2_description);
            }
            else if (items is null) { }
            else { }




            if (items.Contains("FTA_LSA.1"))
            {
                replaceDict.Add("#FTA_LSA_1#", FTA_LSA_1);
                replaceDict.Add("#FTA_LSA_1_hierarchy#", FTA_LSA_1_hierarchy);
                replaceDict.Add("#FTA_LSA_1_dependence#", FTA_LSA_1_dependence);
                replaceDict.Add("#FTA_LSA_1_1#", FTA_LSA_1_1);
                replaceDict.Add("#FTA_LSA_1_1_description#", FTA_LSA_1_1_description);

            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_MCS.1"))
            {
                replaceDict.Add("#FTA_MCS_1#", FTA_MCS_1);
                replaceDict.Add("#FTA_MCS_1_hierarchy#", FTA_MCS_1_hierarchy);
                replaceDict.Add("#FTA_MCS_1_dependence#", FTA_MCS_1_dependence);
                replaceDict.Add("#FTA_MCS_1_1#", FTA_MCS_1_1);
                replaceDict.Add("#FTA_MCS_1_1_description#", FTA_MCS_1_1_description);
                replaceDict.Add("#FTA_MCS_1_2#", FTA_MCS_1_2);
                replaceDict.Add("#FTA_MCS_1_2_description#", FTA_MCS_1_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_MCS.2"))
            {
                replaceDict.Add("#FTA_MCS_2#", FTA_MCS_2);
                replaceDict.Add("#FTA_MCS_2_hierarchy#", FTA_MCS_2_hierarchy);
                replaceDict.Add("#FTA_MCS_2_dependence#", FTA_MCS_2_dependence);
                replaceDict.Add("#FTA_MCS_2_1#", FTA_MCS_2_1);
                replaceDict.Add("#FTA_MCS_2_1_description#", FTA_MCS_2_1_description);
                replaceDict.Add("#FTA_MCS_2_2#", FTA_MCS_2_2);
                replaceDict.Add("#FTA_MCS_2_2_description#", FTA_MCS_2_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_SSL.1"))
            {
                replaceDict.Add("#FTA_SSL_1#", FTA_SSL_1);
                replaceDict.Add("#FTA_SSL_1_hierarchy#", FTA_SSL_1_hierarchy);
                replaceDict.Add("#FTA_SSL_1_dependence#", FTA_SSL_1_dependence);
                replaceDict.Add("#FTA_SSL_1_1#", FTA_SSL_1_1);
                replaceDict.Add("#FTA_SSL_1_1_description#", FTA_SSL_1_1_description);
                replaceDict.Add("#FTA_SSL_1_2#", FTA_SSL_1_2);
                replaceDict.Add("#FTA_SSL_1_2_description#", FTA_SSL_1_2_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FTA_SSL.2"))
            {
                replaceDict.Add("#FTA_SSL_2#", FTA_SSL_2);
                replaceDict.Add("#FTA_SSL_2_hierarchy#", FTA_SSL_2_hierarchy);
                replaceDict.Add("#FTA_SSL_2_dependence#", FTA_SSL_2_dependence);
                replaceDict.Add("#FTA_SSL_2_1#", FTA_SSL_2_1);
                replaceDict.Add("#FTA_SSL_2_1_description#", FTA_SSL_2_1_description);
                replaceDict.Add("#FTA_SSL_2_2#", FTA_SSL_2_2);
                replaceDict.Add("#FTA_SSL_2_2_description#", FTA_SSL_2_2_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_SSL.3"))
            {
                replaceDict.Add("#FTA_SSL_3#", FTA_SSL_3);
                replaceDict.Add("#FTA_SSL_3_hierarchy#", FTA_SSL_3_hierarchy);
                replaceDict.Add("#FTA_SSL_3_dependence#", FTA_SSL_3_dependence);
                replaceDict.Add("#FTA_SSL_3_1#", FTA_SSL_3_1);
                replaceDict.Add("#FTA_SSL_3_1_description#", FTA_SSL_3_1_description);
               
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_SSL.4"))
            {
                replaceDict.Add("#FTA_SSL_4#", FTA_SSL_4);
                replaceDict.Add("#FTA_SSL_4_hierarchy#", FTA_SSL_4_hierarchy);
                replaceDict.Add("#FTA_SSL_4_dependence#", FTA_SSL_4_dependence);
                replaceDict.Add("#FTA_SSL_4_1#", FTA_SSL_4_1);
                replaceDict.Add("#FTA_SSL_4_1_description#", FTA_SSL_4_1_description);

            }
            else if (items is null) { }
            else { }



            if (items.Contains("FTA_TAB.1"))
            {
                replaceDict.Add("#FTA_TAB_1#", FTA_TAB_1);
                replaceDict.Add("#FTA_TAB_1_hierarchy#", FTA_TAB_1_hierarchy);
                replaceDict.Add("#FTA_TAB_1_dependence#", FTA_TAB_1_dependence);
                replaceDict.Add("#FTA_TAB_1_1#", FTA_TAB_1_1);
                replaceDict.Add("#FTA_TAB_1_1_description#", FTA_TAB_1_1_description);
       
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_TAH.1"))
            {
                replaceDict.Add("#FTA_TAH_1#", FTA_TAH_1);
                replaceDict.Add("#FTA_TAH_1_hierarchy#", FTA_TAH_1_hierarchy);
                replaceDict.Add("#FTA_TAH_1_dependence#", FTA_TAH_1_dependence);
                replaceDict.Add("#FTA_TAH_1_1#", FTA_TAH_1_1);
                replaceDict.Add("#FTA_TAH_1_1_description#", FTA_TAH_1_1_description);
                replaceDict.Add("#FTA_TAH_1_2#", FTA_TAH_1_2);
                replaceDict.Add("#FTA_TAH_1_2_description#", FTA_TAH_1_2_description);
                replaceDict.Add("#FTA_TAH_1_3#", FTA_TAH_1_3);
                replaceDict.Add("#FTA_TAH_1_3_description#", FTA_TAH_1_3_description);
            }
            else if (items is null) { }
            else { }


            if (items.Contains("FTA_TSE.1"))
            {
                replaceDict.Add("#FTA_TSE_1#", FTA_TSE_1);
                replaceDict.Add("#FTA_TSE_1_hierarchy#", FTA_TSE_1_hierarchy);
                replaceDict.Add("#FTA_TSE_1_dependence#", FTA_TSE_1_dependence);
                replaceDict.Add("#FTA_TSE_1_1#", FTA_TSE_1_1);
                replaceDict.Add("#FTA_TSE_1_1_description#", FTA_TSE_1_1_description);
              
            }
            else if (items is null) { }
            else { }

            if (items.Contains("FTP_ITC.1"))
            {
                replaceDict.Add("#FTP_ITC_1#", FTP_ITC_1);
                replaceDict.Add("#FTP_ITC_1_hierarchy#", FTP_ITC_1_hierarchy);
                replaceDict.Add("#FTP_ITC_1_dependence#", FTP_ITC_1_dependence);
                replaceDict.Add("#FTP_ITC_1_1#", FTP_ITC_1_1);
                replaceDict.Add("#FTP_ITC_1_1_description#", FTP_ITC_1_1_description);
                replaceDict.Add("#FTP_ITC_1_2#", FTP_ITC_1_2);
                replaceDict.Add("#FTP_ITC_1_2_description#", FTP_ITC_1_2_description);
                replaceDict.Add("#FTP_ITC_1_3#", FTP_ITC_1_3);
                replaceDict.Add("#FTP_ITC_1_3_description#", FTP_ITC_1_3_description);
            }
            else if (items is null) { }
            else { }



            if (items.Contains("FTP_TRP.1"))
            {
                replaceDict.Add("#FTP_TRP_1#", FTP_TRP_1);
                replaceDict.Add("#FTP_TRP_1_hierarchy#", FTP_TRP_1_hierarchy);
                replaceDict.Add("#FTP_TRP_1_dependence#", FTP_TRP_1_dependence);
                replaceDict.Add("#FTP_TRP_1_1#", FTP_TRP_1_1);
                replaceDict.Add("#FTP_TRP_1_1_description#", FTP_TRP_1_1_description);
                replaceDict.Add("#FTP_TRP_1_2#", FTP_TRP_1_2);
                replaceDict.Add("#FTP_TRP_1_2_description#", FTP_TRP_1_2_description);
                replaceDict.Add("#FTP_TRP_1_3#", FTP_TRP_1_3);
                replaceDict.Add("#FTP_TRP_1_3_description#", FTP_TRP_1_3_description);
            }
            else if (items is null) { }
            else { }



            return replaceDict;
        }





       










        private void checkedListBox1_SelectedIndexChanged(object sender, EventArgs e)
        {
            // Get selected index, and then make sure it is valid.
            int selected = checkedListBox1.SelectedIndex;
            if (selected != -1)
            {

                items = "";
                foreach (var item in this.checkedListBox1.CheckedItems)
                {
                    items += item.ToString() + ", ";
                }
               // MessageBox.Show(items);


                

               // this.Text = checkedListBox1.Items[selected].ToString();

               
                //MessageBox.Show(this.Text);
 
            }
 
        }

        private void treeView1_AfterSelect(object sender, TreeViewEventArgs e)
        {
            // Display the text of selected node
           
            textBox1.Text = e.Node.Text;
            textBox1.ReadOnly = true;
            textBox1.BorderStyle = 0;
            textBox1.BackColor = this.BackColor;
            textBox1.TabStop = false;

            textBox2.ReadOnly = true;
            textBox2.BorderStyle = 0;
            textBox2.BackColor = this.BackColor;
            textBox2.TabStop = false;

            textBox3.ReadOnly = true;
            textBox3.BorderStyle = 0;
            textBox3.BackColor = this.BackColor;
            textBox3.TabStop = false;

            textBox4.ReadOnly = true;
            textBox4.BorderStyle = 0;
            textBox4.BackColor = this.BackColor;
            textBox4.TabStop = false;

            textBox5.ReadOnly = true;
            textBox5.BorderStyle = 0;
            textBox5.BackColor = this.BackColor;
            textBox5.TabStop = false;

            textBox6.ReadOnly = true;
            textBox6.BorderStyle = 0;
            textBox6.BackColor = this.BackColor;
            textBox6.TabStop = false;

            textBox7.ReadOnly = true;
            textBox7.BorderStyle = 0;
            textBox7.BackColor = this.BackColor;
            textBox7.TabStop = false;

            textBox8.ReadOnly = true;
            textBox8.BorderStyle = 0;
            textBox8.BackColor = this.BackColor;
            textBox8.TabStop = false;

            textBox9.ReadOnly = true;
            textBox9.BorderStyle = 0;
            textBox9.BackColor = this.BackColor;
            textBox9.TabStop = false;

            textBox10.ReadOnly = true;
            textBox10.BorderStyle = 0;
            textBox10.BackColor = this.BackColor;
            textBox10.TabStop = false;

            textBox11.ReadOnly = true;
            textBox11.BorderStyle = 0;
            textBox11.BackColor = this.BackColor;
            textBox11.TabStop = false;

            textBox12.ReadOnly = true;
            textBox12.BorderStyle = 0;
            textBox12.BackColor = this.BackColor;
            textBox12.TabStop = false;

            textBox13.ReadOnly = true;
            textBox13.BorderStyle = 0;
            textBox13.BackColor = this.BackColor;
            textBox13.TabStop = false;

            textBox14.ReadOnly = true;
            textBox14.BorderStyle = 0;
            textBox14.BackColor = this.BackColor;
            textBox14.TabStop = false;

            textBox15.ReadOnly = true;
            textBox15.BorderStyle = 0;
            textBox15.BackColor = this.BackColor;
            textBox15.TabStop = false;

            textBox16.ReadOnly = true;
            textBox16.BorderStyle = 0;
            textBox16.BackColor = this.BackColor;
            textBox16.TabStop = false;

            textBox17.ReadOnly = true;
            textBox17.BorderStyle = 0;
            textBox17.BackColor = this.BackColor;
            textBox17.TabStop = false;

            if (textBox1.Text.Contains("FAU_ARP.1"))
            {
                textBox2.Text = FAU_ARP_1_hierarchy;
                textBox3.Text = FAU_ARP_1_dependence;
                textBox4.Text = FAU_ARP_1_1;
                textBox5.Text = FAU_ARP_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_GEN.1"))
            {
                textBox2.Text = FAU_GEN_1_hierarchy;
                textBox3.Text = FAU_GEN_1_dependence;
                textBox4.Text = FAU_GEN_1_1;
                textBox5.Text = FAU_GEN_1_1_description;
                textBox6.Text = FAU_GEN_1_2;
                textBox7.Text = FAU_GEN_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_GEN.2"))
            {
                textBox2.Text = FAU_GEN_2_hierarchy;
                textBox3.Text = FAU_GEN_2_dependence;
                textBox4.Text = FAU_GEN_2_1;
                textBox5.Text = FAU_GEN_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAA.1"))
            {
                textBox2.Text = FAU_SAA_1_hierarchy;
                textBox3.Text = FAU_SAA_1_dependence;
                textBox4.Text = FAU_SAA_1_1;
                textBox5.Text = FAU_SAA_1_1_description;
                textBox6.Text = FAU_SAA_1_2;
                textBox7.Text = FAU_SAA_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAA.2"))
            {
                textBox2.Text = FAU_SAA_2_hierarchy;
                textBox3.Text = FAU_SAA_2_dependence;
                textBox4.Text = FAU_SAA_2_1;
                textBox5.Text = FAU_SAA_2_1_description;
                textBox6.Text = FAU_SAA_2_2;
                textBox7.Text = FAU_SAA_2_2_description;
                textBox8.Text = FAU_SAA_2_3;
                textBox9.Text = FAU_SAA_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAA.3"))
            {
                textBox2.Text = FAU_SAA_3_hierarchy;
                textBox3.Text = FAU_SAA_3_dependence;
                textBox4.Text = FAU_SAA_3_1;
                textBox5.Text = FAU_SAA_3_1_description;
                textBox6.Text = FAU_SAA_3_2;
                textBox7.Text = FAU_SAA_3_2_description;
                textBox8.Text = FAU_SAA_3_3;
                textBox9.Text = FAU_SAA_3_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAA.4"))
            {
                textBox2.Text = FAU_SAA_4_hierarchy;
                textBox3.Text = FAU_SAA_4_dependence;
                textBox4.Text = FAU_SAA_4_1;
                textBox5.Text = FAU_SAA_4_1_description;
                textBox6.Text = FAU_SAA_4_2;
                textBox7.Text = FAU_SAA_4_2_description;
                textBox8.Text = FAU_SAA_4_3;
                textBox9.Text = FAU_SAA_4_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAR.1"))
            {
                textBox2.Text = FAU_SAR_1_hierarchy;
                textBox3.Text = FAU_SAR_1_dependence;
                textBox4.Text = FAU_SAR_1_1;
                textBox5.Text = FAU_SAR_1_1_description;
                textBox6.Text = FAU_SAR_1_2;
                textBox7.Text = FAU_SAR_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAR.2"))
            {
                textBox2.Text = FAU_SAR_2_hierarchy;
                textBox3.Text = FAU_SAR_2_dependence;
                textBox4.Text = FAU_SAR_2_1;
                textBox5.Text = FAU_SAR_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SAR.3"))
            {
                textBox2.Text = FAU_SAR_3_hierarchy;
                textBox3.Text = FAU_SAR_3_dependence;
                textBox4.Text = FAU_SAR_3_1;
                textBox5.Text = FAU_SAR_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_SEL.1"))
            {
                textBox2.Text = FAU_SEL_1_hierarchy;
                textBox3.Text = FAU_SEL_1_dependence;
                textBox4.Text = FAU_SEL_1_1;
                textBox5.Text = FAU_SEL_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_STG.1"))
            {
                textBox2.Text = FAU_STG_1_hierarchy;
                textBox3.Text = FAU_STG_1_dependence;
                textBox4.Text = FAU_STG_1_1;
                textBox5.Text = FAU_STG_1_1_description;
                textBox6.Text = FAU_STG_1_2;
                textBox7.Text = FAU_STG_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_STG.2"))
            {
                textBox2.Text = FAU_STG_2_hierarchy;
                textBox3.Text = FAU_STG_2_dependence;
                textBox4.Text = FAU_STG_2_1;
                textBox5.Text = FAU_STG_2_1_description;
                textBox6.Text = FAU_STG_2_2;
                textBox7.Text = FAU_STG_2_2_description;
                textBox8.Text = FAU_STG_2_3;
                textBox9.Text = FAU_STG_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_STG.3"))
            {
                textBox2.Text = FAU_STG_3_hierarchy;
                textBox3.Text = FAU_STG_3_dependence;
                textBox4.Text = FAU_STG_3_1;
                textBox5.Text = FAU_STG_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FAU_STG.4"))
            {
                textBox2.Text = FAU_STG_4_hierarchy;
                textBox3.Text = FAU_STG_4_dependence;
                textBox4.Text = FAU_STG_4_1;
                textBox5.Text = FAU_STG_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";

            }
            else if (textBox1.Text.Contains("FCO_NRO.1"))
            {
                textBox2.Text = FCO_NRO_1_hierarchy;
                textBox3.Text = FCO_NRO_1_dependence;
                textBox4.Text = FCO_NRO_1_1;
                textBox5.Text = FCO_NRO_1_1_description;
                textBox6.Text = FCO_NRO_1_2;
                textBox7.Text = FCO_NRO_1_2_description;
                textBox8.Text = FCO_NRO_1_3;
                textBox9.Text = FCO_NRO_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCO_NRO.2"))
            {
                textBox2.Text = FCO_NRO_2_hierarchy;
                textBox3.Text = FCO_NRO_2_dependence;
                textBox4.Text = FCO_NRO_2_1;
                textBox5.Text = FCO_NRO_2_1_description;
                textBox6.Text = FCO_NRO_2_2;
                textBox7.Text = FCO_NRO_2_2_description;
                textBox8.Text = FCO_NRO_2_3;
                textBox9.Text = FCO_NRO_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCO_NRR.1"))
            {
                textBox2.Text = FCO_NRR_1_hierarchy;
                textBox3.Text = FCO_NRR_1_dependence;
                textBox4.Text = FCO_NRR_1_1;
                textBox5.Text = FCO_NRR_1_1_description;
                textBox6.Text = FCO_NRR_1_2;
                textBox7.Text = FCO_NRR_1_2_description;
                textBox8.Text = FCO_NRR_1_3;
                textBox9.Text = FCO_NRR_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCO_NRR.2"))
            {
                textBox2.Text = FCO_NRR_2_hierarchy;
                textBox3.Text = FCO_NRR_2_dependence;
                textBox4.Text = FCO_NRR_2_1;
                textBox5.Text = FCO_NRR_2_1_description;
                textBox6.Text = FCO_NRR_2_2;
                textBox7.Text = FCO_NRR_2_2_description;
                textBox8.Text = FCO_NRR_2_3;
                textBox9.Text = FCO_NRR_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCS_CKM.1"))
            {
                textBox2.Text = FCS_CKM_1_hierarchy;
                textBox3.Text = FCS_CKM_1_dependence;
                textBox4.Text = FCS_CKM_1_1;
                textBox5.Text = FCS_CKM_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCS_CKM.2"))
            {
                textBox2.Text = FCS_CKM_2_hierarchy;
                textBox3.Text = FCS_CKM_2_dependence;
                textBox4.Text = FCS_CKM_2_1;
                textBox5.Text = FCS_CKM_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCS_CKM.3"))
            {
                textBox2.Text = FCS_CKM_3_hierarchy;
                textBox3.Text = FCS_CKM_3_dependence;
                textBox4.Text = FCS_CKM_3_1;
                textBox5.Text = FCS_CKM_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCS_CKM.4"))
            {
                textBox2.Text = FCS_CKM_4_hierarchy;
                textBox3.Text = FCS_CKM_4_dependence;
                textBox4.Text = FCS_CKM_4_1;
                textBox5.Text = FCS_CKM_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FCS_COP.1"))
            {
                textBox2.Text = FCS_COP_1_hierarchy;
                textBox3.Text = FCS_COP_1_dependence;
                textBox4.Text = FCS_COP_1_1;
                textBox5.Text = FCS_COP_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ACC.1"))
            {
                textBox2.Text = FDP_ACC_1_hierarchy;
                textBox3.Text = FDP_ACC_1_dependence;
                textBox4.Text = FDP_ACC_1_1;
                textBox5.Text = FDP_ACC_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ACC.2"))
            {
                textBox2.Text = FDP_ACC_2_hierarchy;
                textBox3.Text = FDP_ACC_2_dependence;
                textBox4.Text = FDP_ACC_2_1;
                textBox5.Text = FDP_ACC_2_1_description;
                textBox6.Text = FDP_ACC_2_2;
                textBox7.Text = FDP_ACC_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ACF.1"))
            {
                textBox2.Text = FDP_ACF_1_hierarchy;
                textBox3.Text = FDP_ACF_1_dependence;
                textBox4.Text = FDP_ACF_1_1;
                textBox5.Text = FDP_ACF_1_1_description;
                textBox6.Text = FDP_ACF_1_2;
                textBox7.Text = FDP_ACF_1_2_description;
                textBox8.Text = FDP_ACF_1_3;
                textBox9.Text = FDP_ACF_1_3_description;
                textBox10.Text = FDP_ACF_1_4;
                textBox11.Text = FDP_ACF_1_4_description;
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_DAU.1"))
            {
                textBox2.Text = FDP_DAU_1_hierarchy;
                textBox3.Text = FDP_DAU_1_dependence;
                textBox4.Text = FDP_DAU_1_1;
                textBox5.Text = FDP_DAU_1_1_description;
                textBox6.Text = FDP_DAU_1_2;
                textBox7.Text = FDP_DAU_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_DAU.2"))
            {
                textBox2.Text = FDP_DAU_2_hierarchy;
                textBox3.Text = FDP_DAU_2_dependence;
                textBox4.Text = FDP_DAU_2_1;
                textBox5.Text = FDP_DAU_2_1_description;
                textBox6.Text = FDP_DAU_2_2;
                textBox7.Text = FDP_DAU_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ETC.1"))
            {
                textBox2.Text = FDP_ETC_1_hierarchy;
                textBox3.Text = FDP_ETC_1_dependence;
                textBox4.Text = FDP_ETC_1_1;
                textBox5.Text = FDP_ETC_1_1_description;
                textBox6.Text = FDP_ETC_1_2;
                textBox7.Text = FDP_ETC_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ETC.2"))
            {
                textBox2.Text = FDP_ETC_2_hierarchy;
                textBox3.Text = FDP_ETC_2_dependence;
                textBox4.Text = FDP_ETC_2_1;
                textBox5.Text = FDP_ETC_2_1_description;
                textBox6.Text = FDP_ETC_2_2;
                textBox7.Text = FDP_ETC_2_2_description;
                textBox8.Text = FDP_ETC_2_3;
                textBox9.Text = FDP_ETC_2_3_description;
                textBox10.Text = FDP_ETC_2_4;
                textBox11.Text = FDP_ETC_2_4_description;
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFC.1"))
            {
                textBox2.Text = FDP_IFC_1_hierarchy;
                textBox3.Text = FDP_IFC_1_dependence;
                textBox4.Text = FDP_IFC_1_1;
                textBox5.Text = FDP_IFC_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFC.2"))
            {
                textBox2.Text = FDP_IFC_2_hierarchy;
                textBox3.Text = FDP_IFC_2_dependence;
                textBox4.Text = FDP_IFC_2_1;
                textBox5.Text = FDP_IFC_2_1_description;
                textBox6.Text = FDP_IFC_2_2;
                textBox7.Text = FDP_IFC_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.1"))
            {
                textBox2.Text = FDP_IFF_1_hierarchy;
                textBox3.Text = FDP_IFF_1_dependence;
                textBox4.Text = FDP_IFF_1_1;
                textBox5.Text = FDP_IFF_1_1_description;
                textBox6.Text = FDP_IFF_1_2;
                textBox7.Text = FDP_IFF_1_2_description;
                textBox8.Text = FDP_IFF_1_3;
                textBox9.Text = FDP_IFF_1_3_description;
                textBox10.Text = FDP_IFF_1_4;
                textBox11.Text = FDP_IFF_1_4_description;
                textBox12.Text = FDP_IFF_1_5;
                textBox13.Text = FDP_IFF_1_5_description;
                textBox14.Text = FDP_IFF_1_6;
                textBox15.Text = FDP_IFF_1_6_description;
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.2"))
            {
                textBox2.Text = FDP_IFF_2_hierarchy;
                textBox3.Text = FDP_IFF_2_dependence;
                textBox4.Text = FDP_IFF_2_1;
                textBox5.Text = FDP_IFF_2_1_description;
                textBox6.Text = FDP_IFF_2_2;
                textBox7.Text = FDP_IFF_2_2_description;
                textBox8.Text = FDP_IFF_2_3;
                textBox9.Text = FDP_IFF_2_3_description;
                textBox10.Text = FDP_IFF_2_4;
                textBox11.Text = FDP_IFF_2_4_description;
                textBox12.Text = FDP_IFF_2_5;
                textBox13.Text = FDP_IFF_2_5_description;
                textBox14.Text = FDP_IFF_2_6;
                textBox15.Text = FDP_IFF_2_6_description;
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.3"))
            {
                textBox2.Text = FDP_IFF_3_hierarchy;
                textBox3.Text = FDP_IFF_3_dependence;
                textBox4.Text = FDP_IFF_3_1;
                textBox5.Text = FDP_IFF_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.4"))
            {
                textBox2.Text = FDP_IFF_4_hierarchy;
                textBox3.Text = FDP_IFF_4_dependence;
                textBox4.Text = FDP_IFF_4_1;
                textBox5.Text = FDP_IFF_4_1_description;
                textBox6.Text = FDP_IFF_4_2;
                textBox7.Text = FDP_IFF_4_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.5"))
            {
                textBox2.Text = FDP_IFF_5_hierarchy;
                textBox3.Text = FDP_IFF_5_dependence;
                textBox4.Text = FDP_IFF_5_1;
                textBox5.Text = FDP_IFF_5_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_IFF.6"))
            {
                textBox2.Text = FDP_IFF_6_hierarchy;
                textBox3.Text = FDP_IFF_6_dependence;
                textBox4.Text = FDP_IFF_6_1;
                textBox5.Text = FDP_IFF_6_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITC.1"))
            {
                textBox2.Text = FDP_ITC_1_hierarchy;
                textBox3.Text = FDP_ITC_1_dependence;
                textBox4.Text = FDP_ITC_1_1;
                textBox5.Text = FDP_ITC_1_1_description;
                textBox6.Text = FDP_ITC_1_2;
                textBox7.Text = FDP_ITC_1_2_description;
                textBox8.Text = FDP_ITC_1_3;
                textBox9.Text = FDP_ITC_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITC.2"))
            {
                textBox2.Text = FDP_ITC_2_hierarchy;
                textBox3.Text = FDP_ITC_2_dependence;
                textBox4.Text = FDP_ITC_2_1;
                textBox5.Text = FDP_ITC_2_1_description;
                textBox6.Text = FDP_ITC_2_2;
                textBox7.Text = FDP_ITC_2_2_description;
                textBox8.Text = FDP_ITC_2_3;
                textBox9.Text = FDP_ITC_2_3_description;
                textBox10.Text = FDP_ITC_2_4;
                textBox11.Text = FDP_ITC_2_4_description;
                textBox12.Text = FDP_ITC_2_5;
                textBox13.Text = FDP_ITC_2_5_description;
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITT.1"))
            {
                textBox2.Text = FDP_ITT_1_hierarchy;
                textBox3.Text = FDP_ITT_1_dependence;
                textBox4.Text = FDP_ITT_1_1;
                textBox5.Text = FDP_ITT_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITT.2"))
            {
                textBox2.Text = FDP_ITT_2_hierarchy;
                textBox3.Text = FDP_ITT_2_dependence;
                textBox4.Text = FDP_ITT_2_1;
                textBox5.Text = FDP_ITT_2_1_description;
                textBox6.Text = FDP_ITT_2_2;
                textBox7.Text = FDP_ITT_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITT.3"))
            {
                textBox2.Text = FDP_ITT_3_hierarchy;
                textBox3.Text = FDP_ITT_3_dependence;
                textBox4.Text = FDP_ITT_3_1;
                textBox5.Text = FDP_ITT_3_1_description;
                textBox6.Text = FDP_ITT_3_2;
                textBox7.Text = FDP_ITT_3_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ITT.4"))
            {
                textBox2.Text = FDP_ITT_4_hierarchy;
                textBox3.Text = FDP_ITT_4_dependence;
                textBox4.Text = FDP_ITT_4_1;
                textBox5.Text = FDP_ITT_4_1_description;
                textBox6.Text = FDP_ITT_4_2;
                textBox7.Text = FDP_ITT_4_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_RIP.1"))
            {
                textBox2.Text = FDP_RIP_1_hierarchy;
                textBox3.Text = FDP_RIP_1_dependence;
                textBox4.Text = FDP_RIP_1_1;
                textBox5.Text = FDP_RIP_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_RIP.2"))
            {
                textBox2.Text = FDP_RIP_2_hierarchy;
                textBox3.Text = FDP_RIP_2_dependence;
                textBox4.Text = FDP_RIP_2_1;
                textBox5.Text = FDP_RIP_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ROL.1"))
            {
                textBox2.Text = FDP_ROL_1_hierarchy;
                textBox3.Text = FDP_ROL_1_dependence;
                textBox4.Text = FDP_ROL_1_1;
                textBox5.Text = FDP_ROL_1_1_description;
                textBox6.Text = FDP_ROL_1_2;
                textBox7.Text = FDP_ROL_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_ROL.2"))
            {
                textBox2.Text = FDP_ROL_2_hierarchy;
                textBox3.Text = FDP_ROL_2_dependence;
                textBox4.Text = FDP_ROL_2_1;
                textBox5.Text = FDP_ROL_2_1_description;
                textBox6.Text = FDP_ROL_2_2;
                textBox7.Text = FDP_ROL_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_SDI.1"))
            {
                textBox2.Text = FDP_SDI_1_hierarchy;
                textBox3.Text = FDP_SDI_1_dependence;
                textBox4.Text = FDP_SDI_1_1;
                textBox5.Text = FDP_SDI_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_SDI.2"))
            {
                textBox2.Text = FDP_SDI_2_hierarchy;
                textBox3.Text = FDP_SDI_2_dependence;
                textBox4.Text = FDP_SDI_2_1;
                textBox5.Text = FDP_SDI_2_1_description;
                textBox6.Text = FDP_SDI_2_2;
                textBox7.Text = FDP_SDI_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_UCT.1"))
            {
                textBox2.Text = FDP_UCT_1_hierarchy;
                textBox3.Text = FDP_UCT_1_dependence;
                textBox4.Text = FDP_UCT_1_1;
                textBox5.Text = FDP_UCT_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_UIT.1"))
            {
                textBox2.Text = FDP_UIT_1_hierarchy;
                textBox3.Text = FDP_UIT_1_dependence;
                textBox4.Text = FDP_UIT_1_1;
                textBox5.Text = FDP_UIT_1_1_description;
                textBox6.Text = FDP_UIT_1_2;
                textBox7.Text = FDP_UIT_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_UIT.2"))
            {
                textBox2.Text = FDP_UIT_2_hierarchy;
                textBox3.Text = FDP_UIT_2_dependence;
                textBox4.Text = FDP_UIT_2_1;
                textBox5.Text = FDP_UIT_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FDP_UIT.3"))
            {
                textBox2.Text = FDP_UIT_3_hierarchy;
                textBox3.Text = FDP_UIT_3_dependence;
                textBox4.Text = FDP_UIT_3_1;
                textBox5.Text = FDP_UIT_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_AFL.1"))
            {
                textBox2.Text = FIA_AFL_1_hierarchy;
                textBox3.Text = FIA_AFL_1_dependence;
                textBox4.Text = FIA_AFL_1_1;
                textBox5.Text = FIA_AFL_1_1_description;
                textBox6.Text = FIA_AFL_1_2;
                textBox7.Text = FIA_AFL_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_ATD.1"))
            {
                textBox2.Text = FIA_ATD_1_hierarchy;
                textBox3.Text = FIA_ATD_1_dependence;
                textBox4.Text = FIA_ATD_1_1;
                textBox5.Text = FIA_ATD_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_SOS.1"))
            {
                textBox2.Text = FIA_SOS_1_hierarchy;
                textBox3.Text = FIA_SOS_1_dependence;
                textBox4.Text = FIA_SOS_1_1;
                textBox5.Text = FIA_SOS_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_SOS.2"))
            {
                textBox2.Text = FIA_SOS_2_hierarchy;
                textBox3.Text = FIA_SOS_2_dependence;
                textBox4.Text = FIA_SOS_2_1;
                textBox5.Text = FIA_SOS_2_1_description;
                textBox6.Text = FIA_SOS_2_2;
                textBox7.Text = FIA_SOS_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.1"))
            {
                textBox2.Text = FIA_UAU_1_hierarchy;
                textBox3.Text = FIA_UAU_1_dependence;
                textBox4.Text = FIA_UAU_1_1;
                textBox5.Text = FIA_UAU_1_1_description;
                textBox6.Text = FIA_UAU_1_2;
                textBox7.Text = FIA_UAU_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.2"))
            {
                textBox2.Text = FIA_UAU_2_hierarchy;
                textBox3.Text = FIA_UAU_2_dependence;
                textBox4.Text = FIA_UAU_2_1;
                textBox5.Text = FIA_UAU_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.3"))
            {
                textBox2.Text = FIA_UAU_3_hierarchy;
                textBox3.Text = FIA_UAU_3_dependence;
                textBox4.Text = FIA_UAU_3_1;
                textBox5.Text = FIA_UAU_3_1_description;
                textBox6.Text = FIA_UAU_3_2;
                textBox7.Text = FIA_UAU_3_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.4"))
            {
                textBox2.Text = FIA_UAU_4_hierarchy;
                textBox3.Text = FIA_UAU_4_dependence;
                textBox4.Text = FIA_UAU_4_1;
                textBox5.Text = FIA_UAU_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.5"))
            {
                textBox2.Text = FIA_UAU_5_hierarchy;
                textBox3.Text = FIA_UAU_5_dependence;
                textBox4.Text = FIA_UAU_5_1;
                textBox5.Text = FIA_UAU_5_1_description;
                textBox6.Text = FIA_UAU_5_2;
                textBox7.Text = FIA_UAU_5_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.6"))
            {
                textBox2.Text = FIA_UAU_6_hierarchy;
                textBox3.Text = FIA_UAU_6_dependence;
                textBox4.Text = FIA_UAU_6_1;
                textBox5.Text = FIA_UAU_6_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UAU.7"))
            {
                textBox2.Text = FIA_UAU_7_hierarchy;
                textBox3.Text = FIA_UAU_7_dependence;
                textBox4.Text = FIA_UAU_7_1;
                textBox5.Text = FIA_UAU_7_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UID.1"))
            {
                textBox2.Text = FIA_UID_1_hierarchy;
                textBox3.Text = FIA_UID_1_dependence;
                textBox4.Text = FIA_UID_1_1;
                textBox5.Text = FIA_UID_1_1_description;
                textBox6.Text = FIA_UID_1_2;
                textBox7.Text = FIA_UID_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_UID.2"))
            {
                textBox2.Text = FIA_UID_2_hierarchy;
                textBox3.Text = FIA_UID_2_dependence;
                textBox4.Text = FIA_UID_2_1;
                textBox5.Text = FIA_UID_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FIA_USB.1"))
            {
                textBox2.Text = FIA_USB_1_hierarchy;
                textBox3.Text = FIA_USB_1_dependence;
                textBox4.Text = FIA_USB_1_1;
                textBox5.Text = FIA_USB_1_1_description;
                textBox6.Text = FIA_USB_1_2;
                textBox7.Text = FIA_USB_1_2_description;
                textBox8.Text = FIA_USB_1_3;
                textBox9.Text = FIA_USB_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MOF.1"))
            {
                textBox2.Text = FMT_MOF_1_hierarchy;
                textBox3.Text = FMT_MOF_1_dependence;
                textBox4.Text = FMT_MOF_1_1;
                textBox5.Text = FMT_MOF_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MSA.1"))
            {
                textBox2.Text = FMT_MSA_1_hierarchy;
                textBox3.Text = FMT_MSA_1_dependence;
                textBox4.Text = FMT_MSA_1_1;
                textBox5.Text = FMT_MSA_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MSA.2"))
            {
                textBox2.Text = FMT_MSA_2_hierarchy;
                textBox3.Text = FMT_MSA_2_dependence;
                textBox4.Text = FMT_MSA_2_1;
                textBox5.Text = FMT_MSA_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MSA.3"))
            {
                textBox2.Text = FMT_MSA_3_hierarchy;
                textBox3.Text = FMT_MSA_3_dependence;
                textBox4.Text = FMT_MSA_3_1;
                textBox5.Text = FMT_MSA_3_1_description;
                textBox6.Text = FMT_MSA_3_2;
                textBox7.Text = FMT_MSA_3_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MSA.4"))
            {
                textBox2.Text = FMT_MSA_4_hierarchy;
                textBox3.Text = FMT_MSA_4_dependence;
                textBox4.Text = FMT_MSA_4_1;
                textBox5.Text = FMT_MSA_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MTD.1"))
            {
                textBox2.Text = FMT_MTD_1_hierarchy;
                textBox3.Text = FMT_MTD_1_dependence;
                textBox4.Text = FMT_MTD_1_1;
                textBox5.Text = FMT_MTD_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MTD.2"))
            {
                textBox2.Text = FMT_MTD_2_hierarchy;
                textBox3.Text = FMT_MTD_2_dependence;
                textBox4.Text = FMT_MTD_2_1;
                textBox5.Text = FMT_MTD_2_1_description;
                textBox6.Text = FMT_MTD_2_2;
                textBox7.Text = FMT_MTD_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_MTD.3"))
            {
                textBox2.Text = FMT_MTD_3_hierarchy;
                textBox3.Text = FMT_MTD_3_dependence;
                textBox4.Text = FMT_MTD_3_1;
                textBox5.Text = FMT_MTD_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_REV.1"))
            {
                textBox2.Text = FMT_REV_1_hierarchy;
                textBox3.Text = FMT_REV_1_dependence;
                textBox4.Text = FMT_REV_1_1;
                textBox5.Text = FMT_REV_1_1_description;
                textBox6.Text = FMT_REV_1_2;
                textBox7.Text = FMT_REV_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_SAE.1"))
            {
                textBox2.Text = FMT_SAE_1_hierarchy;
                textBox3.Text = FMT_SAE_1_dependence;
                textBox4.Text = FMT_SAE_1_1;
                textBox5.Text = FMT_SAE_1_1_description;
                textBox6.Text = FMT_SAE_1_2;
                textBox7.Text = FMT_SAE_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_SMF.1"))
            {
                textBox2.Text = FMT_SMF_1_hierarchy;
                textBox3.Text = FMT_SMF_1_dependence;
                textBox4.Text = FMT_SMF_1_1;
                textBox5.Text = FMT_SMF_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_SMR.1"))
            {
                textBox2.Text = FMT_SMR_1_hierarchy;
                textBox3.Text = FMT_SMR_1_dependence;
                textBox4.Text = FMT_SMR_1_1;
                textBox5.Text = FMT_SMR_1_1_description;
                textBox6.Text = FMT_SMR_1_2;
                textBox7.Text = FMT_SMR_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_SMR.2"))
            {
                textBox2.Text = FMT_SMR_2_hierarchy;
                textBox3.Text = FMT_SMR_2_dependence;
                textBox4.Text = FMT_SMR_2_1;
                textBox5.Text = FMT_SMR_2_1_description;
                textBox6.Text = FMT_SMR_2_2;
                textBox7.Text = FMT_SMR_2_2_description;
                textBox8.Text = FMT_SMR_2_3;
                textBox9.Text = FMT_SMR_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FMT_SMR.3"))
            {
                textBox2.Text = FMT_SMR_3_hierarchy;
                textBox3.Text = FMT_SMR_3_dependence;
                textBox4.Text = FMT_SMR_3_1;
                textBox5.Text = FMT_SMR_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_ANO.1"))
            {
                textBox2.Text = FPR_ANO_1_hierarchy;
                textBox3.Text = FPR_ANO_1_dependence;
                textBox4.Text = FPR_ANO_1_1;
                textBox5.Text = FPR_ANO_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_ANO.2"))
            {
                textBox2.Text = FPR_ANO_2_hierarchy;
                textBox3.Text = FPR_ANO_2_dependence;
                textBox4.Text = FPR_ANO_2_1;
                textBox5.Text = FPR_ANO_2_1_description;
                textBox6.Text = FPR_ANO_2_2;
                textBox7.Text = FPR_ANO_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_PSE.1"))
            {
                textBox2.Text = FPR_PSE_1_hierarchy;
                textBox3.Text = FPR_PSE_1_dependence;
                textBox4.Text = FPR_PSE_1_1;
                textBox5.Text = FPR_PSE_1_1_description;
                textBox6.Text = FPR_PSE_1_2;
                textBox7.Text = FPR_PSE_1_2_description;
                textBox8.Text = FPR_PSE_1_3;
                textBox9.Text = FPR_PSE_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_PSE.2"))
            {
                textBox2.Text = FPR_PSE_2_hierarchy;
                textBox3.Text = FPR_PSE_2_dependence;
                textBox4.Text = FPR_PSE_2_1;
                textBox5.Text = FPR_PSE_2_1_description;
                textBox6.Text = FPR_PSE_2_2;
                textBox7.Text = FPR_PSE_2_2_description;
                textBox8.Text = FPR_PSE_2_3;
                textBox9.Text = FPR_PSE_2_3_description;
                textBox10.Text = FPR_PSE_2_4;
                textBox11.Text = FPR_PSE_2_4_description;
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_PSE.3"))
            {
                textBox2.Text = FPR_PSE_3_hierarchy;
                textBox3.Text = FPR_PSE_3_dependence;
                textBox4.Text = FPR_PSE_3_1;
                textBox5.Text = FPR_PSE_3_1_description;
                textBox6.Text = FPR_PSE_3_2;
                textBox7.Text = FPR_PSE_3_2_description;
                textBox8.Text = FPR_PSE_3_3;
                textBox9.Text = FPR_PSE_3_3_description;
                textBox10.Text = FPR_PSE_3_4;
                textBox11.Text = FPR_PSE_3_4_description;
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_UNL.1"))
            {
                textBox2.Text = FPR_UNL_1_hierarchy;
                textBox3.Text = FPR_UNL_1_dependence;
                textBox4.Text = FPR_UNL_1_1;
                textBox5.Text = FPR_UNL_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_UNO.1"))
            {
                textBox2.Text = FPR_UNO_1_hierarchy;
                textBox3.Text = FPR_UNO_1_dependence;
                textBox4.Text = FPR_UNO_1_1;
                textBox5.Text = FPR_UNO_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_UNO.2"))
            {
                textBox2.Text = FPR_UNO_2_hierarchy;
                textBox3.Text = FPR_UNO_2_dependence;
                textBox4.Text = FPR_UNO_2_1;
                textBox5.Text = FPR_UNO_2_1_description;
                textBox6.Text = FPR_UNO_2_2;
                textBox7.Text = FPR_UNO_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_UNO.3"))
            {
                textBox2.Text = FPR_UNO_3_hierarchy;
                textBox3.Text = FPR_UNO_3_dependence;
                textBox4.Text = FPR_UNO_3_1;
                textBox5.Text = FPR_UNO_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPR_UNO.4"))
            {
                textBox2.Text = FPR_UNO_4_hierarchy;
                textBox3.Text = FPR_UNO_4_dependence;
                textBox4.Text = FPR_UNO_4_1;
                textBox5.Text = FPR_UNO_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_FLS.1"))
            {
                textBox2.Text = FPT_FLS_1_hierarchy;
                textBox3.Text = FPT_FLS_1_dependence;
                textBox4.Text = FPT_FLS_1_1;
                textBox5.Text = FPT_FLS_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITA.1"))
            {
                textBox2.Text = FPT_ITA_1_hierarchy;
                textBox3.Text = FPT_ITA_1_dependence;
                textBox4.Text = FPT_ITA_1_1;
                textBox5.Text = FPT_ITA_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITC.1"))
            {
                textBox2.Text = FPT_ITC_1_hierarchy;
                textBox3.Text = FPT_ITC_1_dependence;
                textBox4.Text = FPT_ITC_1_1;
                textBox5.Text = FPT_ITC_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITI.1"))
            {
                textBox2.Text = FPT_ITI_1_hierarchy;
                textBox3.Text = FPT_ITI_1_dependence;
                textBox4.Text = FPT_ITI_1_1;
                textBox5.Text = FPT_ITI_1_1_description;
                textBox6.Text = FPT_ITI_1_2;
                textBox7.Text = FPT_ITI_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITI.2"))
            {
                textBox2.Text = FPT_ITI_2_hierarchy;
                textBox3.Text = FPT_ITI_2_dependence;
                textBox4.Text = FPT_ITI_2_1;
                textBox5.Text = FPT_ITI_2_1_description;
                textBox6.Text = FPT_ITI_2_2;
                textBox7.Text = FPT_ITI_2_2_description;
                textBox8.Text = FPT_ITI_2_3;
                textBox9.Text = FPT_ITI_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITT.1"))
            {
                textBox2.Text = FPT_ITT_1_hierarchy;
                textBox3.Text = FPT_ITT_1_dependence;
                textBox4.Text = FPT_ITT_1_1;
                textBox5.Text = FPT_ITT_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITT.2"))
            {
                textBox2.Text = FPT_ITT_2_hierarchy;
                textBox3.Text = FPT_ITT_2_dependence;
                textBox4.Text = FPT_ITT_2_1;
                textBox5.Text = FPT_ITT_2_1_description;
                textBox6.Text = FPT_ITT_2_2;
                textBox7.Text = FPT_ITT_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_ITT.3"))
            {
                textBox2.Text = FPT_ITT_3_hierarchy;
                textBox3.Text = FPT_ITT_3_dependence;
                textBox4.Text = FPT_ITT_3_1;
                textBox5.Text = FPT_ITT_3_1_description;
                textBox6.Text = FPT_ITT_3_2;
                textBox7.Text = FPT_ITT_3_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_PHP.1"))
            {
                textBox2.Text = FPT_PHP_1_hierarchy;
                textBox3.Text = FPT_PHP_1_dependence;
                textBox4.Text = FPT_PHP_1_1;
                textBox5.Text = FPT_PHP_1_1_description;
                textBox6.Text = FPT_PHP_1_2;
                textBox7.Text = FPT_PHP_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_PHP.2"))
            {
                textBox2.Text = FPT_PHP_2_hierarchy;
                textBox3.Text = FPT_PHP_2_dependence;
                textBox4.Text = FPT_PHP_2_1;
                textBox5.Text = FPT_PHP_2_1_description;
                textBox6.Text = FPT_PHP_2_2;
                textBox7.Text = FPT_PHP_2_2_description;
                textBox8.Text = FPT_PHP_2_3;
                textBox9.Text = FPT_PHP_2_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_PHP.3"))
            {
                textBox2.Text = FPT_PHP_3_hierarchy;
                textBox3.Text = FPT_PHP_3_dependence;
                textBox4.Text = FPT_PHP_3_1;
                textBox5.Text = FPT_PHP_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_RCV.1"))
            {
                textBox2.Text = FPT_RCV_1_hierarchy;
                textBox3.Text = FPT_RCV_1_dependence;
                textBox4.Text = FPT_RCV_1_1;
                textBox5.Text = FPT_RCV_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_RCV.2"))
            {
                textBox2.Text = FPT_RCV_2_hierarchy;
                textBox3.Text = FPT_RCV_2_dependence;
                textBox4.Text = FPT_RCV_2_1;
                textBox5.Text = FPT_RCV_2_1_description;
                textBox6.Text = FPT_RCV_2_2;
                textBox7.Text = FPT_RCV_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_RCV.3"))
            {
                textBox2.Text = FPT_RCV_3_hierarchy;
                textBox3.Text = FPT_RCV_3_dependence;
                textBox4.Text = FPT_RCV_3_1;
                textBox5.Text = FPT_RCV_3_1_description;
                textBox6.Text = FPT_RCV_3_2;
                textBox7.Text = FPT_RCV_3_2_description;
                textBox8.Text = FPT_RCV_3_3;
                textBox9.Text = FPT_RCV_3_3_description;
                textBox10.Text = FPT_RCV_3_4;
                textBox11.Text = FPT_RCV_3_4_description;
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_RCV.4"))
            {
                textBox2.Text = FPT_RCV_4_hierarchy;
                textBox3.Text = FPT_RCV_4_dependence;
                textBox4.Text = FPT_RCV_4_1;
                textBox5.Text = FPT_RCV_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_RPL.1"))
            {
                textBox2.Text = FPT_RPL_1_hierarchy;
                textBox3.Text = FPT_RPL_1_dependence;
                textBox4.Text = FPT_RPL_1_1;
                textBox5.Text = FPT_RPL_1_1_description;
                textBox6.Text = FPT_RPL_1_2;
                textBox7.Text = FPT_RPL_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_SSP.1"))
            {
                textBox2.Text = FPT_SSP_1_hierarchy;
                textBox3.Text = FPT_SSP_1_dependence;
                textBox4.Text = FPT_SSP_1_1;
                textBox5.Text = FPT_SSP_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_SSP.2"))
            {
                textBox2.Text = FPT_SSP_2_hierarchy;
                textBox3.Text = FPT_SSP_2_dependence;
                textBox4.Text = FPT_SSP_2_1;
                textBox5.Text = FPT_SSP_2_1_description;
                textBox6.Text = FPT_SSP_2_2;
                textBox7.Text = FPT_SSP_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_STM.1"))
            {
                textBox2.Text = FPT_STM_1_hierarchy;
                textBox3.Text = FPT_STM_1_dependence;
                textBox4.Text = FPT_STM_1_1;
                textBox5.Text = FPT_STM_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_TDC.1"))
            {
                textBox2.Text = FPT_TDC_1_hierarchy;
                textBox3.Text = FPT_TDC_1_dependence;
                textBox4.Text = FPT_TDC_1_1;
                textBox5.Text = FPT_TDC_1_1_description;
                textBox6.Text = FPT_TDC_1_2;
                textBox7.Text = FPT_TDC_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_TRC.1"))
            {
                textBox2.Text = FPT_TRC_1_hierarchy;
                textBox3.Text = FPT_TRC_1_dependence;
                textBox4.Text = FPT_TRC_1_1;
                textBox5.Text = FPT_TRC_1_1_description;
                textBox6.Text = FPT_TRC_1_2;
                textBox7.Text = FPT_TRC_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FPT_TST.1"))
            {
                textBox2.Text = FPT_TST_1_hierarchy;
                textBox3.Text = FPT_TST_1_dependence;
                textBox4.Text = FPT_TST_1_1;
                textBox5.Text = FPT_TST_1_1_description;
                textBox6.Text = FPT_TST_1_2;
                textBox7.Text = FPT_TST_1_2_description;
                textBox8.Text = FPT_TST_1_3;
                textBox9.Text = FPT_TST_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_FLT.1"))
            {
                textBox2.Text = FRU_FLT_1_hierarchy;
                textBox3.Text = FRU_FLT_1_dependence;
                textBox4.Text = FRU_FLT_1_1;
                textBox5.Text = FRU_FLT_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_FLT.2"))
            {
                textBox2.Text = FRU_FLT_2_hierarchy;
                textBox3.Text = FRU_FLT_2_dependence;
                textBox4.Text = FRU_FLT_2_1;
                textBox5.Text = FRU_FLT_2_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_PRS.1"))
            {
                textBox2.Text = FRU_PRS_1_hierarchy;
                textBox3.Text = FRU_PRS_1_dependence;
                textBox4.Text = FRU_PRS_1_1;
                textBox5.Text = FRU_PRS_1_1_description;
                textBox6.Text = FRU_PRS_1_2;
                textBox7.Text = FRU_PRS_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_PRS.2"))
            {
                textBox2.Text = FRU_PRS_2_hierarchy;
                textBox3.Text = FRU_PRS_2_dependence;
                textBox4.Text = FRU_PRS_2_1;
                textBox5.Text = FRU_PRS_2_1_description;
                textBox6.Text = FRU_PRS_2_2;
                textBox7.Text = FRU_PRS_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_RSA.1"))
            {
                textBox2.Text = FRU_RSA_1_hierarchy;
                textBox3.Text = FRU_RSA_1_dependence;
                textBox4.Text = FRU_RSA_1_1;
                textBox5.Text = FRU_RSA_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FRU_RSA.2"))
            {
                textBox2.Text = FRU_RSA_2_hierarchy;
                textBox3.Text = FRU_RSA_2_dependence;
                textBox4.Text = FRU_RSA_2_1;
                textBox5.Text = FRU_RSA_2_1_description;
                textBox6.Text = FRU_RSA_2_2;
                textBox7.Text = FRU_RSA_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_LSA.1"))
            {
                textBox2.Text = FTA_LSA_1_hierarchy;
                textBox3.Text = FTA_LSA_1_dependence;
                textBox4.Text = FTA_LSA_1_1;
                textBox5.Text = FTA_LSA_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_MCS.1"))
            {
                textBox2.Text = FTA_MCS_1_hierarchy;
                textBox3.Text = FTA_MCS_1_dependence;
                textBox4.Text = FTA_MCS_1_1;
                textBox5.Text = FTA_MCS_1_1_description;
                textBox6.Text = FTA_MCS_1_2;
                textBox7.Text = FTA_MCS_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_MCS.2"))
            {
                textBox2.Text = FTA_MCS_2_hierarchy;
                textBox3.Text = FTA_MCS_2_dependence;
                textBox4.Text = FTA_MCS_2_1;
                textBox5.Text = FTA_MCS_2_1_description;
                textBox6.Text = FTA_MCS_2_2;
                textBox7.Text = FTA_MCS_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_SSL.1"))
            {
                textBox2.Text = FTA_SSL_1_hierarchy;
                textBox3.Text = FTA_SSL_1_dependence;
                textBox4.Text = FTA_SSL_1_1;
                textBox5.Text = FTA_SSL_1_1_description;
                textBox6.Text = FTA_SSL_1_2;
                textBox7.Text = FTA_SSL_1_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_SSL.2"))
            {
                textBox2.Text = FTA_SSL_2_hierarchy;
                textBox3.Text = FTA_SSL_2_dependence;
                textBox4.Text = FTA_SSL_2_1;
                textBox5.Text = FTA_SSL_2_1_description;
                textBox6.Text = FTA_SSL_2_2;
                textBox7.Text = FTA_SSL_2_2_description;
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_SSL.3"))
            {
                textBox2.Text = FTA_SSL_3_hierarchy;
                textBox3.Text = FTA_SSL_3_dependence;
                textBox4.Text = FTA_SSL_3_1;
                textBox5.Text = FTA_SSL_3_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_SSL.4"))
            {
                textBox2.Text = FTA_SSL_4_hierarchy;
                textBox3.Text = FTA_SSL_4_dependence;
                textBox4.Text = FTA_SSL_4_1;
                textBox5.Text = FTA_SSL_4_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_TAB.1"))
            {
                textBox2.Text = FTA_TAB_1_hierarchy;
                textBox3.Text = FTA_TAB_1_dependence;
                textBox4.Text = FTA_TAB_1_1;
                textBox5.Text = FTA_TAB_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_TAH.1"))
            {
                textBox2.Text = FTA_TAH_1_hierarchy;
                textBox3.Text = FTA_TAH_1_dependence;
                textBox4.Text = FTA_TAH_1_1;
                textBox5.Text = FTA_TAH_1_1_description;
                textBox6.Text = FTA_TAH_1_2;
                textBox7.Text = FTA_TAH_1_2_description;
                textBox8.Text = FTA_TAH_1_3;
                textBox9.Text = FTA_TAH_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTA_TSE.1"))
            {
                textBox2.Text = FTA_TSE_1_hierarchy;
                textBox3.Text = FTA_TSE_1_dependence;
                textBox4.Text = FTA_TSE_1_1;
                textBox5.Text = FTA_TSE_1_1_description;
                textBox6.Text = "";
                textBox7.Text = "";
                textBox8.Text = "";
                textBox9.Text = "";
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTP_ITC.1"))
            {
                textBox2.Text = FTP_ITC_1_hierarchy;
                textBox3.Text = FTP_ITC_1_dependence;
                textBox4.Text = FTP_ITC_1_1;
                textBox5.Text = FTP_ITC_1_1_description;
                textBox6.Text = FTP_ITC_1_3;
                textBox7.Text = FTP_ITC_1_2_description;
                textBox8.Text = FTP_ITC_1_3;
                textBox9.Text = FTP_ITC_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else if (textBox1.Text.Contains("FTP_TRP.1"))
            {
                textBox2.Text = FTP_TRP_1_hierarchy;
                textBox3.Text = FTP_TRP_1_dependence;
                textBox4.Text = FTP_TRP_1_1;
                textBox5.Text = FTP_TRP_1_1_description;
                textBox6.Text = FTP_TRP_1_3;
                textBox7.Text = FTP_TRP_1_2_description;
                textBox8.Text = FTP_TRP_1_3;
                textBox9.Text = FTP_TRP_1_3_description;
                textBox10.Text = "";
                textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";
            }
            else { textBox2.Text = "";
                   textBox3.Text = "";
                   textBox4.Text = "";
                   textBox5.Text = "";
                   textBox6.Text = "";
                   textBox7.Text = "";
                   textBox8.Text = "";
                   textBox9.Text = "";
                   textBox10.Text = "";
                   textBox11.Text = "";
                textBox12.Text = "";
                textBox13.Text = "";
                textBox14.Text = "";
                textBox15.Text = "";
                textBox16.Text = "";
                textBox17.Text = "";


            }

        }

        

        private void Form1_Load()
        {
            // Add parent node
            TreeNode node = treeViewControl.Nodes.Add("root", "Классы ФБО");

            // Add child node with subnodes
                TreeNode fau = node.Nodes.Add("FAU", "Класс FAU: Аудит безопасности");
                    TreeNode fau_arp = fau.Nodes.Add("FAU_ARP", "FAU_ARP: Автоматическая реакция аудита безопасности");
                        fau_arp.Nodes.Add("FAU_ARP.1", "FAU_ARP.1: Сигналы нарушения безопасности");
                    TreeNode fau_gen = fau.Nodes.Add("FAU_GEN", "FAU_GEN: Генерация данных аудита безопасности");
                        fau_gen.Nodes.Add("FAU_GEN.1", "FAU_GEN.1: Генерация данных аудита");
                        fau_gen.Nodes.Add("FAU_GEN.2", "FAU_GEN.2: Ассоциация идентификатора пользователя");
                    TreeNode fau_saa = fau.Nodes.Add("FAU_SAA", "FAU_SAA: Анализ аудита безопасности");
                        fau_saa.Nodes.Add("FAU_SAA.1", "FAU_SAA.1: Анализ потенциального нарушения");
                        fau_saa.Nodes.Add("FAU_SAA.2", "FAU_SAA.2: Выявление аномалии, основанное на профиле");
                        fau_saa.Nodes.Add("FAU_SAA.3", "FAU_SAA.3: Простая эвристика атаки");
                        fau_saa.Nodes.Add("FAU_SAA.4", "FAU_SAA.4: Сложная эвристика атаки");
                    TreeNode fau_sar = fau.Nodes.Add("FAU_SAR", "FAU_SAR: Просмотр аудита безопасности");
                        fau_sar.Nodes.Add("FAU_SAR.1", "FAU_SAR.1: Просмотр аудита");
                        fau_sar.Nodes.Add("FAU_SAR.2", "FAU_SAR.2: Ограниченный просмотр аудита");
                        fau_sar.Nodes.Add("FAU_SAR.3", "FAU_SAR.3: Выборочный просмотр аудита");
                    TreeNode fau_sel = fau.Nodes.Add("FAU_SEL", "FAU_SEL: Выбор события аудита безопасности");
                        fau_sel.Nodes.Add("FAU_SEL.1", "FAU_SEL.1: Избирательный аудит");
                    TreeNode fau_stg = fau.Nodes.Add("FAU_STG", "FAU_STG: Хранение данных аудита безопасности");
                        fau_stg.Nodes.Add("FAU_STG.1", "FAU_STG.1: Защищенное хранение журнала аудита");
                        fau_stg.Nodes.Add("FAU_STG.2", "FAU_STG.2: Гарантии доступности данных аудита");
                        fau_stg.Nodes.Add("FAU_STG.3", "FAU_STG.3: Действия в случае возможной потери данных аудита");
                        fau_stg.Nodes.Add("FAU_STG.4", "FAU_STG.4: Предотвращение потери данных аудита");

                TreeNode fco = node.Nodes.Add("FCO", "Класс FCO: Связь");
                    TreeNode fco_nro = fco.Nodes.Add("FCO_NRO", "FCO_NRO: Неотказуемость отправления");
                        fco_nro.Nodes.Add("FCO_NRO.1", "FCO_NRO.1: Избирательное доказательство отправления");
                        fco_nro.Nodes.Add("FCO_NRO.2", "FCO_NRO.2: Принудительное доказательство отправления");
                    TreeNode fco_nrr = fco.Nodes.Add("FCO_NRR", "FCO_NRR: Неотказуемость получения");
                        fco_nrr.Nodes.Add("FCO_NRR.1", "FCO_NRR.1: Избирательное доказательство получения");
                        fco_nrr.Nodes.Add("FCO_NRR.2", "FCO_NRR.2: Принудительное доказательство получения");

                TreeNode fcs = node.Nodes.Add("FCS", "Класс FCS: Криптографическая поддержка");
                    TreeNode fcs_ckm = fcs.Nodes.Add("FCS_CKM", "FCS_CKM: Управление криптографическими ключами");
                        fcs_ckm.Nodes.Add("FCS_CKM.1", "FCS_CKM.1: Генерация криптографических ключей");
                        fcs_ckm.Nodes.Add("FCS_CKM.2", "FCS_CKM.2: Распределение криптографических ключей");
                        fcs_ckm.Nodes.Add("FCS_CKM.3", "FCS_CKM.3: Доступ к криптографическим ключам");
                        fcs_ckm.Nodes.Add("FCS_CKM.4", "FCS_CKM.4: Уничтожение криптографических ключей");
                    TreeNode fcs_cop = fcs.Nodes.Add("FCS_COP", "FCS_COP: Неотказуемость получения");
                        fcs_cop.Nodes.Add("FCS_COP.1", "FCS_COP.1: Криптографические операции");

            TreeNode fdp = node.Nodes.Add("FDP", "Класс FDP: Защита данных пользователя");
            TreeNode fdp_acc = fdp.Nodes.Add("FDP_ACC", "FDP_ACC: Политика управления доступом");
            fdp_acc.Nodes.Add("FDP_ACC.1", "FDP_ACC.1: Ограниченное управление доступом");
            fdp_acc.Nodes.Add("FDP_ACC.2", "FDP_ACC.2: Полное управление доступом");
            TreeNode fdp_acf = fdp.Nodes.Add("FDP_ACF", "FDP_ACF: Функция управления доступом");
            fdp_acf.Nodes.Add("FDP_ACF.1", "FDP_ACF.1: Управление доступом, основанное на атрибутах безопасности");
            TreeNode fdp_dau = fdp.Nodes.Add("FDP_DAU", "FDP_DAU: Аутентификация данных");
            fdp_dau.Nodes.Add("FDP_DAU.1", "FDP_DAU.1: Базовая аутентификация данных");
            fdp_dau.Nodes.Add("FDP_DAU.2", "FDP_DAU.2: Аутентификация данных с идентификацией гаранта");
            TreeNode fdp_etc = fdp.Nodes.Add("FDP_ETC", "FDP_ETC: Экспорт данных за пределы действия ФБО");
            fdp_etc.Nodes.Add("FDP_ETC.1", "FDP_ETC.1: Экспорт данных пользователя без атрибутов безопасности");
            fdp_etc.Nodes.Add("FDP_ETC.2", "FDP_ETC.2: Экспорт данных пользователя с атрибутов безопасности");
            TreeNode fdp_ifc = fdp.Nodes.Add("FDP_IFC", "FDP_IFC: Политика управления информационными потоками");
            fdp_ifc.Nodes.Add("FDP_IFC.1", "FDP_IFC.1: Ограниченное управление информационными потоками");
            fdp_ifc.Nodes.Add("FDP_IFC.2", "FDP_IFC.2: Полное управление информационными потоками");
            TreeNode fdp_iff = fdp.Nodes.Add("FDP_IFF", "FDP_IFF: Функция управления информационными потоками");
            fdp_iff.Nodes.Add("FDP_IFF.1", "FDP_IFF.1: Простые атрибуты безопасности");
            fdp_iff.Nodes.Add("FDP_IFF.2", "FDP_IFF.2: Иерархические атрибуты безопасности");
            fdp_iff.Nodes.Add("FDP_IFF.3", "FDP_IFF.3: Ограничение неразрешенных информационных потоков");
            fdp_iff.Nodes.Add("FDP_IFF.4", "FDP_IFF.4: Частичное устранение неразрешенных информационных потоков");
            fdp_iff.Nodes.Add("FDP_IFF.5", "FDP_IFF.5: Полное устранение неразрешенных информационных потоков");
            fdp_iff.Nodes.Add("FDP_IFF.6", "FDP_IFF.6: Мониторинг неразрешенных информационных потоков");
            TreeNode fdp_itc = fdp.Nodes.Add("FDP_ITC", "FDP_ITC: Импорт данных за пределы действия ФБО");
            fdp_itc.Nodes.Add("FDP_ITC.1", "FDP_ITC.1: Импорт данных пользователя без атрибутов безопасности");
            fdp_itc.Nodes.Add("FDP_ITC.2", "FDP_ITC.2: Импорт данных пользователя с атрибутов безопасности");
            TreeNode fdp_itt = fdp.Nodes.Add("FDP_ITT", "FDP_ITT: Передача в пределах ОО");
            fdp_itt.Nodes.Add("FDP_ITT.1", "FDP_ITT.1: Базовая защита внутренней передачи");
            fdp_itt.Nodes.Add("FDP_ITT.2", "FDP_ITT.2: Разделение передачи по атрибутам");
            fdp_itt.Nodes.Add("FDP_ITT.3", "FDP_ITT.3: Мониторинг целостности");
            fdp_itt.Nodes.Add("FDP_ITT.4", "FDP_ITT.4: Мониторинг целостности по атрибутам");
            TreeNode fdp_rip = fdp.Nodes.Add("FDP_RIP", "FDP_RIP: Защита остаточной информации");
            fdp_rip.Nodes.Add("FDP_RIP.1", "FDP_RIP.1: Ограниченная защита остаточной информации");
            fdp_rip.Nodes.Add("FDP_RIP.2", "FDP_RIP.2: Полная защита остаточной информации");
            TreeNode fdp_rol = fdp.Nodes.Add("FDP_ROL", "FDP_ROL: Откат");
            fdp_rol.Nodes.Add("FDP_ROL.1", "FDP_ROL.1: Базовый откат");
            fdp_rol.Nodes.Add("FDP_ROL.2", "FDP_ROL.2: Расширенный откат");
            TreeNode fdp_sdi = fdp.Nodes.Add("FDP_SDI", "FDP_SDI: Целостность хранимых данных");
            fdp_sdi.Nodes.Add("FDP_SDI.1", "FDP_SDI.1: Мониторинг целостности хранимых данных");
            fdp_sdi.Nodes.Add("FDP_SDI.2", "FDP_SDI.2: Мониторинг целостности хранимых данных и предпринимаемые действия");
            TreeNode fdp_uct = fdp.Nodes.Add("FDP_UCT", "FDP_UCT: Защита конфиденциальности данных пользователя при передаче между ФБО");
            fdp_uct.Nodes.Add("FDP_UCT.1", "FDP_UCT.1: Базовая конфиденциальность обмена данными");
            TreeNode fdp_uit = fdp.Nodes.Add("FDP_UIT", "FDP_UIT: Защита целостности данных пользователя при передаче между ФБО");
            fdp_uit.Nodes.Add("FDP_UIT.1", "FDP_UIT.1: Целостность передаваемых данных");
            fdp_uit.Nodes.Add("FDP_UIT.2", "FDP_UIT.2: Восстановление переданных данных источником");
            fdp_uit.Nodes.Add("FDP_UIT.3", "FDP_UIT.3: Восстановление переданных данных получателем");

            TreeNode fia = node.Nodes.Add("FIA", "Класс FIA: Идентификация и аутентификация");
            TreeNode fia_afl = fia.Nodes.Add("FIA_AFL", "FIA_AFL: Отказы аутентификации");
            fia_afl.Nodes.Add("FIA_AFL.1", "FIA_AFL.1: Обработка отказов аутентификации");
            TreeNode fia_atd = fia.Nodes.Add("FIA_ATD", "FIA_ATD: Определение атрибутов пользователя");
            fia_atd.Nodes.Add("FIA_ATD.1", "FIA_ATD.1: Определение атрибутов пользователя");
            TreeNode fia_sos = fia.Nodes.Add("FIA_SOS", "FIA_SOS: Спецификация секретов");
            fia_sos.Nodes.Add("FIA_SOS.1", "FIA_SOS.1: Верификация секретов");
            fia_sos.Nodes.Add("FIA_SOS.2", "FIA_SOS.2: Генерация секретов ФБО");
            TreeNode fia_uau = fia.Nodes.Add("FIA_UAU", "FIA_UAU: Аутентификация пользователя");
            fia_uau.Nodes.Add("FIA_UAU.1", "FIA_UAU.1: Выбор момента аутентификации");
            fia_uau.Nodes.Add("FIA_UAU.2", "FIA_UAU.2: Аутентификация до любых действий пользователя");
            fia_uau.Nodes.Add("FIA_UAU.3", "FIA_UAU.3: Аутентификация, защищенная от подделок");
            fia_uau.Nodes.Add("FIA_UAU.4", "FIA_UAU.4: Механизмы одноразовой аутентификации");
            fia_uau.Nodes.Add("FIA_UAU.5", "FIA_UAU.5: Сочетание механизмов аутентификации");
            fia_uau.Nodes.Add("FIA_UAU.6", "FIA_UAU.6: Повторная аутентификация");
            fia_uau.Nodes.Add("FIA_UAU.7", "FIA_UAU.7: Аутентификация с защищенной обратной связью");
            TreeNode fia_uid = fia.Nodes.Add("FIA_UID", "FIA_UID: Идентификация пользователя");
            fia_uid.Nodes.Add("FIA_UID.1", "FIA_UID.1: Выбор момента идентификации");
            fia_uid.Nodes.Add("FIA_UID.2", "FIA_UID.2: Идентификация до любых действий пользователя");
            TreeNode fia_usb = fia.Nodes.Add("FIA_USB", "FIA_USB: Связывание пользователь-субъект");
            fia_usb.Nodes.Add("FIA_USB.1", "FIA_USB.1: Связывание пользователь-субъект");

            TreeNode fmt = node.Nodes.Add("FMT", "Класс FMT: Управление безопасностью");
            TreeNode fmt_mof = fmt.Nodes.Add("FMT_MOF", "FMT_MOF: Управление отдельными функциями ФБО");
            fmt_mof.Nodes.Add("FMT_MOF.1", "FMT_MOF.1: Управление режимом выполнения функций безопасности");
            TreeNode fmt_msa = fmt.Nodes.Add("FMT_MSA", "FMT_MSA: Управление атрибутами безопасности");
            fmt_msa.Nodes.Add("FMT_MSA.1", "FMT_MSA.1: Управление атрибутами безопасности");
            fmt_msa.Nodes.Add("FMT_MSA.2", "FMT_MSA.2: Безопасные значения атрибутов безопасности");
            fmt_msa.Nodes.Add("FMT_MSA.3", "FMT_MSA.3: Инициализация статических атрибутов");
            fmt_msa.Nodes.Add("FMT_MSA.4", "FMT_MSA.4: Наследование значения атрибута безопасности");
            TreeNode fmt_mtd = fmt.Nodes.Add("FMT_MTD", "FMT_MTD: Управление данными ФБО");
            fmt_mtd.Nodes.Add("FMT_MTD.1", "FMT_MTD.1: Управление данными ФБО");
            fmt_mtd.Nodes.Add("FMT_MTD.2", "FMT_MTD.2: Управление ограничениями данных ФБО");
            fmt_mtd.Nodes.Add("FMT_MTD.3", "FMT_MTD.3: Безопасные данные ФБО");
            TreeNode fmt_rev = fmt.Nodes.Add("FMT_REV", "FMT_REV: Отмена");
            fmt_rev.Nodes.Add("FMT_REV.1", "FMT_REV.1: Отмена");
            TreeNode fmt_sae = fmt.Nodes.Add("FMT_SAE", "FMT_SAE: Срок действия атрибута безопасности");
            fmt_sae.Nodes.Add("FMT_SAE.1", "FMT_SAE.1: Ограниченная по времени авторизация");
            TreeNode fmt_smf = fmt.Nodes.Add("FMT_SMF", "FMT_SMF: Спецификация функций безопасности");
            fmt_smf.Nodes.Add("FMT_SMF.1", "FMT_SMF.1: Спецификация функций управления");
            TreeNode fmt_smr = fmt.Nodes.Add("FMT_SMR", "FMT_SMR: Роли управления безопасности");
            fmt_smr.Nodes.Add("FMT_SMR.1", "FMT_SMR.1: Роли безопасности");
            fmt_smr.Nodes.Add("FMT_SMR.2", "FMT_SMR.2: Ограничения на роли безопасности");
            fmt_smr.Nodes.Add("FMT_SMR.3", "FMT_SMR.3: Принятие ролей");

            TreeNode fpr = node.Nodes.Add("FPR", "Класс FPR: Приватность");
            TreeNode fpr_ano = fpr.Nodes.Add("FPR_ANO", "FPR_ANO: Анонимность");
            fpr_ano.Nodes.Add("FPR_ANO.1", "FPR_ANO.1: Анонимность");
            fpr_ano.Nodes.Add("FPR_ANO.2", "FPR_ANO.2: Анонимность без запроса информации");
            TreeNode fpr_pse = fpr.Nodes.Add("FPR_PSE", "FPR_PSE: Псевдонимность");
            fpr_pse.Nodes.Add("FPR_PSE.1", "FPR_PSE.1: Псевдонимность");
            fpr_pse.Nodes.Add("FPR_PSE.2", "FPR_PSE.2: Обратимая псевдонимность");
            fpr_pse.Nodes.Add("FPR_PSE.3", "FPR_PSE.3: Альтернативная псевдонимность");
            TreeNode fpr_unl = fpr.Nodes.Add("FPR_UNL", "FPR_UNL: Невозможность ассоциации");
            fpr_unl.Nodes.Add("FPR_UNL.1", "FPR_UNL.1: Невозможность ассоциации");
            TreeNode fpr_uno = fpr.Nodes.Add("FPR_UNO", "FPR_UNO: Скрытность");
            fpr_uno.Nodes.Add("FPR_UNO.1", "FPR_UNO.1: Скрытность");
            fpr_uno.Nodes.Add("FPR_UNO.2", "FPR_UNO.2: Распределение информации, влияющее на скрытность");
            fpr_uno.Nodes.Add("FPR_UNO.3", "FPR_UNO.3: Скрытность без запроса инфомации");
            fpr_uno.Nodes.Add("FPR_UNO.4", "FPR_UNO.4: Открытость для уполномоченного пользователя");

            TreeNode fpt = node.Nodes.Add("FPT", "Класс FPT: Защита ФБО");
            TreeNode fpt_fls = fpt.Nodes.Add("FPT_FLS", "FPT_FLS: Безопасность при сбое");
            fpt_fls.Nodes.Add("FPT_FLS.1", "FPT_FLS.1: Сбой с сохранением безопасного состояния");
            TreeNode fpt_ita = fpt.Nodes.Add("FPT_ITA", "FPT_ITA: Доступность экспортируемых данных ФБО");
            fpt_ita.Nodes.Add("FPT_ITA.1", "FPT_ITA.1: Доступность экспортируемых данных ФБО в пределах заданной метрики");
            TreeNode fpt_itc = fpt.Nodes.Add("FPT_ITC", "FPT_ITC: Конфиденциальность экспортируемых данных ФБО");
            fpt_itc.Nodes.Add("FPT_ITC.1", "FPT_ITC.1: Конфиденциальность экспортируемых данных ФБО при передаче");
            TreeNode fpt_iti = fpt.Nodes.Add("FPT_ITI", "FPT_ITI: Целостность экспортируемых данных ФБО");
            fpt_iti.Nodes.Add("FPT_ITI.1", "FPT_ITI.1: Обнаружение модификации экспортируемых данных");
            fpt_iti.Nodes.Add("FPT_ITI.2", "FPT_ITI.2: Обнаружение и исправление модификации экспортируемых данных");
            TreeNode fpt_itt = fpt.Nodes.Add("FPT_ITT", "FPT_ITT: Передача данных ФБО в пределах ОО");
            fpt_itt.Nodes.Add("FPT_ITT.1", "FPT_ITT.1: Базовая защита внутренней передачи данных ФБО");
            fpt_itt.Nodes.Add("FPT_ITT.2", "FPT_ITT.2: Разделение данных ФБО при передаче");
            fpt_itt.Nodes.Add("FPT_ITT.3", "FPT_ITT.3: Мониторинг целостности данных ФБО");
            TreeNode fpt_php = fpt.Nodes.Add("FPT_PHP", "FPT_PHP: Физическая защита ФБО");
            fpt_php.Nodes.Add("FPT_PHP.1", "FPT_PHP.1: Пассивное обнаружение физического нападения");
            fpt_php.Nodes.Add("FPT_PHP.2", "FPT_PHP.2: Оповещение о физическом нападении");
            fpt_php.Nodes.Add("FPT_PHP.3", "FPT_PHP.3: Противодействие физическому нападению");
            TreeNode fpt_rcv = fpt.Nodes.Add("FPT_RCV", "FPT_RCV: Надежное восстановление");
            fpt_rcv.Nodes.Add("FPT_RCV.1", "FPT_RCV.1: Ручное восстановление");
            fpt_rcv.Nodes.Add("FPT_RCV.2", "FPT_RCV.2: Автоматическое восстановление");
            fpt_rcv.Nodes.Add("FPT_RCV.3", "FPT_RCV.3: Автоматическое восстановление без недопустимой потери");
            fpt_rcv.Nodes.Add("FPT_RCV.4", "FPT_RCV.4: Восстановление функции");
            TreeNode fpt_rpl = fpt.Nodes.Add("FPT_RPL", "FPT_RPL: Обнаружение повторного использования");
            fpt_rpl.Nodes.Add("FPT_RPL.1", "FPT_RPL.1: Обнаружение повторного использования");
            TreeNode fpt_ssp = fpt.Nodes.Add("FPT_SSP", "FPT_SSP: Протокол синхронизации состояний");
            fpt_ssp.Nodes.Add("FPT_SSP.1", "FPT_SSP.1: Одностороннее надежное подтверждение");
            fpt_ssp.Nodes.Add("FPT_SSP.2", "FPT_SSP.2: Взаимное надежное подтверждение");
            TreeNode fpt_stm = fpt.Nodes.Add("FPT_STM", "FPT_STM: Метки времени");
            fpt_stm.Nodes.Add("FPT_STM.1", "FPT_STM.1: Надежные метки времени");
            TreeNode fpt_tdc = fpt.Nodes.Add("FPT_TDC", "FPT_TDC: Согласованность данных ФБО между ФБО");
            fpt_tdc.Nodes.Add("FPT_TDC.1", "FPT_TDC.1: Базовая согласованность данных ФБО между ФБО");
            TreeNode fpt_trc = fpt.Nodes.Add("FPT_TRC", "FPT_TRC: Согласованность данных ФБО при дублировании в пределах ОО");
            fpt_trc.Nodes.Add("FPT_TRC.1", "FPT_TRC.1: Согласованность дублируемых данных ФБО");
            TreeNode fpt_tst = fpt.Nodes.Add("FPT_TST", "FPT_TST: Самотестирование ФБО");
            fpt_tst.Nodes.Add("FPT_TST.1", "FPT_TST.1: Тестирование ФБО");

            TreeNode fru = node.Nodes.Add("FRU", "Класс FRU: Использование ресурсов");
            TreeNode fru_flt = fru.Nodes.Add("FRU_FLT", "FRU_FLT: Отказоустойчивость");
            fru_flt.Nodes.Add("FRU_FLT.1", "FRU_FLT.1: Пониженная отказоустойчивость");
            fru_flt.Nodes.Add("FRU_FLT.2", "FRU_FLT.2: Ограниченная отказоустойчивость");
            TreeNode fru_prs = fru.Nodes.Add("FRU_PRS", "FRU_PRS: Приоритет обслуживания");
            fru_prs.Nodes.Add("FRU_PRS.1", "FRU_PRS.1: Ограниченный приоритет обслуживания");
            fru_prs.Nodes.Add("FRU_PRS.2", "FRU_PRS.2: Полный приоритет обслуживания");
            TreeNode fru_rsa = fru.Nodes.Add("FRU_RSA", "FRU_RSA: Распределение ресурсов");
            fru_rsa.Nodes.Add("FRU_RSA.1", "FRU_RSA.1: Максимальные квоты");
            fru_rsa.Nodes.Add("FRU_RSA.2", "FRU_RSA.2: Минимальные и максимальные квоты");

            TreeNode fta = node.Nodes.Add("FTA", "Класс FTA: Доступ к ОО");
            TreeNode fta_lsa = fta.Nodes.Add("FTA_LSA", "FTA_LSA: Ограничение области выбираемых атрибутов");
            fta_lsa.Nodes.Add("FTA_LSA.1", "FTA_LSA.1: Ограничение области выбираемых атрибутов");
            TreeNode fta_mcs = fta.Nodes.Add("FTA_MCS", "FTA_MCS: Ограничение на параллельные сеансы");
            fta_mcs.Nodes.Add("FTA_MCS.1", "FTA_MCS.1: Базовое ограничение на параллельные сеансы");
            fta_mcs.Nodes.Add("FTA_MCS.2", "FTA_MCS.2: Ограничение на параллельные сеансы по атрибутам безопасности");
            TreeNode fta_ssl = fta.Nodes.Add("FTA_SSL", "FTA_SSL: Блокирование сеанса");
            fta_ssl.Nodes.Add("FTA_SSL.1", "FTA_SSL.1: Блокирование сеанса, инициированное ФБО");
            fta_ssl.Nodes.Add("FTA_SSL.2", "FTA_SSL.2: Блокирование, инициированное пользователем");
            fta_ssl.Nodes.Add("FTA_SSL.3", "FTA_SSL.3: Завершение, инициированное ФБО");
            fta_ssl.Nodes.Add("FTA_SSL.4", "FTA_SSL.4: Завершение, инициированное пользователем");
            TreeNode fta_tab = fta.Nodes.Add("FTA_TAB", "FTA_TAB: Предупреждение перед предоставлением доступа к ОО");
            fta_tab.Nodes.Add("FTA_TAB.1", "FTA_TAB.1: Предупреждения по умолчанию перед предоставлением доступа к ОО");
            TreeNode fta_tah = fta.Nodes.Add("FTA_TAH", "FTA_TAH: История доступа к ОО");
            fta_tah.Nodes.Add("FTA_TAH.1", "FTA_TAH.1: История доступа к ОО");
            TreeNode fta_tse = fta.Nodes.Add("FTA_TSE", "FTA_TSE: Открытие сеанса с ОО");
            fta_tse.Nodes.Add("FTA_TSE.1", "FTA_TSE.1: Открытие сеанса с ОО");

            TreeNode ftp = node.Nodes.Add("FTP", "Класс FTP: Доверенный маршрут/канал");
            TreeNode ftp_itc = ftp.Nodes.Add("FTP_ITC", "FTP_ITC: Доверенный канал передачи между ФБО");
            ftp_itc.Nodes.Add("FTP_ITC.1", "FTP_ITC.1: Доверенный канал передачи между ФБО");
            TreeNode ftp_trp = ftp.Nodes.Add("FTP_TRP", "FTP_TRP: Доверенный маршрут");
            ftp_trp.Nodes.Add("FTP_TRP.1", "FTP_TRP.1: Доверенный маршрут");


            var items = checkedListBox1.Items;
            items.Add("FAU_ARP.1");
            items.Add("FAU_GEN.1");
            items.Add("FAU_GEN.2");
            items.Add("FAU_SAA.1");
            items.Add("FAU_SAA.2");
            items.Add("FAU_SAA.3");
            items.Add("FAU_SAA.4");
            items.Add("FAU_SAR.1");
            items.Add("FAU_SAR.2");
            items.Add("FAU_SAR.3");
            items.Add("FAU_SEL.1");
            items.Add("FAU_STG.1");
            items.Add("FAU_STG.2");
            items.Add("FAU_STG.3");
            items.Add("FAU_STG.4");
            items.Add("FCO_NRO.1");
            items.Add("FCO_NRO.2");
            items.Add("FCO_NRR.1");
            items.Add("FCO_NRR.2");
            items.Add("FCS_CKM.1");
            items.Add("FCS_CKM.2");
            items.Add("FCS_CKM.3");
            items.Add("FCS_CKM.4");
            items.Add("FCS_COP.1");
            items.Add("FDP_ACC.1");
            items.Add("FDP_ACC.2");
            items.Add("FDP_ACF.1");
            items.Add("FDP_DAU.1");
            items.Add("FDP_DAU.2");
            items.Add("FDP_ETC.1");
            items.Add("FDP_ETC.2");
            items.Add("FDP_IFC.1");
            items.Add("FDP_IFC.2");
            items.Add("FDP_IFF.1");
            items.Add("FDP_IFF.2");
            items.Add("FDP_IFF.3");
            items.Add("FDP_IFF.4");
            items.Add("FDP_IFF.5");
            items.Add("FDP_IFF.6");
            items.Add("FDP_ITC.1");
            items.Add("FDP_ITC.2");
            items.Add("FDP_ITT.1");
            items.Add("FDP_ITT.2");
            items.Add("FDP_ITT.3");
            items.Add("FDP_ITT.4");
            items.Add("FDP_RIP.1");
            items.Add("FDP_RIP.2");
            items.Add("FDP_ROL.1");
            items.Add("FDP_ROL.2");
            items.Add("FDP_SDI.1");
            items.Add("FDP_SDI.2");
            items.Add("FDP_UCT.1");
            items.Add("FDP_UIT.1");
            items.Add("FDP_UIT.2");
            items.Add("FDP_UIT.3");
            items.Add("FIA_AFL.1");
            items.Add("FIA_ATD.1");
            items.Add("FIA_SOS.1");
            items.Add("FIA_SOS.2");
            items.Add("FIA_UAU.1");
            items.Add("FIA_UAU.2");
            items.Add("FIA_UAU.3");
            items.Add("FIA_UAU.4");
            items.Add("FIA_UAU.5");
            items.Add("FIA_UAU.6");
            items.Add("FIA_UAU.7");
            items.Add("FIA_UID.1");
            items.Add("FIA_UID.2");
            items.Add("FIA_USB.1");
            items.Add("FMT_MOF.1");
            items.Add("FMT_MSA.1");
            items.Add("FMT_MSA.2");
            items.Add("FMT_MSA.3");
            items.Add("FMT_MSA.4");
            items.Add("FMT_MTD.1");
            items.Add("FMT_MTD.2");
            items.Add("FMT_MTD.3");
            items.Add("FMT_REV.1");
            items.Add("FMT_SAE.1");
            items.Add("FMT_SMF.1");
            items.Add("FMT_SMR.1");
            items.Add("FMT_SMR.2");
            items.Add("FMT_SMR.3");
            items.Add("FPR_ANO.1");
            items.Add("FPR_ANO.2");
            items.Add("FPR_PSE.1");
            items.Add("FPR_PSE.2");
            items.Add("FPR_PSE.3");
            items.Add("FPR_UNL.1");
            items.Add("FPR_UNO.1");
            items.Add("FPR_UNO.2");
            items.Add("FPR_UNO.3");
            items.Add("FPR_UNO.4");
            items.Add("FPT_FLS.1");
            items.Add("FPT_ITA.1");
            items.Add("FPT_ITC.1");
            items.Add("FPT_ITI.1");
            items.Add("FPT_ITI.2");
            items.Add("FPT_ITT.1");
            items.Add("FPT_ITT.2");
            items.Add("FPT_ITT.3");
            items.Add("FPT_PHP.1");
            items.Add("FPT_PHP.2");
            items.Add("FPT_PHP.3");
            items.Add("FPT_RCV.1");
            items.Add("FPT_RCV.2");
            items.Add("FPT_RCV.3");
            items.Add("FPT_RCV.4");
            items.Add("FPT_RPL.1");
            items.Add("FPT_SSP.1");
            items.Add("FPT_SSP.2");
            items.Add("FPT_STM.1");
            items.Add("FPT_TDC.1");
            items.Add("FPT_TRC.1");
            items.Add("FPT_TST.1");
            items.Add("FRU_FLT.1");
            items.Add("FRU_FLT.2");
            items.Add("FRU_PRS.1");
            items.Add("FRU_PRS.2");
            items.Add("FRU_RSA.1");
            items.Add("FRU_RSA.2");
            items.Add("FTA_LSA.1");
            items.Add("FTA_MCS.1");
            items.Add("FTA_MCS.2");
            items.Add("FTA_SSL.1");
            items.Add("FTA_SSL.2");
            items.Add("FTA_SSL.3");
            items.Add("FTA_SSL.4");
            items.Add("FTA_TAB.1");
            items.Add("FTA_TAH.1");
            items.Add("FTA_TSE.1");
            items.Add("FTP_ITC.1");
            items.Add("FTP_TRP.1");
   
            // Add checkboxes to nodes
            //treeViewControl.CheckBoxes = true;

            // Expand first level
            node.Expand();
        }

        private void Form1_Load(object sender, EventArgs e)
        {

        }

        private void lblDisplay_Click(object sender, EventArgs e)
        {

        }

        private void treeViewControl_AfterSelect(object sender, TreeViewEventArgs e)
        {

        }

        private void tabPage1_Click(object sender, EventArgs e)
        {

        }

        private void textBox1_TextChanged(object sender, EventArgs e)
        {

        }

        private void checkedListBox1_SelectedIndexChanged_1(object sender, EventArgs e)
        {

        }

        private void textBox2_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox3_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox5_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox4_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox6_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox7_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox8_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox9_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox10_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox11_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox12_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox13_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox14_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox15_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox16_TextChanged(object sender, EventArgs e)
        {

        }

        private void textBox17_TextChanged(object sender, EventArgs e)
        {

        }

        private void tabControl1_SelectedIndexChanged(object sender, EventArgs e)
        {

        }

        private void tabPage2_Click(object sender, EventArgs e)
        {

        }
    }
}